[{"skillset":["Office 365","Microsoft Azure","Microsoft Active Directory","Windows Server","VMware Administration","Veeam"],"title":"Cloud Engineer - Upwork","description":"landing zone and Bicep\nCloud Engineer\nDevops\n...................................................<b>Skills</b>:        Office 365,                     Microsoft Azure,                     Microsoft Active Directory,                     Windows Server,                     VMware Administration,                     Veeam            ","link":"https://www.upwork.com/jobs/Cloud-Engineer_%7E01a79faab1d37e16c1?source=rss","processedDate":"2024-03-19T08:43:57.162Z","postedDate":"<b>Posted On</b>: February 26, 2024 09:17 UTC","id":"01a79faab1d37e16c1"},{"skillset":["DevOps","AWS OpsWorks"],"title":"Migration off Opsworks - Upwork","description":"Hello Team,\nWe have a multi-tier application hosted on AWS, that is managed by AWS Opsworks! As the service is coming to EOL in may, 2024. We are looking to migrate this service to AWS systems manager and I am looking for assistance regarding the same as I have limited exposure towards Chef. Please let me know if this looks familiar \nThanks,\nPrayas<b>Skills</b>:        DevOps,                     AWS OpsWorks            ","link":"https://www.upwork.com/jobs/Migration-off-Opsworks_%7E01bdddcf541daa13a2?source=rss","processedDate":"2024-03-19T08:44:02.820Z","postedDate":"<b>Posted On</b>: February 20, 2024 21:43 UTC","id":"01bdddcf541daa13a2"},{"skillset":["Amazon Web Services","Docker","DevOps","Git","Python"],"title":"Developer and DevOps Engineer with Extensive Experience - Upwork","description":"We are currently looking for a highly skilled and versatile developer and devops engineer to join our dynamic team. As a key member of our software development and deployment team, you will play a crucial role in the design, development, testing, and deployment of innovative software applications.\nTo excel in this role, you should have extensive experience in software development, with a deep understanding of both development and operations. You will need to leverage your expertise in various programming languages and frameworks to create cutting-edge solutions that meet our clients&#039; needs.\nIn addition to your technical skills, you should be well-versed in utilizing various DevOps tools and methodologies. This will enable you to streamline our development processes, automate workflows, and improve the efficiency and reliability of our software deployments. Your proficiency in version control systems will be invaluable in ensuring smooth collaboration and effective management of our codebase.\nA strong understanding of the software development life cycle is essential, as you will be responsible for guiding projects from conception to completion. You should be comfortable working in an agile environment, collaborating closely with cross-functional teams to deliver high-quality software solutions within tight deadlines.\nKey Responsibilities:\n- Collaborate with stakeholders to gather requirements and define project scope\n- Design and develop software applications using industry best practices and coding standards\n- Conduct thorough testing and debugging to ensure software quality and stability\n- Implement continuous integration and deployment strategies to automate software delivery\n- Monitor and optimize the performance of software applications\n- Troubleshoot and resolve issues throughout the software development life cycle\n- Stay up-to-date with emerging technologies and industry trends to drive innovation and improvement\nQualifications:\n- Bachelor&#039;s degree in Computer Science, Engineering, or a related field\n- Proven experience as a developer and devops engineer with a track record of successful software development and deployment projects\n- Proficiency in multiple programming languages such as Java, Python, C#, or JavaScript\n- Strong understanding of various frameworks, such as Spring, Django, .NET, or Node.js\n- Familiarity with popular DevOps tools, including Jenkins, Docker, Kubernetes, Ansible, or Chef\n- Experience with version control systems like Git or SVN\n- Knowledge of agile methodologies and their application in software development\n- Excellent problem-solving skills and attention to detail\nIf you are a motivated and innovative individual who thrives in a fast-paced environment, we would love to hear from you. Join our team and contribute to the development of groundbreaking software solutions that make a real impact in the industry.\nlambda, dynamodb. SQS<b>Skills</b>:        Amazon Web Services,                     Docker,                     DevOps,                     Git,                     Python            ","link":"https://www.upwork.com/jobs/Developer-and-DevOps-Engineer-with-Extensive-Experience_%7E01dc6535ac3b14e02a?source=rss","processedDate":"2024-03-19T08:44:02.820Z","postedDate":"<b>Posted On</b>: February 20, 2024 19:58 UTC","id":"01dc6535ac3b14e02a"},{"skillset":["Ebook Writing","Ghostwriting","Website Content","Recipe Writing","Event Planning","Quality Assurance","Cooking","Ebook Design","Digital Art","Progress Chef","Operational Plan","Event Management","Graphic Design"],"title":"Head Chef - Upwork","description":"1. A chef who can cook varieties of Burgers and fries.\n2. Work in a new setup.\n3. Help build a bigger team.<b>Skills</b>:        Ebook Writing,                     Ghostwriting,                     Website Content,                     Recipe Writing,                     Event Planning,                     Quality Assurance,                     Cooking,                     Ebook Design,                     Digital Art,                     Progress Chef,                     Operational Plan,                     Event Management,                     Graphic Design            ","link":"https://www.upwork.com/jobs/Head-Chef_%7E01e943c1a84e4ef262?source=rss","processedDate":"2024-03-19T08:44:02.820Z","postedDate":"<b>Posted On</b>: February 20, 2024 18:33 UTC","id":"01e943c1a84e4ef262"},{"skillset":["Amazon Web Services"],"title":"AWS Cloud Engineer  - Upwork","description":"Minimum Requirements:\n&bull;\tMinimum 5-year of experience.\n&bull;\tExpert in Linux administration.\n&bull;\tExpert in source code management systems such as git. \n&bull;\tExperience with tools like Kubernetes, Packer, Terraform, Ansible, Chef, Puppet, SaltStack, etc.\n&bull;\tExperience architecting infrastructure solutions and supporting large applications in AWS cloud.\n&bull;\tStrong experience in AWS conteraized deployments and other services such as ECS, EC2, VPC, S3, Route 53, RDS and Redshift.\n&bull;\tSolid understanding for Node.js deployments.\n&bull;\tProven ability to optimize production web servers and services for high volume internet traffic.\n&bull;\tHave experience configuring and optimizing Linux based servers such as PostgreSQL, bind, httpd, nginx, rabbitmq and elasticsearch.\n&bull;\tAdvanced knowledge of network services such as WAF, DNS, LDAP, Postfix, NT P and DHCP including remediation of performance issues.\n&bull;\tProven ability to architect highly available systems to meet business requirements.\n&bull;\tExperience with managing message queues and API gateways.\n&bull;\tStrong experience with SQL.\n&bull;\tKnowledge of best practices and IT operations in an always-up, always-available service.\n&bull;\tPassionate about adding 9s to system uptime.\n&bull;\t(Preferred) A working understanding of code and script with Python.\n&bull;\t(Preferred) MS/BS degree in Computer Science, Engineering or equivalent.<b>Skills</b>:        Amazon Web Services            ","link":"https://www.upwork.com/jobs/AWS-Cloud-Engineer_%7E0173613153e2ac44c0?source=rss","processedDate":"2024-03-19T08:44:02.820Z","postedDate":"<b>Posted On</b>: February 05, 2024 11:46 UTC","id":"0173613153e2ac44c0"},{"skillset":["Kubernetes","DigitalOcean"],"title":"Kubernetes Egress Gateway - Digitalocean - Upwork","description":"The existing Egress droplet we have configured on our DO K8 instance appears not to be working correctly after a recent unplanned upgrade.\nEgress is used to make our IP sticky for external applications, specifically external databases and firewalls.\nLooking for a devops to review the existing configuration and then confirm pathway to resolve the existing config or rebuild accordingly to the DO official workaround\nSetting up a DOKS Egress Gateway using Crossplane and Static Routes Operator\n(link removed)\nView for ongoing relationship to manage and maintain devops systems for the agency moving forward pending successful job and logical business approach.\nOther such jobs for future scope - enhancement to custom helm charts to allow file management of k8 volumes, ability to upload SSL Certs for remote databases etc.<b>Skills</b>:        Kubernetes,                     DigitalOcean            ","link":"https://www.upwork.com/jobs/Kubernetes-Egress-Gateway-Digitalocean_%7E019371e06cccc0bcd4?source=rss","processedDate":"2024-03-19T08:44:08.358Z","postedDate":"<b>Posted On</b>: February 18, 2024 23:11 UTC","id":"019371e06cccc0bcd4"},{"skillset":["Python","Google Cloud Platform"],"title":"Need DevOps Engineer with 4+ years of experience in Google Kubernetes Engine and Istio, Pulumi IAC - Upwork","description":"Seeking a DevOps professional to establish our Kubernetes cluster on Google Cloud, implementing Istio for advanced networking functionalities. Our infrastructure setup utilises Pulumi for Infrastructure As Code.\nThe preferred candidate should possess comprehensive skills in the following technologies:\n- Google Cloud Platform\n- Google Kubernetes Engine\n- Istio\n- Pulumi\n- GitHub Actions<b>Skills</b>:        Python,                     Google Cloud Platform            ","link":"https://www.upwork.com/jobs/Need-DevOps-Engineer-with-years-experience-Google-Kubernetes-Engine-and-Istio-Pulumi-IAC_%7E0120bfff88cae6d10f?source=rss","processedDate":"2024-03-19T08:44:13.979Z","postedDate":"<b>Posted On</b>: March 07, 2024 04:54 UTC","id":"0120bfff88cae6d10f"},{"skillset":["ASP.NET Core","Azure DevOps","Microsoft Azure","C#",".NET Framework"],"title":".NET / Azure Software Engineer needed for long term part time work - Upwork","description":"We need a capable software engineer, experienced in C#, .NET, Azure and Azure DevOps, and located in a compatible timezone to the US (Mexico / LatAm preferred).\nIdeal candidates will have a lot of experience in enterprise software development, including unit and end-to-end testing, automated pipelines etc. If you have an understanding of Pulumi, that&#039;s an advantage.\nWe&#039;re a team of 15 developers and managers, working with a couple of enterprise clients and your presence will assist us in growing! We&#039;ve been working together for years now and are a very tight-knit team.<b>Skills</b>:        ASP.NET Core,                     Azure DevOps,                     Microsoft Azure,                     C#,                     .NET Framework            ","link":"https://www.upwork.com/jobs/NET-Azure-Software-Engineer-needed-for-long-term-part-time-work_%7E01fc4b2b90e0b97da0?source=rss","processedDate":"2024-03-19T08:44:13.979Z","postedDate":"<b>Posted On</b>: March 06, 2024 16:51 UTC","id":"01fc4b2b90e0b97da0"},{"skillset":["Amazon Web Services","Golang"],"title":"Cloud Developer with AWS, Azure Experience - Upwork","description":"* Write Pulumi Infrastructure as Code modules in golang to deploy infrastructure on AWS.\n* The infrastructure modules should create AWS EKS Clusters, VPC Networks, AWS IAM resources etc.\n* The infrastructure code should be written in golang or python<b>Skills</b>:        Amazon Web Services,                     Golang            ","link":"https://www.upwork.com/jobs/Cloud-Developer-with-AWS-Azure-Experience_%7E01b20bb799498d7bf3?source=rss","processedDate":"2024-03-19T08:44:13.979Z","postedDate":"<b>Posted On</b>: February 26, 2024 22:09 UTC","id":"01b20bb799498d7bf3"},{"skillset":["JavaScript","Node.js","Python","DApps","Solidity","Blockchain Development"],"title":"Full-Stack Developer for Decentralized Healthcare Information Exchange App - Upwork","description":"Design and develop smart contracts in Solidity for the Ethereum blockchain, ensuring secure, efficient, and scalable functionality for healthcare information exchange.\nImplement backend services in Python and/or JavaScript (Node.js) that interact with the Ethereum blockchain, utilizing libraries such as Web3.py and Web3.js.\nWork with the Open Health Stack to create interoperable healthcare applications that adhere to industry standards and regulations.\nUse Pulumi for infrastructure management across various cloud platforms, ensuring robust, scalable, and efficient deployment of the application.\nCollaborate with a cross-functional team to define, design, and ship new features and functionalities.\nParticipate in code reviews, ensuring high-quality code standards and incorporating best practices in blockchain development.\nStay updated with the latest advancements in blockchain technology, Ethereum development tools, and healthcare IT standards to continually enhance the app. \nProven experience in developing smart contracts using Solidity and deploying them on the Ethereum blockchain.\nStrong proficiency in Python and JavaScript (Node.js), with experience in using Web3.py or Web3.js for blockchain interactions.\nFamiliarity with the Open Health Stack and its application in developing healthcare solutions is highly desirable.\nExperience with Pulumi or similar infrastructure-as-code (IaC) tools for managing cloud resources.\nUnderstanding of decentralized applications (DApps) architecture and the unique security considerations for blockchain-based applications.\nExcellent problem-solving skills, with the ability to work independently and as part of a team.\nStrong communication skills, capable of effectively collaborating with team members and stakeholders remotely.\nA detailed CV highlighting relevant experience.\nA cover letter explaining why you&#039;re the perfect fit for this project.\nLinks to previous blockchain projects, especially those in healthcare or related fields, if available.\nAvailability and preferred contract terms.\nApplications will be reviewed on a rolling basis until the position is filled. We&#039;re looking for passionate, innovative individuals who share our vision for a transformed healthcare industry. If you&#039;re ready to contribute to a cutting-edge project at the intersection of blockchain and healthcare, we&#039;d love to hear from you.<b>Skills</b>:        JavaScript,                     Node.js,                     Python,                     DApps,                     Solidity,                     Blockchain Development            ","link":"https://www.upwork.com/jobs/Full-Stack-Developer-for-Decentralized-Healthcare-Information-Exchange-App_%7E01416fd3827904c786?source=rss","processedDate":"2024-03-19T08:44:13.980Z","postedDate":"<b>Posted On</b>: February 11, 2024 15:23 UTC","id":"01416fd3827904c786"},{"skillset":["TypeScript","Python","MongoDB","React"],"title":"Full Stack Developer (Typescript, React, Tailwind, Python) - Upwork","description":"We are an ambitious startup based in the heart of Central Europe, pioneering the integration of Generative AI into the retail industry. Our team is on a mission to revolutionize how fashion is designed, produced, and experienced. To further our vision, we are seeking a talented and innovative Full Stack Developer to join our dynamic team.\nAs a Full Stack Developer in our company, you will play a pivotal role in developing and implementing a range of exciting projects. We offer a flexible and collaborative work environment where creativity and innovation are not just encouraged but are the essence of our work. While we value autonomy and offer the possibility to work asynchronously, we also believe in the power of collaboration, especially during the initial phase of your journey with us.\nWe are looking for someone with a blend of front-end and back-end skills, who is ready to take on challenges and contribute significantly to the development of our groundbreaking platform. If you are a forward-thinking developer eager to make a substantial impact in the fashion industry, we would love to hear from you.\nInitially you will contribute towards shipping our gallery feature.\nOur tech stack:\n - back-end will be build with Python, Socket.io (python-socketio) on Google Cloud Run.\n - front-end will be build in typescript + react + tailwind + flowbite\n - communication between FE and BE will happen over socket.io (websocket)\n - data will be stored in MongoDB and gcp cloud bucket\n - infra is rolled out with pulumi<b>Skills</b>:        TypeScript,                     Python,                     MongoDB,                     React            ","link":"https://www.upwork.com/jobs/Full-Stack-Developer-Typescript-React-Tailwind-Python_%7E011009f1b0d2550265?source=rss","processedDate":"2024-03-19T08:44:13.980Z","postedDate":"<b>Posted On</b>: January 01, 2024 19:37 UTC","id":"011009f1b0d2550265"},{"skillset":["Docker","NestJS","Next.js","Puppeteer"],"title":"Baseline an NX monorepo with Next.js Application and Nest.js API with Puppeteer - Upwork","description":"Request overview\nTutoring\nEstimated session length: Not sure yet\nRequest detail\nI want to learn how to dockerize applications in an Nx Monorepo.\nI have a Next.js Application and a Nest.js API running Puppeteer, I&#039;m able to Dockerize them individually. However, when I use Nx Monorepo, I get a errors when building the containers.\nTasks:\nFor simplicity, I would like to start this process from scratch so I know how to get it done going forward.\n1. Create a new Nx workspace\n2. Create a Next.js project in the workspace, possibly with the @nx/next plugin\n3. Create a Nest.js api in the workspace, possibly, using the @nx/nest plugin\n4. Install puppeteer\n5. Scrape any random page, and return a string (This is just as a proof of concept to show puppeteer is actually working)\n6. Prepare a Dockerfile for Next.js and another one for the Nest.js API\n7. Prepare a Docker Compose file\n8. Build the containers (Docker compose up build or sth).\n9. Test the Nextjs Application and the Nest.js Puppeteer API.\n10. Have a brief 30 min conversation afterward to review the steps, and transfer knowledge.<b>Skills</b>:        Docker,                     NestJS,                     Next.js            ","link":"https://www.upwork.com/jobs/Baseline-monorepo-with-Next-Application-and-Nest-API-with-Puppeteer_%7E01798755ac1567ca62?source=rss","processedDate":"2024-03-19T08:44:19.663Z","postedDate":"<b>Posted On</b>: March 17, 2024 10:17 UTC","id":"01798755ac1567ca62"},{"skillset":[],"title":"Puppeteer  &amp; aws lambda - Upwork","description":"Install Puppeteer in aws lambda\nand manage to open a webpage and copy it code\nwebpage has alot javascript execution\nnewcomes welcome, will leave u good review for this job.","link":"https://www.upwork.com/jobs/Puppeteer-amp-aws-lambda_%7E01ec66edd1799daca1?source=rss","processedDate":"2024-03-19T08:44:19.663Z","postedDate":"<b>Posted On</b>: March 15, 2024 21:30 UTC","id":"01ec66edd1799daca1"},{"skillset":["Node.js","MongoDB","Puppeteer"],"title":"Looking for a nodejs Puppeteer expert - Upwork","description":"Hi, I need to scrape data from a website using nodejs puppeteer and store it into mongo. If you understand english well and know how to scrape web pages and store data into a mongodb, please reach out.<b>Skills</b>:        Node.js,                     MongoDB            ","link":"https://www.upwork.com/jobs/Looking-for-nodejs-Puppeteer-expert_%7E01dd96923f72b45cbc?source=rss","processedDate":"2024-03-19T08:44:19.663Z","postedDate":"<b>Posted On</b>: March 12, 2024 20:28 UTC","id":"01dd96923f72b45cbc"},{"skillset":["Firebase","Smartphone","Mobile App Development","FlutterFlow","Supabase","Back-End Development","Puppeteer"],"title":"evelopment of a Text-to-Audio Mobile App with Puppeteer and Credit Management - Upwork","description":"Description:\nWe are seeking an expert Flutter and Firebase (or Supabase) developer to develop a comprehensive mobile application. This app will enable users to convert text to audio, utilizing Puppeteer on the server-side and incorporating a paid credit system.\nExpected Features:\nClient-Side (Flutter):\n- See specification screenshots attached for the expected result\n- A single page application of iOS and Android where you can write something and get it in audio.\n- Each text conversion to audio costs 1 credit.\n- Every new user has 10 free credits.\n- To buy credits, we use Stripe Checkout\n- Each audio generated is added to the list (last below) and can be heard through the player by taping on the audio. \nServer-Side (Firebase/Supabase):\n- Reception and processing of submitted texts.\n- Credit balance check for conversion eligibility.\n- Utilizing Puppeteer to:\n&nbsp;&nbsp;- Launch a headless browser.\n&nbsp;&nbsp;- Display the text in the console.\n&nbsp;&nbsp;- Send a hard-coded audio file (same for all texts).\n&nbsp;&nbsp;- Save and return the audio file URL to the client.\n&nbsp;&nbsp;- Deduct one credit per conversion.\n- Integration of Stripe Checkout for credit purchases.\nEssential Skills:\n- Proficiency in mobile application development with Flutter.\n- Experience with Firebase or Supabase.\n- Ability to develop standalone backends.\n- Handling HTTP requests and file upload/download processes.\n- Knowledge of Puppeteer for task automation.\n- Integration with Stripe Checkout payment API.\nDeliverables:\n- A fully functional Flutter app for iOS and Android.\n- Complete source code for both frontend and backend.\n- Implemented credit management system (purchasing and spending).\n- Installation and usage documentation.\nPlease feel free to reach out with any additional questions. The initial Puppeteer script will be simple, with plans for future enhancements.<b>Skills</b>:        Firebase,                     Smartphone,                     Mobile App Development,                     FlutterFlow,                     Supabase,                     Back-End Development            ","link":"https://www.upwork.com/jobs/evelopment-Text-Audio-Mobile-App-with-Puppeteer-and-Credit-Management_%7E019412c3e1a13662a3?source=rss","processedDate":"2024-03-19T08:44:19.663Z","postedDate":"<b>Posted On</b>: March 11, 2024 15:00 UTC","id":"019412c3e1a13662a3"},{"skillset":["TypeScript","React","Node.js","JavaScript","Web Scraping","Data Scraping","Bot Development","Testing","QA Testing","Full-Stack Development","Front-End Development","Web Development","Beautiful Soup","Dashboard","Google Chrome Extension"],"title":"Puppeteer Extra Stealth - Upwork","description":"Looking to have a script built with puppeteer extra <b>Skills</b>:        TypeScript,                     React,                     Node.js,                     JavaScript,                     Web Scraping,                     Data Scraping,                     Bot Development,                     Testing,                     QA Testing,                     Full-Stack Development,                     Front-End Development,                     Web Development,                     Beautiful Soup,                     Dashboard,                     Google Chrome Extension            ","link":"https://www.upwork.com/jobs/Puppeteer-Extra-Stealth_%7E01940ed693e1b5243d?source=rss","processedDate":"2024-03-19T08:44:19.663Z","postedDate":"<b>Posted On</b>: March 11, 2024 11:21 UTC","id":"01940ed693e1b5243d"},{"skillset":["Web Scraping","Node.js"],"title":"Bypass Incapsula/Imperva and Captcha, Using Node.js and Puppeteer - Upwork","description":"You will write a script to bypass bot protection and captcha. Instructions:\n1. Browse to https://iapps.courts.state.ny.us/nyscef/CaseSearch \n2. Successfully search for a case number. Here are some case numbers you can try: \n- 535265[forward-slash]2022 \n- 701542[forward-slash]2024 \n- 701531[forward-slash]2024 \n- 723406[forward-slash]2023\n3. Return the .HTML (as rendered by Javascript) of the search results.\nYou may use Python or Node.js. No other languages will be accepted.<b>Skills</b>:        Web Scraping,                     Node.js            ","link":"https://www.upwork.com/jobs/Bypass-Incapsula-Imperva-and-Captcha-Using-Node-and-Puppeteer_%7E01c61910203453a026?source=rss","processedDate":"2024-03-19T08:44:19.663Z","postedDate":"<b>Posted On</b>: March 10, 2024 21:30 UTC","id":"01c61910203453a026"},{"skillset":["HTML5","CSS 3","Bootstrap","JavaScript","React","Node.js","Puppeteer","Browser Automation","Web Scraping","Website Redesign","PSD to HTML","NodeJS Framework","Web Scraping Framework","Web API","Google Chrome Extension"],"title":"Puppeteer Expert - Upwork","description":"Hello!\nWe are woking on a browser automation project and looking for some help in puppeteer. We are facing issue while launching puppeteer at client side, node.js is on ec2. Let me know if you be able to help us on that.\nPiyush S.<b>Skills</b>:        HTML5,                     CSS 3,                     Bootstrap,                     JavaScript,                     React,                     Node.js,                     Browser Automation,                     Web Scraping,                     Website Redesign,                     PSD to HTML,                     NodeJS Framework,                     Web Scraping Framework,                     Web API,                     Google Chrome Extension            ","link":"https://www.upwork.com/jobs/Puppeteer-Expert_%7E0176d009cf572351e0?source=rss","processedDate":"2024-03-19T08:44:19.663Z","postedDate":"<b>Posted On</b>: March 09, 2024 08:19 UTC","id":"0176d009cf572351e0"},{"skillset":["Node.js","Selenium"],"title":"Python Selenium &amp; Nodejs puppeteer scrap from google search - Upwork","description":"Hi,\ni want to search the keyword &amp;quot;Ninja game&amp;quot; on google search and scrap the first 100 Google results (Titles &amp;amp; Links) then save it in CSV file\nusing these 3 ways :\n1- using python Google library\n2- using Selenium\n3- using Nodejs puppeteer<b>Skills</b>:        Node.js,                     Selenium            ","link":"https://www.upwork.com/jobs/Python-Selenium-amp-Nodejs-puppeteer-scrap-from-google-search_%7E01e59bc080bf9eef85?source=rss","processedDate":"2024-03-19T08:44:19.663Z","postedDate":"<b>Posted On</b>: March 04, 2024 17:34 UTC","id":"01e59bc080bf9eef85"},{"skillset":["Information Security","Network Security","Firewall","DNS","Microsoft Azure","SaaS","System Administration","TCP/IP","Internet Protocol Security","Network Administration","Web Proxy","Container","SSL Certificate","Puppet","Technical Support"],"title":"Location track - Upwork","description":"I just want you to track a location for me. I&#039;ll be providing you with a contact number <b>Skills</b>:        Information Security,                     Network Security,                     Firewall,                     DNS,                     Microsoft Azure,                     SaaS,                     System Administration,                     TCP/IP,                     Internet Protocol Security,                     Network Administration,                     Web Proxy,                     Container,                     SSL Certificate,                     Puppet,                     Technical Support            ","link":"https://www.upwork.com/jobs/Location-track_%7E01cd351e8730d316f6?source=rss","processedDate":"2024-03-19T08:44:19.663Z","postedDate":"<b>Posted On</b>: March 04, 2024 07:03 UTC","id":"01cd351e8730d316f6"},{"skillset":["Node.js","AWS Lambda","Docker","Linux"],"title":"Deploy nodejs/puppeteer-real-browser app on AWS Lambda using docker image - Upwork","description":"Consider a simple nodejs app using &amp;quot;puppeteer-real-browser&amp;quot; library (https://www.npmjs.com/package/puppeteer-real-browser) sending a request to the any website and receiving a response. This&nbsp;&nbsp;is simple and straightforward up to now. \nThe expected solution is to run this on AWS Lambda using the docker image. The Lambda infrastructure requires chromium and xvfb to run successfully. The real trick is to solve these challenges.\nFirstly you must create an appropriate docker file and then deploy to AWS ECR and finally create Lambda function using this docker image.\nThanks<b>Skills</b>:        Node.js,                     AWS Lambda,                     Docker,                     Linux            ","link":"https://www.upwork.com/jobs/Deploy-nodejs-puppeteer-real-browser-app-AWS-Lambda-using-docker-image_%7E01121c421ec41f243f?source=rss","processedDate":"2024-03-19T08:44:19.663Z","postedDate":"<b>Posted On</b>: March 01, 2024 20:01 UTC","id":"01121c421ec41f243f"},{"skillset":["React","JavaScript","Node.js","API","HTML","CSS","PHP","Web Development","HTML5","Puppeteer"],"title":"Experienced Puppeteer Developer with Node.js and React Expertise for Long-Term Project (20hrs/week) - Upwork","description":"Job Description:\nWe are a dynamic and innovative team looking to enhance our web automation capabilities. As part of our ongoing projects, we are in need of a skilled Puppeteer developer with strong experience in Node.js and React. The ideal candidate will join our team to work on a variety of challenging and exciting projects, contributing to the development and implementation of web scraping and automation solutions.\nResponsibilities:\nDevelop and maintain web automation scripts using Puppeteer.\nIntegrate Puppeteer scripts with Node.js backend services.\nCreate user interfaces using React that interact with the backend services for control and monitoring of automation tasks.\nCollaborate with the development team to design and implement new features.\nTroubleshoot and optimize performance issues in web automation scripts.\nDocument code and create detailed reports on the automation processes.\nRequirements:\nProven experience with Puppeteer for web scraping and automation.\nStrong proficiency in Node.js and React, with at least 2 years of experience in each.\nExcellent problem-solving skills and the ability to work independently or as part of a team.\nExperience with version control systems, preferably Git.\nKnowledge of web technologies (HTML, CSS, JavaScript) and understanding of web standards and protocols.\nGood communication skills, with the ability to document and explain technical details clearly.\nDetails:\nCommitment: 20 hours per week.\nDuration: Long-term project (6 months with the possibility of extension).\nWork remotely.\nCompetitive hourly rate, commensurate with experience.\nApplication Process:\nTo apply, please submit the following:\nA brief cover letter explaining your interest in the role and relevant experience.\nResume/CV.\nLinks to GitHub repositories or portfolios showcasing your work with Puppeteer, Node.js, and React.\nWe look forward to reviewing your application and potentially welcoming you to our team!<b>Skills</b>:        React,                     JavaScript,                     Node.js,                     API,                     HTML,                     CSS,                     PHP,                     Web Development,                     HTML5            ","link":"https://www.upwork.com/jobs/Experienced-Puppeteer-Developer-with-Node-and-React-Expertise-for-Long-Term-Project-20hrs-week_%7E01efd375b5388b052d?source=rss","processedDate":"2024-03-19T08:44:19.663Z","postedDate":"<b>Posted On</b>: February 28, 2024 19:08 UTC","id":"01efd375b5388b052d"},{"skillset":["Amazon EC2","Google Chrome Extension","Node.js","Amazon Web Services","JavaScript","Puppeteer","Automation"],"title":"Need help in deploying puppeteer app on ec2 - Upwork","description":"The problem is that while Puppeteer works fine on a local machine, opening the browser as expected, it does not work the same after being deployed to an Amazon EC2 instance. In the cloud environment, the browser does not open, and an error message &amp;quot;Failed to launch the browser process!&amp;quot; appears. This suggests that there might be issues with the setup or environment on the EC2 instance that need to be checked and fixed to make Puppeteer run correctly, just like it does locally.<b>Skills</b>:        Amazon EC2,                     Google Chrome Extension,                     Node.js,                     Amazon Web Services,                     JavaScript,                     Automation            ","link":"https://www.upwork.com/jobs/Need-help-deploying-puppeteer-app-ec2_%7E011e97e06a889aedaa?source=rss","processedDate":"2024-03-19T08:44:19.663Z","postedDate":"<b>Posted On</b>: February 28, 2024 13:15 UTC","id":"011e97e06a889aedaa"},{"skillset":["JavaScript","Node.js","Puppeteer","Automation"],"title":"Undetectable Puppeteer Script Developer - Upwork","description":"We are looking for a talented developer to create an undetectable puppeteer script for our project. The script should be able to automate various tasks and interact with websites without being detected. Attention to detail and the ability to create undetectable scripts are essential. The navigation aspect&nbsp;&nbsp;of the script is already written.\nSkills required:\n- Puppeteer\n- JavaScript\n- Automation<b>Skills</b>:        JavaScript,                     Node.js,                     Automation            ","link":"https://www.upwork.com/jobs/Undetectable-Puppeteer-Script-Developer_%7E011206839e444bdc01?source=rss","processedDate":"2024-03-19T08:44:19.663Z","postedDate":"<b>Posted On</b>: February 27, 2024 20:59 UTC","id":"011206839e444bdc01"},{"skillset":["Raspberry Pi Firmware","Firmware Programming"],"title":"USB Keyboard Firmware Optimization - Upwork","description":"Modify existing software intended for the BB Q20 keyboard, using I2C puppet, specifically key presses, trackpad state, and more, to apply to Android operating system. Here are some examples:\n[KEYBOARD BUTTON = ANDROID FUNCTION]\nBACK = BACK\nMENU = HOME (SINGLE PRESS)\nHANG UP = CRTL\nCALL = RECENT APPS\n-HOLD &#039;CRTL&#039;&nbsp;&nbsp;+ [BELOW BUTTON, SHORT-PRESS OR LONG-PRESS THIS BUTTON, ACTIVATE APPS/SHORTCUTS/ETC. I.E&nbsp;&nbsp;A QUICKLAUNCH]\n-SHORT PRESS ITEMS-\nCUT= X\nCOPY = C\nPASTE = V\nSELECT ALL = A\nONE WORD DELETE = D\nUNDO = Z\nREDO = Y\nCAPS = T\nNUM LOCK = N\nHOME [CURSOR PLACEMENT] = H\nPGDN = U\nPGUP = 0\nEND = E\nNEXT WORD = W\nPREVIOUS WORD = P\nSAVE = S\nSHARE = R\nMOVE CURSOR FORWARD ONE SPACE = F\nMOVE CURSOR BACKWARD ONE SPACE = G\nOTHER QL SHORTCUTS\n-SINGLE PRESS CTRL, THEN OTHER BUTTON = ACTIVATE APPS OR OTHER SHORTCUTS-\n--ideally we can make an interface on android to assign each of these values--<b>Skills</b>:        Raspberry Pi Firmware,                     Firmware Programming            ","link":"https://www.upwork.com/jobs/USB-Keyboard-Firmware-Optimization_%7E0145b009dd6328a056?source=rss","processedDate":"2024-03-19T08:44:19.663Z","postedDate":"<b>Posted On</b>: February 23, 2024 23:30 UTC","id":"0145b009dd6328a056"},{"skillset":["CentOS","Linux","DevOps","Puppet Administration","Apache Administration"],"title":"Looking for a DevOps Engineer with experience in Puppet - Upwork","description":"We are seeking a Puppet Administration Specialist who can provide guidance and expertise on optimizing our existing Puppet module for setting up Apache on Puppet agents. We have already developed a basic module but require assistance in refining and improving its functionality.\n**Requirements:**\n- Proven experience in Puppet administration and module development.\n- Strong understanding of Apache configuration and administration.\n- Excellent communication skills and ability to explain technical concepts clearly.\n- Capacity to provide guidance and support without completing the task entirely.\n- Availability for consultation sessions as needed.\n**How to Apply:**\nIf you possess the expertise and experience required for this role and are interested in providing guidance and support, please submit your proposal detailing your relevant experience and approach to assisting us with our Puppet Apache module. Additionally, include any relevant work samples or references that demonstrate your proficiency in Puppet administration.\nWe look forward to collaborating with you to enhance our Puppet infrastructure!<b>Skills</b>:        CentOS,                     Linux,                     DevOps,                     Puppet Administration,                     Apache Administration            ","link":"https://www.upwork.com/jobs/Looking-for-DevOps-Engineer-with-experience-Puppet_%7E018538c8285911dae6?source=rss","processedDate":"2024-03-19T08:44:19.663Z","postedDate":"<b>Posted On</b>: February 23, 2024 10:26 UTC","id":"018538c8285911dae6"},{"skillset":["Jenkins","Linux","DevOps","Python Script","Ansible","Docker","Terraform","Linux System Administration","Grafana","AWS CloudFormation","Puppet","Bash","Kubernetes","Python","CI/CD Platform"],"title":"Jenkins pipeline - Upwork","description":"Hi Pranav, \nI need an urgent help with setting up and optimizing the Jenkins pipeline.<b>Skills</b>:        Jenkins,                     Linux,                     DevOps,                     Python Script,                     Ansible,                     Docker,                     Terraform,                     Linux System Administration,                     Grafana,                     AWS CloudFormation,                     Puppet,                     Bash,                     Kubernetes,                     Python,                     CI/CD Platform            ","link":"https://www.upwork.com/jobs/Jenkins-pipeline_%7E018ae9cf64313b9469?source=rss","processedDate":"2024-03-19T08:44:19.663Z","postedDate":"<b>Posted On</b>: February 20, 2024 15:44 UTC","id":"018ae9cf64313b9469"},{"skillset":["SCSS","HTML5","C#","JavaScript","Node.js","Storybook","TypeScript","Redux","CSS","Bootstrap","Project Management Professional","Gatsby.js","React","HTML","Web Scraping"],"title":"Improving Puppeteer code bit to scrape more information - Upwork","description":"Hello.\nI have a Puppeteer code that runs on Apify to scrape Google Maps places lists. It fetches every added place title with some basic information about the list itself like the title and the subtitle. With each place there might be a note added, not necessarily in each though. So for each place, besides the title, I want the note to be scraped if it exists and otherwise a &amp;quot;null&amp;quot; value in the array so that the order and indexes are consistent with the places names. \nThanks a lot in advance for your consideration. The existing puppeteer code is attached.\nBest!<b>Skills</b>:        SCSS,                     HTML5,                     C#,                     JavaScript,                     Node.js,                     Storybook,                     TypeScript,                     Redux,                     CSS,                     Bootstrap,                     Project Management Professional,                     Gatsby.js,                     React,                     HTML,                     Web Scraping            ","link":"https://www.upwork.com/jobs/Improving-Puppeteer-code-bit-scrape-more-information_%7E011f0aec28d3d9ce67?source=rss","processedDate":"2024-03-19T08:44:19.663Z","postedDate":"<b>Posted On</b>: February 20, 2024 10:25 UTC","id":"011f0aec28d3d9ce67"},{"skillset":["UiPath","Robotic Process Automation","Automation","C#","Test Automation Framework"],"title":"Debug UiPath process flow . - Upwork","description":"I&#039;m looking for someone who can complete this incomplete project in UiPath.\nWe are seeking an experienced automation expert proficient in UiPath. If you have a proven track record of successfully implementing automation solutions, we want to hear from you.\nResponsibilities:\nDesign and implement automation workflows using Puppet and UiPath.\nCollaborate with cross-functional teams to identify automation opportunities and requirements.\nTroubleshoot and optimize existing automation processes.\nProvide technical support and training to team members on UiPath functionalities<b>Skills</b>:        UiPath,                     Robotic Process Automation,                     Automation,                     C#,                     Test Automation Framework            ","link":"https://www.upwork.com/jobs/Debug-UiPath-process-flow_%7E01036296acfd50914c?source=rss","processedDate":"2024-03-19T08:44:19.663Z","postedDate":"<b>Posted On</b>: February 18, 2024 08:22 UTC","id":"01036296acfd50914c"},{"skillset":["Task Automation","Beautiful Soup","Node.js","Automation","Selenium","Python","Puppeteer","PHP","Scripting","Link Building"],"title":"puppeteer, Selenium automated site registration link building in bulk - Upwork","description":"Looking for someone who is experienced in Browser automation tools like Puppeteer node.js, Selenium. The task is too build a tool to register and build links on 3rd party websites in bulk.\nI need someone who has built a tool like this already and have found solutions to issues like scaling link building bots, dynamic IPs, captcha, anti bot blockers, dynamic email, etc.\nI have a few domains I require links on, each one will require a different recorded registration, profile, forum text link insertion process. \nMay require one tool to record process for each site (so the recording task can be given to a worker) and another tool to run at scale link building robots.\nIf you have built something like this get in touch, if you can show examples even better.<b>Skills</b>:        Task Automation,                     Beautiful Soup,                     Node.js,                     Automation,                     Selenium,                     Python,                     PHP,                     Scripting,                     Link Building            ","link":"https://www.upwork.com/jobs/puppeteer-Selenium-automated-site-registration-link-building-bulk_%7E01db8a51dafb1cbad2?source=rss","processedDate":"2024-03-19T08:44:19.664Z","postedDate":"<b>Posted On</b>: February 14, 2024 15:24 UTC","id":"01db8a51dafb1cbad2"},{"skillset":["TypeScript","Puppeteer"],"title":"Puppeteer QR codes scanner - Upwork","description":"I need a typescript module that finds specific QR code on the puppeeteer page, reads the code and returns its content. The module should provide a public function that accept puppeteer page (negotiated) and returns the result. QR code generated by walletconnect.com and, I can send an example. To prove you&#039;re not a bot, the first word of you message should be a name of the site that generates qr codes, mentioned above. Thanks<b>Skills</b>:        TypeScript            ","link":"https://www.upwork.com/jobs/Puppeteer-codes-scanner_%7E01d982f152c608846c?source=rss","processedDate":"2024-03-19T08:44:19.664Z","postedDate":"<b>Posted On</b>: February 13, 2024 11:01 UTC","id":"01d982f152c608846c"},{"skillset":["Data Entry","Shopify","Social Media Content","Instagram","Virtual Assistance","Shopify Apps","Social Media Marketing","Content Writing","Calendar Management","Canva","Xero"],"title":"VA Online Business Manager - Shopify | Digital  &amp; Email Marketing | Admin Support - Upwork","description":"\nWe&#039;re&nbsp;&nbsp;a&nbsp;&nbsp;new and preloved fashion boutique and bricks and mortar location.&nbsp;&nbsp;We have a Shopify website&nbsp;&nbsp;and&nbsp;&nbsp;moving to a new theme&nbsp;&nbsp;so will need assistance to update content and&nbsp;&nbsp;require ongoing virtual assistant experienced and knowledgeable in:\nAdministrative, Digital Marketing and Business Development Support Activities include:\n1. SHOPIFY&nbsp;&nbsp;WEBSITE &amp;amp; PRODUCT,&nbsp;&nbsp;website updates, product upload, product description and work with other integrations such as Ebay, Facebook and Instagram, Klaviyo - email &amp;amp; SMS marketing, Book That App - Appointment Booking App, Puppet Vendors, Sales &amp;amp; Discount Manager, Yotpo Reward Program, Powerful Contact Form Builder.and Canva. \n2. SHOPIFY ADMIN&nbsp;&nbsp;&ndash; website updates ie text, collections/navigation, discounts, tags, products &ndash; (not programming, but helpful), archiving products, adding products/pics\nIe Manage rack bookings, start and end dates and emails to consignors to drop off/collect their items.\n3. PROJECT MANAGEMENT of Processes and System Documentation ie Shopify and consignment processes, training manual etc\n4. DIGITAL AND EMAIL MARKETING &ndash; Klaviyo &ndash; Newsletters, email templates updates for various campaigns-Customer segmentation/new bus, retention, loyalty programs \n5. SOCIAL MEDIA &ndash;uploading stories/posts, content/canva templates\nCopywriting and Social Media Management\n6. MARKETING COLLATERAL : Marking campaign development and management, Instore Signage/flyers as required, ie canva\n7. BOOKEEPING&nbsp;&nbsp;- experience with Xero\n8 NEW BUSINESS DEVELOPMENT : ie, PR opportunities, collab: identifying content creators/Influencers to collab to book racks and sell their items and or to grow instore customer visits\n9. GENERAL ADMIN&nbsp;&nbsp;- Other general admin duties as required\nRequire around 10 hours per week, possibly more. \nWork with AEST time zone.\nMust have excellent and accurate communication and writing skills\nPositive and can-do attitude \nFlexible and adaptable with hours to support AEST timeframes.\nAttention to detail and high accuracy\nPlease apply if you have a proven track record and provide referrals and examples of your work. If you can assist, please apply. Look forward to hearing from you!!<b>Skills</b>:        Data Entry,                     Shopify,                     Social Media Content,                     Instagram,                     Virtual Assistance,                     Shopify Apps,                     Social Media Marketing,                     Content Writing,                     Calendar Management,                     Canva,                     Xero            ","link":"https://www.upwork.com/jobs/Online-Business-Manager-Shopify-Digital-amp-Email-Marketing-Admin-Support_%7E014579eaa7fcd826a8?source=rss","processedDate":"2024-03-19T08:44:19.664Z","postedDate":"<b>Posted On</b>: January 28, 2024 03:34 UTC","id":"014579eaa7fcd826a8"},{"skillset":["Terraform","Google Cloud Platform","CI/CD","DevOps"],"title":"Terraform with GCP Google Cloud platform , DevOps, Expert Quick Hire - Upwork","description":"Terraform with GCP Google Cloud platform , DevOps, Expert Quick Hire\nGOAL: Implement Terraform Code that create the Google Cloud Platform (GCP) simple application with VPN, Subnets, Google App Engine, Google Load Balancer, Google Secret Manager.\nPart 2: Setup a simple Cloud Build Pipeline to deploy the Python Flask Application on the Google App Engine using the Google Cloud builds pipelines\n------ TOP SKILLS ------\nTerraform\nGoogle Cloud Provider GCP\nDevOps CI/CD pipelines \nWrite and deliver a working Terraform Code that will deploy following GCP services\n1.\tCreate a Google Virtual Private Network\n2.\tOne Public Subnet (Hosting Google Load Balancer)\n3.\tOne Private Subnet (Hosting Google App Engine)\n4.\tOne Google App Engine that&nbsp;&nbsp;will Host Python Flask Application and HTTPs Endpoint and in hosted in a Public Subnet\n5.\tGoogle Load Balancer (Hosted in a Private Subnet)\n6.\tGoogle Secret Manager for storing the API Tokens \n7.\tCreate two Folder One Folder will have Assured Workload Management (Refer to this link https://github.com/GCP-Architecture-Guides/csa-il4-assured-workload ) \n8.\tSecond Folder will have all other components (GCP Virtual Network, Public Subnet, private subnet, Google App Engine, Google Load Balancer, Google Secret Manager, Google Secret Manager \n9.\tImplement the Assured Google WorkLoad.\n10.\tSetup of a Cloud Build with deployment files \n11.\tYou will be given access to the Google Cloud Account directly.\n&emsp;\nSee the Architecture Document and Diagram attached\n----- ADVANTAGE TO YOU----\n- Future work for you, long-term engagement, 90% of the freelancer work with me directly and are re-hires.&nbsp;&nbsp;I have 5-star employer rating.\n-&nbsp;&nbsp;&nbsp;Excellent 5-star reviews for a good job\n-&nbsp;&nbsp;100% clear requirements, with communication and direct support on s-ky -p-p-e-&nbsp;&nbsp;z &ndash; 0 &ndash; 0 &ndash; m /video conference\n- Flexible with per hour or fixed price. Read the BUDGET, please.\n- Document attached &ndash; GCP TF Code.docx (PLEASE READ THE DOCUMENT)\n------ESTIMATION&nbsp;&nbsp;------\n- The task will take approximately few hours for a Terraform, GCP expert to perform the tasks and complete the deployment with the document. The task already has sample application deployment. Flexible for both fixed-price and per hour.\nLook forward to your bid. Bid now and get awarded.\n======== PLEASE BID NOW , MOVE QUICK AND GET AWARDED ===========<b>Skills</b>:        Terraform,                     Google Cloud Platform,                     CI/CD,                     DevOps            ","link":"https://www.upwork.com/jobs/Terraform-with-GCP-Google-Cloud-platform-DevOps-Expert-Quick-Hire_%7E0144448c8f3671fb96?source=rss","processedDate":"2024-03-19T08:44:31.717Z","postedDate":"<b>Posted On</b>: March 19, 2024 03:21 UTC","id":"0144448c8f3671fb96"},{"skillset":["Azure DevOps","Cloud Architecture","Cloud Engineering","Cloud Engineering Consultation","Cloud Implementation","Microsoft Azure","Microsoft Active Directory","Azure App Service","Microsoft Windows PowerShell","Terraform"],"title":"Azure Administrator - Upwork","description":"We are seeking a highly skilled and experienced Azure Administrator to join our IT team. This role is pivotal in managing and overseeing our organization&#039;s Azure cloud environment. The ideal candidate will have a strong background in Azure services, including PaaS, SaaS, and IaaS, and possess a deep understanding of Azure Resource Manager, RBAC, and identity and access controls. As an Azure Administrator, you will be responsible for creating, configuring, and maintaining Azure resources, ensuring high availability, and optimizing performance across our cloud infrastructure.\nKey Responsibilities:\n&nbsp;&nbsp;- Azure Resource Management: Create, configure, and manage Azure resources using the Azure portal, ensuring optimal performance and compliance with organizational standards.\n&nbsp;&nbsp;- Service Expertise: Demonstrate expertise in Azure PaaS, SaaS, and IaaS services, utilizing them effectively to meet business needs and enhance infrastructure capabilities.\n&nbsp;&nbsp;- Security and Access Management: Implement and manage Azure RBAC, identity, and access controls to ensure secure access to cloud resources, safeguarding sensitive data and systems.\n&nbsp;&nbsp;- Infrastructure as Code: Develop and maintain Terraform code for efficient and scalable deployment of Azure resources, fostering an infrastructure-as-code culture within the organization.\n&nbsp;&nbsp;- Troubleshooting and Support: Proactively monitor the Azure environment to identify and troubleshoot issues, ensuring high availability and minimal downtime.\n&nbsp;&nbsp;- Continuous Learning and Improvement: Stay abreast of the latest Azure features and updates, continuously seeking ways to improve the environment and processes.\nQualifications:\n&nbsp;&nbsp;- Experience: At least 2 years of direct experience managing and supporting Azure environments.\n - Technical Skills: Proficiency in Azure services (PaaS, SaaS, IaaS), Azure Resource Manager, RBAC, identity and access management, and Terraform.\n-&nbsp;&nbsp;&nbsp;Problem-Solving: Strong analytical and troubleshooting skills, with the ability to resolve complex technical issues efficiently.\n -&nbsp;&nbsp;Communication: Excellent communication and collaboration skills, capable of working effectively in a team environment and interacting with all levels of the organization.\n&nbsp;&nbsp;- Certifications: Azure Administrator Associate certification or other relevant Azure certifications preferred.<b>Skills</b>:        Azure DevOps,                     Cloud Architecture,                     Cloud Engineering,                     Cloud Engineering Consultation,                     Cloud Implementation,                     Microsoft Azure,                     Microsoft Active Directory,                     Azure App Service,                     Microsoft Windows PowerShell,                     Terraform            ","link":"https://www.upwork.com/jobs/Azure-Administrator_%7E0172ef706cfe6e11ff?source=rss","processedDate":"2024-03-19T08:44:31.717Z","postedDate":"<b>Posted On</b>: March 18, 2024 22:26 UTC","id":"0172ef706cfe6e11ff"},{"skillset":["Amazon Web Services","Amazon RDS","Amazon EC2","Amazon S3","MySQL","DevOps","JavaScript"],"title":"AWS Expert with solid experience in RDS - Upwork","description":"Our RDS is currently publicly exposed to the internet. We need to fix this by bringing it within a private subnet, along with all of our other services.\nWe can accomplish this in several ways.\nOption 1: Manual recreation of our entire infrastructure with correct private/public subnet configurations\nOption 2: Recreation of our infrastructure using Terraform, so that we have our infrastructure in the form of code, meaning it will be easier to modify and track\nPrevious development using Terraform has already begun, but it is very outdated<b>Skills</b>:        Amazon Web Services,                     Amazon RDS,                     Amazon EC2,                     Amazon S3,                     MySQL,                     DevOps,                     JavaScript            ","link":"https://www.upwork.com/jobs/AWS-Expert-with-solid-experience-RDS_%7E0121137a9902701b0e?source=rss","processedDate":"2024-03-19T08:44:31.717Z","postedDate":"<b>Posted On</b>: March 18, 2024 21:27 UTC","id":"0121137a9902701b0e"},{"skillset":["Python","Terraform","PagerDuty"],"title":"Automation with Python, terraform and pagerduty  - Upwork","description":"Configuration of pagerduty and need on demand python coder to structure for automating the configuration of x instance for Y Hotel using Python and Terraform. Then need to customize it further based on specific requirements and the capabilities provided by the Z API and Terraform provider. Also need to ensure to have proper error handling, logging, and authentication mechanisms in place for production use.<b>Skills</b>:        Python,                     Terraform,                     PagerDuty            ","link":"https://www.upwork.com/jobs/Automation-with-Python-terraform-and-pagerduty_%7E019251934676a9a342?source=rss","processedDate":"2024-03-19T08:44:31.718Z","postedDate":"<b>Posted On</b>: March 17, 2024 19:15 UTC","id":"019251934676a9a342"},{"skillset":["Terraform","Amazon Web Services","DevOps","Deployment Automation","System Administration","CI/CD"],"title":"Terraform upgrade task - Upwork","description":"help with terrafotm upgrade task from 0.12 to 0.13. this upgrade should be done with a script on terraform and run the upgrade on jenkins. changing the from&nbsp;&nbsp;one version to another.<b>Skills</b>:        Terraform,                     Amazon Web Services,                     DevOps,                     Deployment Automation,                     System Administration,                     CI/CD            ","link":"https://www.upwork.com/jobs/Terraform-upgrade-task_%7E01fb102cd55750868a?source=rss","processedDate":"2024-03-19T08:44:31.718Z","postedDate":"<b>Posted On</b>: March 17, 2024 12:26 UTC","id":"01fb102cd55750868a"},{"skillset":["DevOps","Docker","Amazon Web Services","CI/CD","Deployment Automation"],"title":"Expert Devops Engineer - Upwork","description":"We are seeking an expert DevOps Engineer with in-depth knowledge and experience in Kubernetes, EKS, Docker, and AWS. The ideal candidate should possess strong problem-solving skills and have the ability to design, implement, and maintain continuous integration and continuous deployment (CI/CD) pipelines. The main responsibilities of the role will include setting up and managing Kubernetes clusters on EKS, containerizing applications using Docker, and leveraging AWS services to optimize scalability and performance. The successful candidate will also be responsible for monitoring and optimizing the infrastructure to ensure high availability and reliability.<b>Skills</b>:        DevOps,                     Docker,                     Amazon Web Services,                     CI/CD,                     Deployment Automation            ","link":"https://www.upwork.com/jobs/Expert-Devops-Engineer_%7E016c77bb8963212480?source=rss","processedDate":"2024-03-19T08:44:31.718Z","postedDate":"<b>Posted On</b>: March 17, 2024 06:23 UTC","id":"016c77bb8963212480"},{"skillset":["Amazon Web Services","Deployment Automation","Terraform","DevOps"],"title":"Terraform AWS working sessions - Upwork","description":"Hello All,\nI need an expert in Terraform best practices to build out AWS landing_zone/control_tower. \nProject style - working session over zoom\nAcceptance criteria - it&#039;s dynamic and can be agreed upon the initial call\nIssue - Issue with nested modules and lack of knowledge of best practices in Terraform. \nGoal - start preparing/migrating/creating a private repo of AWS TF modules.\nIf you have experience in creating tf no-code modules that will be BIG<b>Skills</b>:        Amazon Web Services,                     Deployment Automation,                     Terraform,                     DevOps            ","link":"https://www.upwork.com/jobs/Terraform-AWS-working-sessions_%7E01a57ffcf746a27cac?source=rss","processedDate":"2024-03-19T08:44:31.718Z","postedDate":"<b>Posted On</b>: March 17, 2024 04:05 UTC","id":"01a57ffcf746a27cac"},{"skillset":["Deployment Automation","DevOps Engineering","Infrastructure Management","System Automation","Amazon Web Services","CI/CD","DevOps","CI/CD Platform","LaMDA"],"title":"DevOps engineer for AWS  - Upwork","description":"Technology startup looking for devops engineering contractor to update and change our AWS infrastructure as needed.&nbsp;&nbsp;\nTechnologies we use:\nTerraform\nAws Lambda\nDocker\nECS\nS3<b>Skills</b>:        Deployment Automation,                     DevOps Engineering,                     Infrastructure Management,                     System Automation,                     Amazon Web Services,                     CI/CD,                     DevOps,                     CI/CD Platform,                     LaMDA            ","link":"https://www.upwork.com/jobs/DevOps-engineer-for-AWS_%7E01af9d41ec67c31ba8?source=rss","processedDate":"2024-03-19T08:44:31.718Z","postedDate":"<b>Posted On</b>: March 16, 2024 12:20 UTC","id":"01af9d41ec67c31ba8"},{"skillset":["Terraform"],"title":"Terraform expert needed - Upwork","description":"Just need someone really knowleagable in terrafom that can help me. Also teach me if needed. It would be great to have some AWS and AZURE. Let me know<b>Skills</b>:        Terraform            ","link":"https://www.upwork.com/jobs/Terraform-expert-needed_%7E01732dbeb179229d38?source=rss","processedDate":"2024-03-19T08:44:31.718Z","postedDate":"<b>Posted On</b>: March 16, 2024 04:10 UTC","id":"01732dbeb179229d38"},{"skillset":["Golang","RESTful API","Software Architecture &amp; Design"],"title":"Mid/Senior Backend Engineer (GO) - Upwork","description":"We seek a part-time Mid/Senior Backend Engineer to join our fully remote team at Drope.me.\nThe Role:\nWe seek someone who can work well in a fast-paced startup environment and bring your experience, ideas, and energy to our team. You should have a solid background in the fundamentals of software development as well as the ambition of working in a fast-growing startup.\nResponsibilities:\n- Work in the fast-paced environment of Drope.me&#039;s API platform, as a vital member of our engineering team\n- Your primary responsibility will be maintaining an API, developing new features, gathering requirements, collaborating with the product team\n- We use Go as the primary language on the backend. The API is deployed to the Google Cloud. For database, we use Firestore, so experience with any NoSQL database is preferable\nRequirements:\n- 4+ years of total software engineering experience, at least 1+ year of professional experience with Go\n- Experience with queues (Pub/sub, SQS, RabbitMQ)\n- Experience with Terraform\n- Strong problem-solving skills, ability to find solutions independently\n- Proficient understanding of Docker and containers\n- At least 1+ year of experience with any cloud provider (AWS, Google Cloud, etc.)\n- Upper-intermediate English is a must\nBonus points\n- Interest in gaming, creator&rsquo;s economy spaces<b>Skills</b>:        Golang,                     RESTful API,                     Software Architecture &amp; Design            ","link":"https://www.upwork.com/jobs/Mid-Senior-Backend-Engineer_%7E014303f5539e56fd7f?source=rss","processedDate":"2024-03-19T08:44:31.718Z","postedDate":"<b>Posted On</b>: March 16, 2024 00:17 UTC","id":"014303f5539e56fd7f"},{"skillset":["Python","Amazon Web Services","GitHub","Amazon EC2"],"title":"DevOps Tasks - AWS, Python - Upwork","description":"1. Python code for a lambda that will turn off any EC2 instances that match a particular string (for example any instances with the word &ldquo;upwork&rdquo; in them).\n2. Terraform code to launch that lambda with any appropriate security group and IAM settings, in AWS.\n3. A github actions pipeline to apply that code and perform any other steps the you think might be relevant.<b>Skills</b>:        Python,                     Amazon Web Services,                     GitHub,                     Amazon EC2            ","link":"https://www.upwork.com/jobs/DevOps-Tasks-AWS-Python_%7E01ef8566e3273aee1f?source=rss","processedDate":"2024-03-19T08:44:31.718Z","postedDate":"<b>Posted On</b>: March 15, 2024 19:30 UTC","id":"01ef8566e3273aee1f"},{"skillset":["Amazon Web Services","Amazon EC2","DevOps","Amazon S3","Amazon ECS"],"title":"Deployed application to aws eks as ec2's - Upwork","description":"we have deployed applications to AWS EKS as ec2&#039;s, applications are up and running.\nNeed to create Prometheus and Grafana terraform modules to pull and dispaly metrics (usage metrics) from various sources within existing&nbsp;&nbsp;AWS EKS clusters,nodes, and pods<b>Skills</b>:        Amazon Web Services,                     Amazon EC2,                     DevOps,                     Amazon S3,                     Amazon ECS            ","link":"https://www.upwork.com/jobs/Deployed-application-aws-eks-ec2_%7E01f8c58aa1e1ca7b67?source=rss","processedDate":"2024-03-19T08:44:31.718Z","postedDate":"<b>Posted On</b>: March 15, 2024 18:21 UTC","id":"01f8c58aa1e1ca7b67"},{"skillset":["DevOps","CI/CD","Docker","AWS CloudFormation","Python"],"title":"AWS CDK/Python/Typescript DevOps is Needed immediately. - Upwork","description":"looking for an experienced AWS CDK DevOps engineer to quickly join our team for a critical task. \n Tasks will include:\nAdding a new environment to our existing two in our CI/CD pipeline.\nConfiguring domain-based API routing for our backend branches across environments (production, staging, etc.).\nAssessing and implementing cost optimization strategies for our AWS resources.\nRequirements:\nExperienced with dealing reserve proxies such as NGINX \nProficient with AWS CDK, Python, and TypeScript.\nExperienced in CI/CD pipelines and domain management for APIs.\nSkilled in AWS cost optimization.<b>Skills</b>:        DevOps,                     CI/CD,                     Docker,                     AWS CloudFormation,                     Python            ","link":"https://www.upwork.com/jobs/AWS-CDK-Python-Typescript-DevOps-Needed-immediately_%7E010f276703230dce0c?source=rss","processedDate":"2024-03-19T08:44:31.718Z","postedDate":"<b>Posted On</b>: March 15, 2024 13:02 UTC","id":"010f276703230dce0c"},{"skillset":["Microsoft Windows","Linux","Amazon Web Services","Docker","AWS Lambda","Python"],"title":"Walk Through Python Docker Image to AWS Lambda / ECS - Upwork","description":"Hi all,\nI look for someone, who can walk me through the following case:\n- I have Windows 11 as development system\n- I have Python code, that depends on several libraries (sourcedefender, cryptography)\n- I want to migrate to Python 3.12\nOption 1:\n- I want to put the libraries to a lambda layer (via docker)\n- docker shall be operated in my Windows env.\nOption 2:\n- Libraries shall be enbaked to the docker image holding the Python code\n- Image shall be operated in Lambda\n- I plan to migrate from Lambda to ECR - should also be showcased<b>Skills</b>:        Microsoft Windows,                     Linux,                     Amazon Web Services,                     Docker,                     AWS Lambda,                     Python            ","link":"https://www.upwork.com/jobs/Walk-Through-Python-Docker-Image-AWS-Lambda-ECS_%7E01a382e4b55991d6db?source=rss","processedDate":"2024-03-19T08:44:31.718Z","postedDate":"<b>Posted On</b>: March 15, 2024 11:58 UTC","id":"01a382e4b55991d6db"},{"skillset":["Docker","Amazon Web Services","DevOps","Deployment Automation"],"title":"Create ECS Fargate Setup for a docker image - Upwork","description":"Looking for someone to create a ECS server from a docker image. \nThe docker image is already on dockerhub. \nLooking for someone to do this today. I will provide access to the AWS Account.<b>Skills</b>:        Docker,                     Amazon Web Services,                     DevOps,                     Deployment Automation            ","link":"https://www.upwork.com/jobs/Create-ECS-Fargate-Setup-for-docker-image_%7E01548a24bc21799917?source=rss","processedDate":"2024-03-19T08:44:31.718Z","postedDate":"<b>Posted On</b>: March 15, 2024 06:31 UTC","id":"01548a24bc21799917"},{"skillset":["Kubernetes","DevOps","Amazon Web Services","Linux System Administration"],"title":"Join an RHEL 8 EC2 node to EKS cluster  in a AWS Private VPC - Upwork","description":"We have a Private VPC setup with 2 EC2s on RHEL8.&nbsp;&nbsp;\nEKS cluster is already created .\nShould join the RHEL EC2s as a worker node. In Private VPC&nbsp;&nbsp;there is no internet, everything should work offline. Any required packages can be copied to Ec2 via S3.\nNo Terraform scripts, no recreation of Ec2 with AMIs, no egress or internet gateway enabling is possible.\nThis is a possible task, and worker nodes may not be visible on the EKS control plane, which should be fine, along as able to manage pods and deployments through the bastion host.\nIt&#039;s not a straightforward task for sure, but not complex either. A bit challenging, so please think before you apply for this.\nNote: A FARGATE profile is already attached to EKS Cluster. Hence, the worker node(RHEL) should be joined to EKS cluster\nNeed the documentation as part of the deliverable.<b>Skills</b>:        Kubernetes,                     DevOps,                     Amazon Web Services,                     Linux System Administration            ","link":"https://www.upwork.com/jobs/Join-RHEL-EC2-node-EKS-cluster-AWS-Private-VPC_%7E01bf8308f8c447e100?source=rss","processedDate":"2024-03-19T08:44:31.718Z","postedDate":"<b>Posted On</b>: March 14, 2024 21:53 UTC","id":"01bf8308f8c447e100"},{"skillset":["GitLab","Deployment Automation"],"title":"Gitlab Expert - Upwork","description":"We are seeking a Gitlab Exper. Ideal candidates should be able to upgrade, backup, and restore GitLab environments and repositories.\nRequirements:\n&middot; Experience working with AWS Cloud\n&middot; Foundational level understanding of VPC Networking, Subnets and Security Groups.\n&middot; DevOps experience, preferably using GitLab, setting up repositories, GitLab pipelines, debugging deployment issues.\n&middot; Experience with deploying docker containers using GitLab pipelines.\n&middot; Experience with securing GitLab repositories, branching policies and pipelines.\n&middot; Terraform coding experience and deploying to AWS.<b>Skills</b>:        GitLab,                     Deployment Automation            ","link":"https://www.upwork.com/jobs/Gitlab-Expert_%7E01ee6af6ef17309d99?source=rss","processedDate":"2024-03-19T08:44:31.718Z","postedDate":"<b>Posted On</b>: March 14, 2024 19:29 UTC","id":"01ee6af6ef17309d99"},{"skillset":["DevOps","CI/CD","Deployment Automation","Docker","Amazon Web Services","Google Workspace","DigitalOcean"],"title":"DevOps + IT Ops Engineer - Upwork","description":"We have a niche need for a bit of a hybrid role between IT Ops + DevOps.\nWe need someone that can take on less than 3hrs/week for random work we need done.\nTypes of tasks include:\n* Onboarding/Offboarding Employees\n* Email Account + Group Management in Google Workplace\n* Github Actions pipelines\n* Infrastructure + Terraform setup/maintenance on both AWS and Cloudways (ideally moving all to AWS)<b>Skills</b>:        DevOps,                     CI/CD,                     Deployment Automation,                     Docker,                     Amazon Web Services,                     Google Workspace,                     DigitalOcean            ","link":"https://www.upwork.com/jobs/DevOps-Ops-Engineer_%7E01794e825c3d5f6d1e?source=rss","processedDate":"2024-03-19T08:44:31.718Z","postedDate":"<b>Posted On</b>: March 14, 2024 17:13 UTC","id":"01794e825c3d5f6d1e"},{"skillset":["Amazon Web Services","Cloud Security","DevOps","Information Security"],"title":"Cloud Security Engineer - Upwork","description":"Cloud Security Engineer\nWe are looking for a Cloud Security Engineer with experience on AWS, to join our growing team. The successful candidate will have an essential role in ensuring the information security of our business. You will be working in a team designing and building resilient and secure Cloud environments that proactively prevent security threats.\nProject Team:\nWhen you join our team, you&#039;ll be immersed in a culture where teammates support each other to achieve better results. We believe that together we are better and can find brilliant solutions by sharing ideas.\nRequirements:\nBSc/MSc in Information Security or any other related field\nGeneral experience of not less than 5 years in the DevOps field\nMinimum 2 years of working experience in Information Security, with a proven focus on Cloud Security\nTechnical knowledge of Amazon Web Services (AWS)\nProficiency with AWS services such as IAM, Organizations, SO, VPC, Transit Gateway, S3, EC2, RDS, ELB, CloudTrail, Config, Inspector, GuardDuty, WAF, etc.\nClear understanding of current threats to Cloud infrastructure and advanced knowledge of securing such environments\nExpertise in DevSecOps methodologies is considered a plus\nBackground building and deploying applications to the cloud (AWS, Azure, etc.) using Infrastructure as Code\nAbility to work autonomously with minimum supervision and to integrate well within a team\nCapability to quickly learn new technologies in depth\nAvailability to work in Cyprus timezone\nNice to Have:\nCode tools such as Terraform\nExpertise in container security\nProficiency with Microsoft Azure and Oracle Cloud\nEnglish level:\nUpper-Intermediate\nResponsibilities:\nDesign and build resilient Cloud infrastructures that are protected against security threats\nDevelop and assess Cloud security solutions to secure systems, databases, and networks\nConduct assessment and make recommendations to ensure that appropriate controls are in place\nGain insight into security incidents and threats by monitoring/analyzing logs and performing vulnerability assessments\nParticipate in efforts that shape the company&#039;s security policies, procedures, and standards for use in Cloud environments\nCreate technical and managerial level security reports for Cloud-based applications and infrastructure\nImplement and test network and security Disaster Recovery procedures to ensure business continuity\nMonitor the use of sensitive data and regulate access to safeguard information\nEnsure the confidentiality and integrity of data during transmission, storage, and processing\nReview violations of security procedures and discuss procedures with violators to ensure they are not repeated\nProvide support to end users regarding network and security-related issues\nMust to have DevOps (AWS);\nMust to have General experience of not less than 5 years in the DevOps field\nMust to have Minimum 2 years of working experience in Information Security, with a proven focus on Cloud Security\nLocation: Bulgaria, Georgia, Hungary, Lithuania, Poland, Romania, Uzbekistan. \nIt is required and must to have to be located or relocated in Bulgaria, Georgia, Hungary, Lithuania, Poland, Romania, Uzbekistan. . \nRelocated from Ukraine/CIS/India/Asia/Africa&nbsp;&nbsp;with on point work permits living in such countries Bulgaria, Georgia, Hungary, Lithuania, Poland, Romania, Uzbekistan\nLong term period 100% remote ASAP<b>Skills</b>:        Amazon Web Services,                     Cloud Security,                     DevOps,                     Information Security            ","link":"https://www.upwork.com/jobs/Cloud-Security-Engineer_%7E011ebfcd93beb3a8f4?source=rss","processedDate":"2024-03-19T08:44:31.718Z","postedDate":"<b>Posted On</b>: March 14, 2024 10:31 UTC","id":"011ebfcd93beb3a8f4"},{"skillset":["Amazon Web Services","Jenkins","CI/CD","Kubernetes","Amazon EC2","Git","DevOps","MongoDB","Terraform","Docker","Azure DevOps","Amazon ECS for Kubernetes"],"title":"Looking for Azure DevOps Engineer - Upwork","description":"[Looking for DevOps Engineer]\nHi there,\nI&#039;m Gourav Gangani, leading the product team at FiveS Digital. I&#039;m reaching out because we&#039;re in need of a DevOps professional to assist us with migrating our application from AWS to Azure.\nIf you&#039;re available and interested, please let me know.\nBest regards,\nGourav G<b>Skills</b>:        Amazon Web Services,                     Jenkins,                     CI/CD,                     Kubernetes,                     Amazon EC2,                     Git,                     DevOps,                     MongoDB,                     Terraform,                     Docker,                     Azure DevOps,                     Amazon ECS for Kubernetes            ","link":"https://www.upwork.com/jobs/Looking-for-Azure-DevOps-Engineer_%7E01bac1e3693566735d?source=rss","processedDate":"2024-03-19T08:44:31.718Z","postedDate":"<b>Posted On</b>: March 14, 2024 07:41 UTC","id":"01bac1e3693566735d"},{"skillset":["Git","Microsoft Azure","Linux System Administration","System Administration","Troubleshooting","AWS Application","Terraform","Apache Kafka"],"title":"Principal Systems Operations Engineer (1 year 3 month contract) - Lithuania - Upwork","description":"Strategic Staffing Solutions International client - the world&#039;s second-largest stock exchange. It&#039;s an opportunity to grow professionally while working at the forefront of finance and technology.\nWe are on the hunt for a technology consultant with a deep understanding and extensive experience in both cloud and on-premise infrastructures to guide our business through its next phase of growth and innovation.\nREQUIREMENTS:\nThe ideal candidate will possess expert-level knowledge in cloud platforms such as AWS and Azure, with proficiency in tools like Helm, Terraform, Git, and Kafka, to drive seamless application orchestration, deployment, and management.\nYour expertise should not stop at the cloud. We value a strong foundation in on-premise technologies, including Linux, databases, networking, and firewalls, ensuring our physical infrastructure is as robust and agile as our cloud-based assets.\nWe&#039;re particularly interested in consultants who can also offer insight and experience in:\nContainerization and Microservices: Utilizing Docker, Kubernetes, and similar technologies to facilitate scalable and efficient deployment.\nCI/CD Pipelines: Building and maintaining Continuous Integration and Continuous Deployment frameworks with tools such as Jenkins, CircleCI, or GitHub Actions.\nCloud Security and Compliance: Implementing stringent security measures, managing identities, and ensuring compliance across cloud services.\nPerformance Monitoring and Optimization: Using Prometheus, Grafana, ELK Stack, or similar tools for insightful monitoring and logging to maintain optimal performance.\nWe are looking for a visionary who can help navigate the complexities of modern IT infrastructure, ensuring technology investments are secure, effective, and aligned with strategic goals.\nCOMPANY OFFERS:\nHybrid working model (2 days from the office, other days can be remote. Office is located in Kostitucijos Ave.)\n1 year and 3 month contract with the possibility of extension\nInternational environment, supportive team, and lots of opportunities to grow<b>Skills</b>:        Git,                     Microsoft Azure,                     Linux System Administration,                     System Administration,                     Troubleshooting,                     AWS Application,                     Terraform,                     Apache Kafka            ","link":"https://www.upwork.com/jobs/Principal-Systems-Operations-Engineer-year-month-contract-Lithuania_%7E01b0c9fefcb65ddf38?source=rss","processedDate":"2024-03-19T08:44:31.718Z","postedDate":"<b>Posted On</b>: March 14, 2024 07:17 UTC","id":"01b0c9fefcb65ddf38"},{"skillset":["Terraform","Docker","Amazon Web Services","DevOps","CI/CD","Linux System Administration","NGINX"],"title":"DevOps Role with AWS and Docker Experience - Upwork","description":"I am seeking to establish a position for an individual proficient in cloud engineering to provide guidance on my IT projects. The ideal candidate should be available for at least three hours within Eastern Time business hours, from 10am to 5pm. \nThe desired expertise includes familiarity and experience with GitHub Actions CI/CD, AWS services, Docker containers, Terraform, and deploying Docker containers to AWS using CI/CD from GitHub Actions. \nInitially, your role will involve assisting in setting up a Docker container from a GitHub repository and deploying it to AWS. Subsequently, you will be tasked with creating a Terraform template to establish an Elastic Beanstalk environment on AWS. Additionally, troubleshooting a TLS renewal issue on a Linux instance will be part of the responsibilities.\nBonus skills would include proficiency in Nginx configuration and automatic SSL renewal setup, as well as Python coding. \nApplicants who are willing to keep their camera on during interactions are preferred. Excellent communication skills in either English or Urdu are essential. \nThe expected weekly commitment for this role is approximately 3-6 hours.<b>Skills</b>:        Terraform,                     Docker,                     Amazon Web Services,                     DevOps,                     CI/CD,                     Linux System Administration,                     NGINX            ","link":"https://www.upwork.com/jobs/DevOps-Role-with-AWS-and-Docker-Experience_%7E015a77b9fee97b4164?source=rss","processedDate":"2024-03-19T08:44:31.719Z","postedDate":"<b>Posted On</b>: March 13, 2024 18:43 UTC","id":"015a77b9fee97b4164"},{"skillset":["Terraform","Amazon Web Services","CI/CD","DevOps"],"title":"CI/CD expert with AWS - Upwork","description":"I&#039;m working on a CI/CD project utilizing AWS CodeBuild and Bitbucket and need a freelancer to help develop a comprehensive pipeline and manage multiple versions of the project. The initial build project is complete; the next steps involve automating integration and deployment to enhance efficiency.\nKey Requirements:\nDesign and implement a CI/CD pipeline using AWS CodeBuild and CodePipeline.\nIntegrate Bitbucket repositories for automated code deployment.\nConfigure CodeBuild for various project versions.\nSolve any issues that arise during CI/CD pipeline development.\nLooking For:\nExpertise in AWS CI/CD tools (CodeBuild, CodePipeline).\nExperience with Bitbucket and version control in CI/CD.\nSkill in automating build and deployment processes.\nGood problem-solving abilities and effective communication skills.<b>Skills</b>:        Terraform,                     Amazon Web Services,                     CI/CD,                     DevOps            ","link":"https://www.upwork.com/jobs/expert-with-AWS_%7E01b567bfd44a90ab52?source=rss","processedDate":"2024-03-19T08:44:31.719Z","postedDate":"<b>Posted On</b>: March 13, 2024 17:48 UTC","id":"01b567bfd44a90ab52"},{"skillset":["Kubernetes","CI/CD","Amazon Web Services","CI/CD Platform","Docker","Deployment Automation","DevOps"],"title":"Lead DevOps Engineer - Upwork","description":"Seeking a Senior DevOps Engineer\n-Kubernetes/EKS\n-Docker\n-Terraform\n-Gitlab\n-ArgoCD\n-microservices\n-Grafana, Prometheus, loki\n-SonarQube\n-AWS<b>Skills</b>:        Kubernetes,                     CI/CD,                     Amazon Web Services,                     CI/CD Platform,                     Docker,                     Deployment Automation,                     DevOps            ","link":"https://www.upwork.com/jobs/Lead-DevOps-Engineer_%7E015d9a32042f04b0ae?source=rss","processedDate":"2024-03-19T08:44:31.719Z","postedDate":"<b>Posted On</b>: March 13, 2024 14:40 UTC","id":"015d9a32042f04b0ae"},{"skillset":["Terraform","DevOps","Google Cloud Platform","CI/CD"],"title":"IaC code setup &amp; CICD for multiple environment using Terraform-GCP - Upwork","description":"We need someone to setup our existing IaC code for multiple environments. Offcourse some codes you need to write. You should have good knowledge of Gitlab CICD, Terraform &amp;amp; GCP. Our existing code is not modularized we may need your help there and you earn Bonus for that.&nbsp;&nbsp;<b>Skills</b>:        Terraform,                     DevOps,                     Google Cloud Platform,                     CI/CD            ","link":"https://www.upwork.com/jobs/IaC-code-setup-amp-CICD-for-multiple-environment-using-Terraform-GCP_%7E016212965fc4378f8e?source=rss","processedDate":"2024-03-19T08:44:31.719Z","postedDate":"<b>Posted On</b>: March 13, 2024 12:12 UTC","id":"016212965fc4378f8e"},{"skillset":["Git","Google Cloud Platform","Kubernetes"],"title":"DevOps expert with GCP - Upwork","description":"The tasks are for a predictive road intelligence analytics company providing insight&nbsp;&nbsp;to allow automotive companies to better predict road safety in order to reduce driving accidents.\nWe are going to develop a cloud-agnostic data ingestion and processing pipeline to manage large volumes of real-time location data, such as connected vehicle, cell phone, and IoT data. \nSkillset\nMain skills: Apache Kafka, GCP pub/sub, GCP big query, Kubernetes\nNice to have: Terraform, AWS, Github Action<b>Skills</b>:        Git,                     Google Cloud Platform,                     Kubernetes            ","link":"https://www.upwork.com/jobs/DevOps-expert-with-GCP_%7E0164465eedbcb2925d?source=rss","processedDate":"2024-03-19T08:44:31.719Z","postedDate":"<b>Posted On</b>: March 13, 2024 07:17 UTC","id":"0164465eedbcb2925d"},{"skillset":["CI/CD","DevOps","Deployment Automation","Docker","Amazon Web Services","CI/CD Platform","Git","Kubernetes","Application Release Automation"],"title":"Looking some expert build ci cd pipeline with git and cloud server\n - Upwork","description":"Looking some expert setup ci cd pipeline with git and cloud server<b>Skills</b>:        CI/CD,                     DevOps,                     Deployment Automation,                     Docker,                     Amazon Web Services,                     CI/CD Platform,                     Git,                     Kubernetes,                     Application Release Automation            ","link":"https://www.upwork.com/jobs/Looking-some-expert-build-pipeline-with-git-and-cloud-server_%7E013f1cfc2572d1fc2c?source=rss","processedDate":"2024-03-19T08:44:31.719Z","postedDate":"<b>Posted On</b>: March 13, 2024 06:17 UTC","id":"013f1cfc2572d1fc2c"},{"skillset":["Terraform","Microsoft Azure","Vault by HashiCorp"],"title":"Troubleshoot existing terraform issues. - Upwork","description":"Having issues with creating a container app with terraform need help with fixing issues <b>Skills</b>:        Terraform,                     Microsoft Azure,                     Vault by HashiCorp            ","link":"https://www.upwork.com/jobs/Troubleshoot-existing-terraform-issues_%7E016c89d9ff0a1d73f5?source=rss","processedDate":"2024-03-19T08:44:31.719Z","postedDate":"<b>Posted On</b>: March 13, 2024 02:53 UTC","id":"016c89d9ff0a1d73f5"},{"skillset":["System Administration","Network Administration","Network Security","Amazon Web Services"],"title":"Infrastructure Engineer - Upwork","description":"\nSahyog Inc is a well-funded startup in logistics space. We are hiring an experienced \nInfrastructure Engineer to help us keep growing. If you&#039;re dedicated and ambitious, Sahyog Inc. \nis an excellent place to grow your career. Don&#039;t hesitate to apply. \nResponsibilities for Infrastructure Engineer \nAs the Cloud Infrastructure Engineer, you will play a key role in a nimble team, developing \nhigh-performance microservices, designing advanced monitoring and logging systems, and \ncontributing to new product rollouts \nEstablish and manage serverless AWS infrastructure using Terraform/Pulumi \nDevelop and maintain resources with tagging, monitoring, and alerting features. \nDeploy new services and infrastructure using Terraform/Pulumi \nImplement monitoring and alerting of core resources using Terraform/Pulumi \nOversee GitHub Actions and Continuous Deployment (CD) \nMaintain integration actions for linting and static analysis \nHandle build infrastructure using hosted and self-hosted runners \nDevelop integrated, automated deployment pipelines, incorporating cost estimation into \ninfrastructure pipelines and setting policies on resource usage and costs \nQualifications for Infrastructure End Engineer \n5+ years of experience \nExperience with containerization and orchestration tools like Docker and Kubernetes \nProficiency with CI/CD pipelines, preferably GitHub Actions \nCapability to thrive and take ownership in a startup environment, while collaborating closely \nwith a small, high-performing team \nExcellent communication skills and strong work ethic \nPassion for building scalable systems and scaling an early-stage company. \nAbility to adapt quickly to shifting goals in a dynamic work environment. \nKnowledge and understanding of the Web3 ecosystem \nInterest in EVM type blockchains <b>Skills</b>:        System Administration,                     Network Administration,                     Network Security,                     Amazon Web Services            ","link":"https://www.upwork.com/jobs/Infrastructure-Engineer_%7E01b80ba87273e007e4?source=rss","processedDate":"2024-03-19T08:44:31.719Z","postedDate":"<b>Posted On</b>: March 12, 2024 19:29 UTC","id":"01b80ba87273e007e4"},{"skillset":["Terraform"],"title":"Terraform deployment - Upwork","description":"container app deployloyment with terraform and trouble shoot errir<b>Skills</b>:        Terraform            ","link":"https://www.upwork.com/jobs/Terraform-deployment_%7E0154f7d3c04319fa83?source=rss","processedDate":"2024-03-19T08:44:31.719Z","postedDate":"<b>Posted On</b>: March 12, 2024 18:06 UTC","id":"0154f7d3c04319fa83"},{"skillset":["DevOps","Microsoft Azure","Terraform","Deployment Automation","CI/CD"],"title":"DevOps professional with passion for Azure cloud deployments using Terraform - Upwork","description":"We have an exciting opportunity for a seasoned DevOps professional with passion for Azure cloud deployments using Terraform. \nWe Offer:\n&bull;\tA fully remote position, giving you the freedom to work from anywhere in Europe (Must be based in Europe).\n&bull;\tA dynamic project duration of 6 months, with a strong possibility of extension based on performance.\n&bull;\tThe chance to be a part of a forward-thinking team, committed to leveraging the latest in cloud technologies.\nWhat We&#039;re Looking For:\n&bull;\tA minimum of 5 years in DevOps, with a strong emphasis on Azure cloud environments and Terraform deployments.\n&bull;\tProfessional certifications in Azure and/or Terraform that validate your expertise and commitment to excellence.\n&bull;\tMust be based in Europe to align with our operational hours and collaborative team dynamics.\n&bull;\tA problem-solver at heart, you bring creative solutions to complex challenges, driving efficiency and effectiveness.\n&bull;\tTeam Collaboration - Good communication skills&nbsp;&nbsp;in English<b>Skills</b>:        DevOps,                     Microsoft Azure,                     Terraform,                     Deployment Automation,                     CI/CD            ","link":"https://www.upwork.com/jobs/DevOps-professional-with-passion-for-Azure-cloud-deployments-using-Terraform_%7E011ae78bb8fe416036?source=rss","processedDate":"2024-03-19T08:44:31.719Z","postedDate":"<b>Posted On</b>: March 12, 2024 14:39 UTC","id":"011ae78bb8fe416036"},{"skillset":["Linux","Terraform","Azure DevOps Server","Containerization","Microsoft Azure","DevOps","CI/CD","Deployment Automation","CI/CD Platform","Node.js"],"title":"Azure DevOps Engineer - CI/CD Pipeline Setup for Node.js 20 / NestJS App  - Upwork","description":"We are seeking an experienced DevOps Engineer for a short-term engagement to set up a CI/CD pipeline for our Node.js 20 / NestJS application. The app utilizes Prisma as the ORM and requires deployment to an Azure Web App, with a PostgreSQL Flexible Server as the database.\nResponsibilities:\nCollaborate with our development team to understand the application architecture and requirements\nSet up a CI/CD pipeline using Azure DevOps for our Node.js 20 / NestJS application\nConfigure the pipeline to integrate with our GitHub repository for source code management\nImplement automated build, test, and deployment processes within the pipeline\nEnsure seamless deployment of the application to an Azure Web App\nConfigure the application to connect to a PostgreSQL Flexible Server database\nProvide documentation and knowledge transfer to our team for future maintenance and updates\nRequired Skills and Experience:\nStrong understanding of DevOps principles and practices\nProven experience setting up CI/CD pipelines, preferably using Azure DevOps\nFamiliarity with Node.js 20 and NestJS framework\nKnowledge of Prisma ORM and its integration with Node.js applications\nExperience deploying applications to Azure Web App\nProficiency in configuring and managing PostgreSQL databases, specifically Flexible Server\nExcellent problem-solving and communication skills\nAbility to work independently and deliver results within a specified timeline\nProject Duration:\nThis is a short-term engagement, estimated to take approximately 1-2 weeks, depending on the complexity of the setup and any specific requirements.<b>Skills</b>:        Linux,                     Terraform,                     Azure DevOps Server,                     Containerization,                     Microsoft Azure,                     DevOps,                     CI/CD,                     Deployment Automation,                     CI/CD Platform,                     Node.js            ","link":"https://www.upwork.com/jobs/Azure-DevOps-Engineer-Pipeline-Setup-for-Node-NestJS-App_%7E01ccb9ed48e8ad213f?source=rss","processedDate":"2024-03-19T08:44:31.719Z","postedDate":"<b>Posted On</b>: March 12, 2024 12:46 UTC","id":"01ccb9ed48e8ad213f"},{"skillset":["AWS Lambda","Database Management","OpenAI API","API Integration","Web Application","Amazon Web Services","Data Analysis","ETL Pipeline","Data Science"],"title":"Need IT Engineer to align AWS Ecosystem with big data analytics  - Upwork","description":"Will pay up to $2000 to incentive for delivery of working product within 3 month window\nProject Outline:\n1. AWS Integration: Harnessing AWS services like AWS Lambda, Amazon RDS, Amazon S3, AWS API Gateway, and Amazon Cognito. This necessitates comprehensive knowledge of AWS, focusing on scalability, security, and cost-effective architecture.\n2. Equivalent System Integration: The system must interface seamlessly with governmental or similar systems for procurement, handling data related to vendor and contract management, and compliance tracking. Familiarity with these systems&#039; API structures, authentication, and usage limits is essential.\n3. Deliverables: The system should offer robust management tools for procurement processes, ensuring data integrity and compliance with all regulations.\nSkills Required:\n- AWS Expertise: AWS Certified Developer or Solutions Architect certifications are beneficial.\n- Full Stack Development: Proficiency in front-end (e.g., React, Angular) and back-end (e.g., Node.js, Python) technologies, along with RESTful API development.\n- Security and Compliance: Knowledge of security protocols and data protection laws relevant to governmental work.\n- Database Management: Experience with database solutions like Amazon RDS or DynamoDB, focusing on data modeling and optimization.\n- DevOps Practices: Understanding of CI/CD pipelines and infrastructure as code (IaC) using tools like AWS CloudFormation or Terraform.\nTeam Considerations:\nA full-stack developer with AWS and equivalent system experience can lead this project, but the nature of the work might require additional expertise:\n-Cybersecurity Specialist: To enhance system security and ensure compliance with data protection standards.\n- Legal Advisor: For guidance on regulatory requirements specific to governmental procurement and technology.\n- UI/UX Designer: To make sure the platform is user-friendly and accessible across different departments.\nA collaborative approach, where the project lead is open to incorporating additional expertise as needed, is key to delivering a high-quality product that meets regulatory standards and user expectations. This setup allows for a flexible response to emerging challenges and ensures that the project can adapt to meet all its objectives efficiently.<b>Skills</b>:        AWS Lambda,                     Database Management,                     OpenAI API,                     API Integration,                     Web Application,                     Amazon Web Services,                     Data Analysis,                     ETL Pipeline,                     Data Science            ","link":"https://www.upwork.com/jobs/Need-Engineer-align-AWS-Ecosystem-with-big-data-analytics_%7E013b38eabdb755bee2?source=rss","processedDate":"2024-03-19T08:44:31.719Z","postedDate":"<b>Posted On</b>: March 12, 2024 11:01 UTC","id":"013b38eabdb755bee2"},{"skillset":["Python","Grafana","Terraform","AWS Lambda","Prometheus","DevOps"],"title":"Grafana Loki and Terraform - Upwork","description":"We are looking for the candidate having more than 7 years of experience in below technologies\nSkills -Grafana, python, Terraform, AWS, Loki , Eks\nLambda\nTiming&nbsp;&nbsp;: 7 AM IST / 7 PM IST\nDuration : 20 hrs/ Monthly\nBudget&nbsp;&nbsp;: 1k/2 hrs\nWork Type: Screen sharing viz Zoom call<b>Skills</b>:        Python,                     Grafana,                     Terraform,                     AWS Lambda,                     Prometheus,                     DevOps            ","link":"https://www.upwork.com/jobs/Grafana-Loki-and-Terraform_%7E012c67811576745258?source=rss","processedDate":"2024-03-19T08:44:31.719Z","postedDate":"<b>Posted On</b>: March 11, 2024 16:00 UTC","id":"012c67811576745258"},{"skillset":["Amazon Web Services","AWS AppSync","Terraform"],"title":"Terraform AWS AppSync debugging - Upwork","description":"I have an AWS AppSync application that creates AppSync datasources and resolvers through Terraform. However, not all the datasources and resolvers are being created in AWS and I need help debugging to find out why. <b>Skills</b>:        Amazon Web Services,                     AWS AppSync,                     Terraform            ","link":"https://www.upwork.com/jobs/Terraform-AWS-AppSync-debugging_%7E01fe84ce70a529748c?source=rss","processedDate":"2024-03-19T08:44:31.719Z","postedDate":"<b>Posted On</b>: March 11, 2024 15:19 UTC","id":"01fe84ce70a529748c"},{"skillset":["Terraform","CI/CD","DevOps"],"title":"Terraform Expert Needed - Upwork","description":"I am seeking an expert in Terraform who can enhance the deployment process of a web3 application from Gitlab to EC2, along with Redis and RDS. The result should allow deployment from Gitlab to Cloudfront/AWS, which includes generating new instances for development purposes.\nKindly provide an estimate of the total hours required.<b>Skills</b>:        Terraform,                     CI/CD,                     DevOps            ","link":"https://www.upwork.com/jobs/Terraform-Expert-Needed_%7E011771e7c0ddd1d243?source=rss","processedDate":"2024-03-19T08:44:31.719Z","postedDate":"<b>Posted On</b>: March 11, 2024 12:12 UTC","id":"011771e7c0ddd1d243"},{"skillset":["Terraform","Git","Deployment Automation","DevOps Engineering","Infrastructure Management","DevOps","Docker","Kubernetes","Amazon Web Services","CI/CD"],"title":"DevOps engineer - Upwork","description":"We are looking for experienced DevOps engineer to join our team. We have flexible working hours. More details can be shared upon request\nResponsibilities:\n- Architect and manage scalable infrastructure using IaC, specifically Terraform.\n- Develop and optimize CI/CD pipelines, incorporating Kubernetes and Docker, for efficient NodeJS/NextJS application delivery.\n- Foster collaboration across teams for transparent communication.\n- Implement monitoring solutions and troubleshoot issues proactively.\n- Ensure security, compliance, and automation best practices.\nQualifications:\n- Proven DevOps experience\n- Proficient in configuration management, Terraform, and containerization (Docker, Kubernetes).\n- Familiarity with cloud platforms and CI/CD tools.\n- Strong understanding of networking, security, and system administration.<b>Skills</b>:        Terraform,                     Git,                     Deployment Automation,                     DevOps Engineering,                     Infrastructure Management,                     DevOps,                     Docker,                     Kubernetes,                     Amazon Web Services,                     CI/CD            ","link":"https://www.upwork.com/jobs/DevOps-engineer_%7E01a4920e0d2f92274b?source=rss","processedDate":"2024-03-19T08:44:31.719Z","postedDate":"<b>Posted On</b>: March 11, 2024 12:09 UTC","id":"01a4920e0d2f92274b"},{"skillset":["Git","Kubernetes","Terraform","DevOps","CI/CD","Amazon Web Services","Deployment Automation"],"title":"DevOps Engineer Role - Upwork","description":"Arbemi is a boutique DevOps consulting firm. We help companies and startups implement cutting edge DevOps &amp;amp; cloud solutions.\nOur vision is to be the default place companies go to when they want to build great software and make it easy for them to develop, build, and run code.\nArbemi is run by a small team, who bring a ton of expertise (and fun!) to their work. This is an amazing opportunity for you to have a meaningful direct impact on our client&#039;s solutions and help them scale their infrastructure and operations.\nSome of the roles and responsibilities you can tackle:\n-Implementing CI/CD pipelines\n-Working with production environments\n-Creating professional IaC deployment solutions\n-Working on Kubernetes clusters\n-Manage all aspects of cloud infrastructure, including database technologies, ensuring that backend architecture is scalable and highly available\n-Set up and promote good observability practices across clients, including logging and monitoring, designing for reliability, scalability and security, automated testing, risk and incident management.\n-Collaborate with internal and external parties, and technical and non-technical teams to build and support development platforms and applications.\nHere&rsquo;s what we&rsquo;d expect you to bring to the table:\n-BSc in Computer Science, Engineering or equivalent experience\n-Experience as a DevOps Engineer or similar software engineering role\n-Proficient with git and git workflows\n-Working knowledge of databases and SQL\n-Problem-solving attitude\n-Expert knowledge with infrastructure as code.\n-Hands-on technical experience managing cloud services at scale.\n-Strong focus on CI/CD and other product delivery practices.\n-Excellent collaboration, written communication and time management skills, facilitating efficient communication with experts from around the globe.\n-Proficiency in a programming language (preferably Python).\n-Fluency in English, with additional language(s) a plus.\nWhat we offer:\nThe opportunity to work for an industry leading consulting firm.\nPotential to grow in your role.\nLearning opportunities and certifications.\nThe chance to work with a highly-experienced team in a fun environment.\nA competitive salary based on your level of experience.\nA flexible working schedule\nPossibility to work part-time or full-time\nFlexible work from home policy.<b>Skills</b>:        Git,                     Kubernetes,                     Terraform,                     DevOps,                     CI/CD,                     Amazon Web Services,                     Deployment Automation            ","link":"https://www.upwork.com/jobs/DevOps-Engineer-Role_%7E018aa7cd76a305eb03?source=rss","processedDate":"2024-03-19T08:44:31.719Z","postedDate":"<b>Posted On</b>: March 11, 2024 09:11 UTC","id":"018aa7cd76a305eb03"},{"skillset":["Amazon Web Services","RESTful API","API","PHP","API Integration","Database","Python","AWS Lambda"],"title":"PHP to AWS Serverless Conversion Expert Needed for REST API Migration using Python on Lambda - Upwork","description":"Description:\nWe are looking for a skilled AWS Lambda developer proficient in Python to assist us with migrating our existing REST API from PHP to AWS Lambda. This migration is crucial for optimizing our application&#039;s performance, scalability, and cost-efficiency.\nResponsibilities:\nReview and understand the functionality of our existing REST API written in PHP.\nDesign and implement the migration plan to AWS Lambda using Python, ensuring compatibility and functionality preservation.\nIntegrate the Lambda functions with other AWS services like DynamoDB, API Gateway, and IAM as required.\nOptimize the Lambda functions for performance, cost-effectiveness, and scalability.\nImplement robust error handling, logging, and monitoring solutions to ensure reliability and visibility.\nCollaborate with our development team to ensure a seamless transition and provide necessary documentation and guidance.\nRequirements:\nProficiency in Python programming language and experience with AWS Lambda.\nSolid understanding of REST API architecture and best practices.\nExperience with serverless migration projects and familiarity with AWS services such as DynamoDB, API Gateway, and IAM.\nAbility to write clean, maintainable, and well-documented code.\nFamiliarity with CI/CD pipelines and infrastructure as code tools like AWS SAM or Terraform is a plus.\nExcellent communication skills and the ability to work effectively in a remote team environment.\nAvailability to start immediately and commit to the project timeline.\nIf you have the expertise and passion for migrating REST APIs to AWS Lambda using Python, we would love to hear from you! Please provide examples of similar projects you have worked on, along with your hourly rate and availability for this engagement.\nNote: The API source code will be provided upon engagement, and all communication and collaboration will be conducted through Upwork&#039;s platform. We are excited to work with a talented developer to enhance our API&#039;s capabilities on AWS Lambda!<b>Skills</b>:        Amazon Web Services,                     RESTful API,                     API,                     PHP,                     API Integration,                     Database,                     Python,                     AWS Lambda            ","link":"https://www.upwork.com/jobs/PHP-AWS-Serverless-Conversion-Expert-Needed-for-REST-API-Migration-using-Python-Lambda_%7E01ce4b6e1efc28d775?source=rss","processedDate":"2024-03-19T08:44:31.719Z","postedDate":"<b>Posted On</b>: March 11, 2024 07:23 UTC","id":"01ce4b6e1efc28d775"},{"skillset":["Python","Amazon Web Services","Laravel","Apache Kafka","Serverless Computing","Vue.js","AWS IoT Core","Amazon ECS","Node.js","API Development","Amazon MWS"],"title":"Scalable Backend API Developers - Upwork","description":"Job Details\nTypeScript\nNode.js\nAmazon Web Services (AWS)\nSummary:\nJoin our team as a Back-End Developer and be part of an exciting project developing a social media app with multiple features. In this role, you will work with Typescript and AWS technologies to build a robust back-end infrastructure following a microservices and serverless architecture. The app allows users to earn rewards by watching advertisements, and scalability is a key priority. If you are passionate about developing scalable solutions, leveraging AWS services, and optimizing system performance, this opportunity is perfect for you.\nGeneral Information:\nOur company is developing a social media app that seamlessly integrates shopping services and offers users the ability to earn rewards through advertisement engagement. The back-end architecture follows a microservices and serverless approach, utilizing Typescript and AWS technologies. We prioritize scalability and have a strong focus on infrastructure responsibility, leveraging tools like Terraform for managing our working infrastructure. As a Back-End Developer, you will work in a DevOps environment and collaborate with cross-functional teams to improve and expand the existing product.\nTasks and Deliverables:\nBuild and maintain a scalable and efficient back-end infrastructure using Typescript and AWS technologies.\nDevelop microservices and leverage serverless frameworks to optimize performance and resource utilization.\nImplement the Export Media API using Node.js and TypeScript, ensuring seamless integration with the app&#039;s serverless domain and AWS SDK.\nCollaborate with third-party providers, such as banuba, imgly and byteplus for media processing and AI, to enhance system functionality.\nContinuously improve the system by revamping and refactoring existing components while ensuring compatibility and scalability.\nWork closely with the team to meet the Q1 soft launch deadline, ensuring high-quality code and seamless deployment.\nKeep testing in mind during development, ensuring robustness and reliability of the back-end functionalities.\nRequired Experience:\nStrong proficiency in Typescript and experience working with AWS services.\nFamiliarity with microservices architecture and serverless frameworks.\nSolid understanding of Node.js and experience in developing APIs.\nExperience with CI/CD pipelines, deployment automation, and version control systems.\nAbility to work in a collaborative team environment and communicate effectively.\nNice to Have Experience:\nKnowledge of Okta for authentication and authorization.\nPrevious experience in developing social media or e-commerce platforms.\nFamiliarity with Terraform for infrastructure management.\nExperience with third-party media processing and AI services.\nA strong focus on testing methodologies and ensuring system reliability.<b>Skills</b>:        Python,                     Amazon Web Services,                     Laravel,                     Apache Kafka,                     Serverless Computing,                     Vue.js,                     AWS IoT Core,                     Amazon ECS,                     Node.js,                     API Development,                     Amazon MWS            ","link":"https://www.upwork.com/jobs/Scalable-Backend-API-Developers_%7E0152c8ad100820dcda?source=rss","processedDate":"2024-03-19T08:44:31.720Z","postedDate":"<b>Posted On</b>: March 11, 2024 05:47 UTC","id":"0152c8ad100820dcda"},{"skillset":["Terraform","Microsoft Azure"],"title":"Terraform azure project - Upwork","description":"I have a terraform quick deployment. needed quick <b>Skills</b>:        Terraform,                     Microsoft Azure            ","link":"https://www.upwork.com/jobs/Terraform-azure-project_%7E01d47a515ec9be1a27?source=rss","processedDate":"2024-03-19T08:44:31.720Z","postedDate":"<b>Posted On</b>: March 11, 2024 03:16 UTC","id":"01d47a515ec9be1a27"},{"skillset":["DevOps","CI/CD","Deployment Automation","Amazon Web Services"],"title":"DevOps for webapp deployment  - Upwork","description":"Require a DevOps experience in mern stack to get the application deployed in AWS and set up accurately FE, BE cloud front and elastic beanstalk and GitHub secrets and GitHub action for Ci/CD <b>Skills</b>:        DevOps,                     CI/CD,                     Deployment Automation,                     Amazon Web Services            ","link":"https://www.upwork.com/jobs/DevOps-for-webapp-deployment_%7E016786a47cfdca16cd?source=rss","processedDate":"2024-03-19T08:44:31.720Z","postedDate":"<b>Posted On</b>: March 10, 2024 18:32 UTC","id":"016786a47cfdca16cd"},{"skillset":["DevOps Engineering","AWS Server Migration","Linux System Administration","Docker","Kubernetes","Amazon ECS","CI/CD","Terraform","AWS CloudFormation","Jenkins","GitHub","MySQL","Web Server","Bash","CloudLinux","Web Hosting","Web Host Manager","Red Hat Certified Engineer","CentOS","Ubuntu"],"title":"Productionize AWS setup by optimizing and automating few aspects. - Upwork","description":"We have a dev env and would like to have a similar but more optimized and efficient prod setup on AWS which is automated and scalable.\nCI-CD pipeline are already created some minor enhancements/automation would be needed.<b>Skills</b>:        DevOps Engineering,                     AWS Server Migration,                     Linux System Administration,                     Docker,                     Kubernetes,                     Amazon ECS,                     CI/CD,                     Terraform,                     AWS CloudFormation,                     Jenkins,                     GitHub,                     MySQL,                     Web Server,                     Bash,                     CloudLinux,                     Web Hosting,                     Web Host Manager,                     Red Hat Certified Engineer,                     CentOS,                     Ubuntu            ","link":"https://www.upwork.com/jobs/Productionize-AWS-setup-optimizing-and-automating-few-aspects_%7E0119e007226be92363?source=rss","processedDate":"2024-03-19T08:44:31.720Z","postedDate":"<b>Posted On</b>: March 10, 2024 17:21 UTC","id":"0119e007226be92363"},{"skillset":["Deployment Automation","Enterprise Architecture","Application Server","Database","CI/CD Platform","DevOps","AWS Lambda","Git","Amazon EC2","AWS Server Migration","AWS Application","Amazon Web Services","NGINX","Serverless Stack","Terraform"],"title":"DevOps Engineer - Upwork","description":"DevOps Engineer - AWS infrastructure and service maintenance, maintain existing CI/CD pipeline, user maintenance for GitLab, DB - mysql,&nbsp;&nbsp;VPN and other systems, work with the dev team members during deployment to PROD etc.<b>Skills</b>:        Deployment Automation,                     Enterprise Architecture,                     Application Server,                     Database,                     CI/CD Platform,                     DevOps,                     AWS Lambda,                     Git,                     Amazon EC2,                     AWS Server Migration,                     AWS Application,                     Amazon Web Services,                     NGINX,                     Serverless Stack,                     Terraform            ","link":"https://www.upwork.com/jobs/DevOps-Engineer_%7E01561f7f5f1af792d8?source=rss","processedDate":"2024-03-19T08:44:31.720Z","postedDate":"<b>Posted On</b>: March 10, 2024 06:20 UTC","id":"01561f7f5f1af792d8"},{"skillset":["Python","Django","Node.js","Docker","Serverless Computing","AWS Lambda","GraphQL","Golang","Amazon S3","Amazon Web Services","DevOps","Flask","Terraform"],"title":"Feature: Develop Task Logging Tool for Employees - Upwork","description":"Description:\n- Project mainly relies on serverless functions.\nSoftware Stack:\n- Language: NodeJs\n- Deployment: AWS CDK, Amplify\n- Frontend: Gatsby.js (React-based)<b>Skills</b>:        Python,                     Django,                     Node.js,                     Docker,                     Serverless Computing,                     AWS Lambda,                     GraphQL,                     Golang,                     Amazon S3,                     Amazon Web Services,                     DevOps,                     Flask,                     Terraform            ","link":"https://www.upwork.com/jobs/Feature-Develop-Task-Logging-Tool-for-Employees_%7E01939bc08c93cc60e3?source=rss","processedDate":"2024-03-19T08:44:31.720Z","postedDate":"<b>Posted On</b>: March 09, 2024 15:33 UTC","id":"01939bc08c93cc60e3"},{"skillset":["Google Cloud Platform","Amazon Web Services","Linux"],"title":"AWS Lightsail to GCP Migration - Upwork","description":"I have an AWS Lightsail instance running on Ubuntu. I have installed multiple libraries and packages on this instance. Many of these libraries had to have specific modifications to run.\nI would like to migrate this instance, as is, from AWS Lightsail to GCP. The new instance on GCP should run all the libraries as they are currently run on AWS. I am looking for someone to guide me through the process, in real time, as I do the migration. <b>Skills</b>:        Google Cloud Platform,                     Amazon Web Services,                     Linux            ","link":"https://www.upwork.com/jobs/AWS-Lightsail-GCP-Migration_%7E0122b6d288bc6bbbe0?source=rss","processedDate":"2024-03-19T08:44:31.720Z","postedDate":"<b>Posted On</b>: March 09, 2024 03:59 UTC","id":"0122b6d288bc6bbbe0"},{"skillset":["Amazon Web Services","Amazon EC2","AWS CloudFormation","Amazon ECS","Amazon S3"],"title":"AWS Architect - Upwork","description":"We are seeking an experienced AWS Architect to design, implement, and manage our AWS infrastructure. The ideal candidate should have a deep understanding of AWS services and proven experience in architecting scalable and secure solutions. As an AWS Architect, you will be responsible for analyzing our current infrastructure, identifying areas for improvement, and designing cost-effective and efficient solutions. Additionally, you will collaborate with cross-functional teams to ensure successful implementation and maintenance of the architecture. Strong communication and problem-solving skills are essential for this role. \nResponsibilities:\n- Designing and implementing scalable and secure AWS solutions\n- Analyzing current infrastructure and recommending improvements\n- Collaborating with cross-functional teams to ensure successful implementation\n- Monitoring and managing AWS resources\n- Troubleshooting and resolving issues\nRequirements:\n- Proven experience as an AWS Architect\n- Deep understanding of AWS services\n- Knowledge of infrastructure as code tools such as Terraform or CloudFormation\n- Strong problem-solving and communication skills\n- AWS certifications are a plus<b>Skills</b>:        Amazon Web Services,                     Amazon EC2,                     AWS CloudFormation,                     Amazon ECS,                     Amazon S3            ","link":"https://www.upwork.com/jobs/AWS-Architect_%7E01567cebc9249a56fe?source=rss","processedDate":"2024-03-19T08:44:31.720Z","postedDate":"<b>Posted On</b>: March 09, 2024 00:21 UTC","id":"01567cebc9249a56fe"},{"skillset":["DevOps","Docker","Kubernetes","Amazon Web Services","CI/CD"],"title":"Senior DevOps Engineer - Upwork","description":"We are looking for a Senior DevOps Engineer with experience in terraform, AWS, EKS, and observability. The ideal candidate will have a strong background in cloud infrastructure and automation, and will be responsible for deploying, managing, and monitoring our infrastructure on AWS using tools like Terraform. In addition, they will be involved in setting up and managing our Kubernetes clusters on EKS. Experience with observability tools such as Prometheus, Grafana, and ELK stack is essential. If you are a self-motivated and experienced DevOps professional with strong problem-solving skills, excellent communication, and the ability to work autonomously, we would love to hear from you.<b>Skills</b>:        DevOps,                     Docker,                     Kubernetes,                     Amazon Web Services,                     CI/CD            ","link":"https://www.upwork.com/jobs/Senior-DevOps-Engineer_%7E0124cf7f94fcdc21c1?source=rss","processedDate":"2024-03-19T08:44:31.720Z","postedDate":"<b>Posted On</b>: March 08, 2024 21:08 UTC","id":"0124cf7f94fcdc21c1"}]