[{"skillset":["Software QA","Web Testing","Software Testing","Manual Testing"],"title":"QA Engineer - Upwork","description":"Seeking an experienced QA engineer. We are a small but fast growing startup with an existing suite of SAAS AI-powered products and an engineering team of 10. The team you will be working with includes word-class colleagues that have worked at the top tech companies in the world and founded, scaled, and sold multiple companies. This is a great opportunity to learn from some of the world&rsquo;s best technologists. \nAn individual QA professional with key focus on delivering high quality world-class software applications\nTO BE HIRED:\n- Be easy to work with (kind)\n- High attention to detail and the ability to prioritize and meet deadlines\n- Fluent in verbal and written English\n- Approach the role with a positive attitude and growth mindset, ready to learn new technology and tools\n- Knowledge of software QA terminology, processes, test planning, estimation, test methodologies\n- Hands on experience with numerous testing approaches: GUI, cross browser, E2E, systems, regression, integration, and across web and mobile\n- Experience with test automation, including Selenium and other web automation tools\n- Ability to collaborate with product management and engineering teams in English to develop and execute a comprehensive set of test scenarios and report on test results\n- Practical experience in designing test cases / scenarios, and finding complex boundary test cases\n- Ability to perform RCA (root cause analysis) of issues to narrow identify problems\n- Knowledge of load/ performance, security testing is an advantage\n- Should have mobile devices (Android, iOS) to test application on different mobile platforms\nREQUIREMENTS:\n- Be friendly\n- Pass a technical QA interview\n- Have sufficient English skills to read documents in English<b>Skills</b>:        Software QA,                     Web Testing,                     Software Testing,                     Manual Testing            ","link":"https://www.upwork.com/jobs/Engineer_%7E016ec0d5967459ca33?source=rss","processedDate":"2024-03-19T08:49:08.958Z","postedDate":"<b>Posted On</b>: March 18, 2024 15:43 UTC","id":"016ec0d5967459ca33"},{"skillset":["Mechanical Engineering","ANSYS","CFD Analysis","Finite Element Analysis","Fluent"],"title":"Ram Pump Simulation Ansys Fluent - Upwork","description":"I&rsquo;m simulating a ram pump using Ansys Fluent and the following steps were done.\n&bull;\tShould be a transient model.\n&bull;\tShould be considered gravity.\n&bull;\tShould be considered the water hammer effect.\n&bull;\tWater should be considered as a compressible liquid.\n&bull;\tAir should be considered as a compressible liquid.\n&bull;\tAll pump material should be assigned as steel.\n&bull;\tPrepared meshing should be done.\n&bull;\tCell zone conditions should be assigned correctly.\n&bull;\tBoundary conditions should be assigned correctly. If boundary conditions/types need to change as per your understanding(technically), explain to me.\n&bull;\tDynamic meshing should be considered.\n&bull;\tPrefer to use 6DOF (actually 1DOF) motion for waste valve stem and delivery valve stem\n&bull;\tThe center of gravity of valve stems should be correctly assigned\n&bull;\tSimulation should be compatible with Ansys fluent 2024 R1 student version\n&bull;\tAll warnings and errors should be addressed and corrected\n\tMost of the above points I have completed, but I couldn&rsquo;t obtain the desired results. An expert is required to do the simulation correctly.\n\tI was unable to find the correct COG coordinates of air chamber and valves. That should be assigned correctly. \n\tI used the cell register option to define that air is already present in the chamber and could be compressed.\n\tMultiphase flow is necessary for the water hammer effect. \n\tBetter to define valve opening &amp;amp; closing due to the water hammer effect, instead of time and sine wave function.\n\tKeep in mind to consider backflow.\nUDFs and video are attached with this. Somebody&rsquo;s support is required to complete the ram pump simulation correctly. I need a screen record showing all the steps to until animation. Valve stems should continuously move up and down due to the water hammer effect.\nEverything should be done within 72 hours (before 20-3-2024 11.30 pm GMT+5:30)\nVideo link https://we.tl/t-ucIRX0xaxR<b>Skills</b>:        Mechanical Engineering,                     ANSYS,                     CFD Analysis,                     Finite Element Analysis,                     Fluent            ","link":"https://www.upwork.com/jobs/Ram-Pump-Simulation-Ansys-Fluent_%7E014013b20ebd2b8b4b?source=rss","processedDate":"2024-03-19T08:49:08.958Z","postedDate":"<b>Posted On</b>: March 18, 2024 09:02 UTC","id":"014013b20ebd2b8b4b"},{"skillset":["Email Communication","Adobe Photoshop","File Management","Adobe Lightroom"],"title":"Virtual Assistant - Real Estate Photo Editing - Upwork","description":"Real Estate Editing Virtual Assistant\nDownloading Files\nPutting logos on pictures via lightroom classic\nRemoving objects\nboundary lines\nexporting in different settings \nUploading files\nEmail communication\nLess than 12 Hr Turnaround<b>Skills</b>:        Email Communication,                     Adobe Photoshop,                     File Management,                     Adobe Lightroom            ","link":"https://www.upwork.com/jobs/Virtual-Assistant-Real-Estate-Photo-Editing_%7E01889e2a3f6d6e9867?source=rss","processedDate":"2024-03-19T08:49:08.958Z","postedDate":"<b>Posted On</b>: March 13, 2024 21:37 UTC","id":"01889e2a3f6d6e9867"},{"skillset":["TypeScript","Three.js","JavaScript","React"],"title":"Need a three JS expert  - Upwork","description":"Need a fix 3 issue like I have to draw the boundary line with the polygon or tringle right now it goes wide and need to fix it \nsecond one it the need to placed there my panels in available boundary using the&nbsp;&nbsp;that boundary almost write the code for both.\nlast one is the need to change the position of placed of the panels using drag Controls in three js. \nplease if someone help in near time with perfect solution I will give him a bonus as well \nThanks<b>Skills</b>:        TypeScript,                     Three.js,                     JavaScript,                     React            ","link":"https://www.upwork.com/jobs/Need-three-expert_%7E014d962f8ba00343d3?source=rss","processedDate":"2024-03-19T08:49:08.958Z","postedDate":"<b>Posted On</b>: March 13, 2024 12:55 UTC","id":"014d962f8ba00343d3"},{"skillset":["Amazon S3","JavaScript","Amazon EC2"],"title":"Issues with Loading files to S3 (through API) that are larger than 200mb - Upwork","description":"I am having issues (just started happening) uploading files to S3 through our JS Api... When we try with file less than 160 Mb - everything works ok... I suspect there is a setting either on the S3 or ec2 or tomcat (we use tomcat) that does this. HAVE YOU seen such type of problem before? - below is request that is being sent to the server \n:authority:\n......\n:method:\nPOST\n:path:\n/video/save-video-attachment?name=&amp;amp;summary=&amp;amp;description=\n:scheme:\nhttps\nAccept:\napplication/json\nAccept-Encoding:\ngzip, deflate, br\nAccept-Language:\nen-US,en;q=0.9\nCache-Control:\nno-cache\nContent-Length:\n205894783\nContent-Type:\nmultipart/form-data; boundary=----WebKitFormBoundaryUe4LjHUlNaOhhyoM\nCookie:\n....\nSec-Ch-Ua:\n&amp;quot;Chromium&amp;quot;;v=&amp;quot;122&amp;quot;, &amp;quot;Not(A:Brand&amp;quot;;v=&amp;quot;24&amp;quot;, &amp;quot;Google Chrome&amp;quot;;v=&amp;quot;122&amp;quot;\nSec-Ch-Ua-Mobile:\n?0\nSec-Ch-Ua-Platform:\n&amp;quot;macOS&amp;quot;\nSec-Fetch-Dest:\nempty\nSec-Fetch-Mode:\ncors\nSec-Fetch-Site:\nsame-origin\nUser-Agent:\nMozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/122.0.0.0 Safari/537.36\nX-Requested-With:\nXMLHttpRequest<b>Skills</b>:        Amazon S3,                     JavaScript,                     Amazon EC2            ","link":"https://www.upwork.com/jobs/Issues-with-Loading-files-through-API-that-are-larger-than-200mb_%7E0132eaf0778826e01f?source=rss","processedDate":"2024-03-19T08:49:08.959Z","postedDate":"<b>Posted On</b>: March 12, 2024 05:08 UTC","id":"0132eaf0778826e01f"},{"skillset":["Microsoft Excel","Steel Detail Drawing","STAAD","Steel Structure","Structural Engineering","Reinforced Concrete Structures","Finite Element Analysis","Tekla Structures","Structural Detailing","Structural Drawing","Wooden Structure","Structural Dynamics","Residential Design"],"title":"Beam problem - Upwork","description":"Issue&#039;s\n1st. : I would like to ask you to add and display diagrams of bending moments\nand transversal force for the beam.\nSolution of moment is fine &hellip;\n2nd. : Calculate the transversal force as well T(x) and display the diagram\nalong the beam\n3rd. :\nThen you have mistake while starting calculating the beam deflection.\nBecause the equation is\nx1e (0,2l)\ny&rsquo;&rsquo;(x1)=-M(x1)/E*Jz\nand x2(0,l/2) y&rsquo;&rsquo;(x2)=-M(x2)/E*Jz\nso if you substitute moment with negative sign the result must be plus then\n4th:\nSo you must correct results of boundary constants because now they are wrong\nbecause you forgot to change signs while substituting the bending moments.\n5th:\nWhile you calculate the deflaction in the point x2=0 y(x2=0)=? where acc the\nsensor is placed. Now you should be express to bendending moment in this point\nif you con express measured q\nq is loading calculated from measured y(x2=0)= &hellip;. express q= ?\nCause you measure by acc the measured magnitude is acceleration acc y&rsquo;&rsquo;(x2=0)\nso in application you must numerically integrate this two times to be able to\ncalculate you y2(x2) the same you calculated analytically from this you can\nthen calculate current q in app according the equation you developed before.\n6th:\nYou must add calculation of dimensioning the cross-section &hellip; this is missing\nto be able to calculate the bending stress, shear stress and eqvivalent stress\nQall=?\n7th:\nIf you know eqvivalent stress the coeficient of safety is k = Re/Qall = ?<b>Skills</b>:        Microsoft Excel,                     Steel Detail Drawing,                     STAAD,                     Steel Structure,                     Structural Engineering,                     Reinforced Concrete Structures,                     Finite Element Analysis,                     Tekla Structures,                     Structural Detailing,                     Structural Drawing,                     Wooden Structure,                     Structural Dynamics,                     Residential Design            ","link":"https://www.upwork.com/jobs/Beam-problem_%7E017b103b4875d8b0e1?source=rss","processedDate":"2024-03-19T08:49:08.959Z","postedDate":"<b>Posted On</b>: March 11, 2024 15:39 UTC","id":"017b103b4875d8b0e1"},{"skillset":["MATLAB","Differential Calculus","LaTeX","Mathematical Modeling","MATLAB Script","Calculus","Equations"],"title":"Mathematics  - Upwork","description":"Job Title: Numerical Methods Freelancer for PDE Solution\nDescription:\nWe are seeking a skilled freelancer with expertise in numerical methods and scientific computing to solve a partial differential equation (PDE) using explicit Euler and central differencing schemes. The task involves implementing the numerical solution in a programming language such as Python, MATLAB, or Julia. The freelancer should have a strong mathematical background, proficiency in programming, and the ability to effectively communicate results.\nKey Responsibilities:\n- Implement numerical methods for solving the advection-diffusion equation.\n- Apply the Explicit Euler scheme for the time-dependent term.\n- Utilize a 2nd order accurate central differencing scheme for space-dependent terms.\n- Address initial and boundary conditions effectively.\n- Ensure code efficiency, accuracy, and reliability.\nSkills and Qualifications:\n- Proficiency in Python, MATLAB\n- Strong mathematical background, particularly in calculus, differential equations, and linear algebra.\n- Experience in numerical methods and scientific computing.\n- Effective problem-solving skills.\n- Excellent communication skills for discussing methodology and presenting results.<b>Skills</b>:        MATLAB,                     Differential Calculus,                     LaTeX,                     Mathematical Modeling,                     MATLAB Script,                     Calculus,                     Equations            ","link":"https://www.upwork.com/jobs/Mathematics_%7E01c3973dddc74088e5?source=rss","processedDate":"2024-03-19T08:49:08.959Z","postedDate":"<b>Posted On</b>: March 10, 2024 18:22 UTC","id":"01c3973dddc74088e5"},{"skillset":["Autodesk AutoCAD","Drafting","AutoCAD Civil 3D","CAD Drafting","2D Design &amp; Drawings","CAD"],"title":"Land Survey Drafting - Ongoing Projects (Carlson/AutoCAD/Civil3D)  - Upwork","description":"We are a mid sized surveying firm in North Texas. Seeking survey technician/drafting help. Also need help with all other survey activities such as calculations, conceptual planning, boundary and title surveys, topographic surveys, LiDAR/SLAM data processing &amp;amp; post processing, photogrammetry, platting, infrastructure projects, and more. \nWe have 15+ jobs due this week and our goal is to make sure none of them are late. \nI will provide you with a recently completed drawing/autocad file with all necessary templates and blocks, CTB files, and all project information. \nOnce you have proved yourself and can mandate a designated amount of time per week to us, we will get you an email account setup and get you on the company platforms for sharing data. \nPlease reach out ASAP as I need to begin work immediately. Possible to hire multiple people. Please provide resume and/or brief description of work, examples of land surveying, topographic, and any other exhibits or work you would like to show. \nAlso please be good at communicating, good at following directions, and well organized. \nThank you and good luck! <b>Skills</b>:        Autodesk AutoCAD,                     Drafting,                     AutoCAD Civil 3D,                     CAD Drafting,                     2D Design &amp; Drawings,                     CAD            ","link":"https://www.upwork.com/jobs/Land-Survey-Drafting-Ongoing-Projects-Carlson-AutoCAD-Civil3D_%7E01187c826cbf8c2c54?source=rss","processedDate":"2024-03-19T08:49:08.959Z","postedDate":"<b>Posted On</b>: March 08, 2024 22:29 UTC","id":"01187c826cbf8c2c54"},{"skillset":["Autodesk AutoCAD","Civil Engineering","Structural Engineering","Engineering Design","Building Design","Site Planning","Stormwater Management","Drainage","Water Distribution Modelling Software"],"title":"Civil Design and Engineering for 3.5MW Solar Farm - Upwork","description":"I am working on a project that requires some civil engineering services for a client developing a 3.5mw solar farm, and as part of the scope of work we need to provide the following services:\n - Civil Design: Civil Pad, Stormwater, Fencing and key civil infrastructure creating a hard stand/ cut and fill as required to enable a suitable site for the ground mount array and their continued long-term maintenance and vehicle access roads/ tracks as required (similar to attached example drawing pack)\n- Drainage and Flood Study. (Flood maps available from 2019)\n- Civil Construction Brief for tendering purposes\n- Complete site fencing (chain-link 1.8 etc to airside fence design requirements)\n- topography survey and geotechnical investigations will be made available\n-Small concrete block on concrete foundation storage building with a garage type roller door. \n- attached KML file showing size of site boundary. \nPlease provide a quote for the above design services along with what input information would be required and a approximate duration. <b>Skills</b>:        Autodesk AutoCAD,                     Civil Engineering,                     Structural Engineering,                     Engineering Design,                     Building Design,                     Site Planning,                     Stormwater Management,                     Drainage,                     Water Distribution Modelling Software            ","link":"https://www.upwork.com/jobs/Civil-Design-and-Engineering-for-5MW-Solar-Farm_%7E0187b5b75e7af96cc0?source=rss","processedDate":"2024-03-19T08:49:08.959Z","postedDate":"<b>Posted On</b>: March 05, 2024 23:45 UTC","id":"0187b5b75e7af96cc0"},{"skillset":["JavaScript","Three.js","Web Development","CSS"],"title":"Three.js based 360° Virtual Tour Template - Upwork","description":"I am looking for three.js expert to create a 360&deg; virtual tour template based three.js with using of depthmap (invisible low-poly 3d model for 3d transition effect). \nI am currently using KRPano engine for my 360&deg; virtual tours, but I am noy happy with its performance and limitations, so I decided to switch to three.js. \nThe template should include following functions:\n- day/night toggle mode\n- preload option (for example, depthmal 3d model, sounds, first panorama cubes can be in the list for preload betore tour starts)\n- manual and auto-resolution mode for better and optimized user experinece (switch manually or automatically between different versions of panoramas (2K, 4K or 8K panorama lengh size)\n- dollhouse mode (option to switch from panorama to 3d model, for example, 3d floor plan)\n- infoscreen (project description and clickable links)\nAdditional functions can be added in future.\nGood examples of using three.js for 360 tours: \nhttps://rendertovr.com/player/?maindemo\nhttps://iconic-house.the-boundary.digital/\nPlease, feel free to contact me for any question about job.\nSincerely,\nDmytro<b>Skills</b>:        JavaScript,                     Three.js,                     Web Development,                     CSS            ","link":"https://www.upwork.com/jobs/Three-based-360-Virtual-Tour-Template_%7E018cc69c3ee8ac2e83?source=rss","processedDate":"2024-03-19T08:49:08.959Z","postedDate":"<b>Posted On</b>: March 04, 2024 16:34 UTC","id":"018cc69c3ee8ac2e83"},{"skillset":["English","Document Analysis"],"title":"Document review for key information  - Upwork","description":"I need all documents reviewed comprehensively to find key information regarding our house boundaries, the front garden and our boundary being moved by key personnel. Any communications that reference the front boundary being moved and then them trying to cover this up \nThey had meant to move our boundary but now trying to cover up and says the head of the development did so incorrectly.\nDocument password is CV82LR\nWill share all documents via we transfer <b>Skills</b>:        English,                     Document Analysis            ","link":"https://www.upwork.com/jobs/Document-review-for-key-information_%7E0196dd1f374f8ef656?source=rss","processedDate":"2024-03-19T08:49:08.959Z","postedDate":"<b>Posted On</b>: February 27, 2024 15:20 UTC","id":"0196dd1f374f8ef656"},{"skillset":["Zoho Creator","Zoho CRM"],"title":"Zoho Custom Quoting Tool and Automation - Upwork","description":"The outome we seek is a fully automated Scheduled job, that has been pre paid.\nHi my name is Anton and I am the owner of a service business in Land Surveying. You may visit our website at www.pssgroup.com.au \nWe sell Boundary Surveys and Feature Surveys, on Vacant Land or Land with Exisiting Buildings, categorised into 0-1000m2, 1001-2000m2 and +2001m2 plots. See the Free quote zoho landing page on our website for an example. https://pssgroup.com.au/licensed-surveying-quotes/\nIt is a very simple pricing structure.\nCurrently our marketing drives customers to a Zoho Landing page that collects Contact information and the service requirments and creates a Lead In Zoho CRM. We are manually creating the quote in different software called Fergus and sending it to the client but using ZOHO CRM to follow up with the client by phone and email.\nPlease research https://fergus.com/ to understand why we sue this software. If it is possible to API connect then this would be great. However we are totally open to dropping this software for a solution that runs autonomously on the Zoho One Platform.\nWe also use https://www.xero.com/au/ for our accounting and book keeping. Zoho must integrate with this software seamlessly.\nThe outome we seek is a fully automated Scheduled job, that has been pre paid.\nThe statement above means, a customer clicks our advert and is redirected to our landing page, completes the form and submits their request. A quote is automatically generated in Zoho and sent to the customer. The quote includes a custom accept and custom decline button. The custom accept button displays our scheduling calendar so they can choose a date for the survey, when the date is selected it then takes them to a payment gateway that is connectd to our Xero Accounting software and payment is taken. A confirmation email of the scheduled survey is then sent to the customer including a the payment receipt. The surveyor is notified by text message to call the customer within 10 minutes of a scheduled job.\nThe process will create Leads in Zoho CRM and automatically move it through the sales process until it becomes a won or lost job.\nThere will be variations to the perfect world automation detailed above. These &amp;quot;if then else&amp;quot; requirements will always result in the same outome, a message sent to our sales person to call the customer immediately. \nOther nice to have may include verification of an email address before sending the quote but not necessary. A simple automation of the manual process is what we really need. \nTo be successful we will require at least one example you have delivered a similar job for one of your paying clients. I would like to test the system they have imlemented and ask them how they would improve it. \nI look forward to your response.\nCheers Anton\nPS our ultimate outcome is to create A two-sided marketplace for surveying. We would welcome your thoughts on this as a separate project.<b>Skills</b>:        Zoho Creator,                     Zoho CRM            ","link":"https://www.upwork.com/jobs/Zoho-Custom-Quoting-Tool-and-Automation_%7E017371fb1d593d46c3?source=rss","processedDate":"2024-03-19T08:49:08.959Z","postedDate":"<b>Posted On</b>: February 26, 2024 23:19 UTC","id":"017371fb1d593d46c3"},{"skillset":["Construction","Architectural Design","Site Planning","Business Plan","Project Management","Construction Management"],"title":"Construction and environmental management plan needed  - Upwork","description":"looking for someone who can create a construction and environmental management plan and has experience doing so in the UK. This is to clear conditions imposed by planning (see below)\nIdeal candidate will provide fixed price for this service. \nNo development shall commence on site (including demolition) until such time as a Construction and Environmental Management Plan has been submitted to and approved in writing by the local planning authority.&nbsp;&nbsp;As a minimum the plan shall cover: \n(a) Dust mitigation and management measures.\n(b) The location and operation of plant and wheel washing facilities\n(c) Measure to reduce demolition and construction noise \n(d) Details of construction traffic movements including cumulative impacts which shall demonstrate the following:-\n(i) Rationalise travel and traffic routes to and from the site as well as within the site.\n(ii) Provide full details of the number and time of construction vehicle trips to the site with the intention and aim of reducing the impact of construction related activity.\n(iii) Measures to deal with safe pedestrian movement.\n(iv) Full contact details of the site and project manager responsible for day-to-day management of the works \n(v) Parking for&nbsp;&nbsp;operatives during construction period\n(vi) A swept path drawings for any tight manoeuvres on vehicle routes to and from the site including proposed access and egress arrangements at the site boundary.\n(e)&nbsp;&nbsp;Hours of operation\n(f)&nbsp;&nbsp;&nbsp;Other site specific Highways and Environmental Protection issues as requested on a case by case basis \n(g) The development shall be undertaken in full accordance with the details approved under Parts a-f <b>Skills</b>:        Construction,                     Architectural Design,                     Site Planning,                     Business Plan,                     Project Management,                     Construction Management            ","link":"https://www.upwork.com/jobs/Construction-and-environmental-management-plan-needed_%7E016958efc8e40b4267?source=rss","processedDate":"2024-03-19T08:49:08.959Z","postedDate":"<b>Posted On</b>: February 23, 2024 17:30 UTC","id":"016958efc8e40b4267"},{"skillset":["User Interface Design","User Experience Design","Prototyping","Wireframing","Website Content","Web Design","Interaction Design","User Flow","Art Direction","Creative Direction"],"title":"Talented and extremely details oriented  UI/UX website Designer / Art Director  - Upwork","description":"Parcks is a Brighton, UK based company that develops advanced consumer electronics products to build a complete&nbsp;&nbsp;and unified services ecosystem for everyone. Our mission is to give access to everyone to an easier and safer alternative for daily basis mobile and computing technology. To make life easier and simple for things that people do every day, all the time.\nA job at Parcks is more than a position. Because we like to think in a completely different way and to turn upside down all conceptions you could have about what it means to work for a company in the 21th century. At Parcks, a great product is before anything else a unique and unforgettable sensorial experience. We do not just design beautiful products, we deliver a dream coming true with simple tools that work for people who need it. An artificial boundary has been established between Art and Science. The narrow minded way of thinking is preventing us to really comprehend what it takes to design the perfect interaction between humans and technology. We like to redefine the world as we know it, to break the rules, to stand out from thr crowd and the common thinking. A love for exception, a cult for non conformism, to challenge all your senses, a passion for the smallest but so significant details. Because we are certain that technology designed in the best way makes the world better for every single human being. Because Parcks is a community of artists, engineers, designers, supporters, dreamers and thinkers of all kind, all bonded by one thing in common : Passion.\nIt becomes more than a job, a meaning, a way of thinking, a purpose.\nWe are looking for a very talented UI/UX Designer to work on a long term project. This mission is just the first step of a much wider project.\nSCOPE OF THE PROJECT :\nYou will be the head of Parcks website design and will work along development team in charge to integrate the designs.\nREQUIREMENTS :\nWe have very high standards and expectations in term of quality and minimalism design. We are looking for a creative mind, an outside the box thinker and absolutely detailed oriented. Who has a vocation with accurate colour management and who is in love with minimalist, soft, simple and clean interfaces. \nSomeone able to really fit and converge with the spirit of this company and the products. Someone with a great instinct and sense of aesthetics and who really understand what we need to achieve.\nSo small disclaimer, this is not a job for designers who are just making mainstream designs found all over the net on Wordpress websites with random typefaces and no space management.\nIf there is a real artist out there, do not search anymore, you have found home !\nThank you very much for taking the time to read our job offer. \nBe safe.\nKind regards \nParcks team<b>Skills</b>:        User Interface Design,                     User Experience Design,                     Prototyping,                     Wireframing,                     Website Content,                     Web Design,                     Interaction Design,                     User Flow,                     Art Direction,                     Creative Direction            ","link":"https://www.upwork.com/jobs/Talented-and-extremely-details-oriented-website-Designer-Art-Director_%7E01230eb679f8b1c7d6?source=rss","processedDate":"2024-03-19T08:49:08.960Z","postedDate":"<b>Posted On</b>: February 22, 2024 17:26 UTC","id":"01230eb679f8b1c7d6"},{"skillset":["User Interface Design","User Experience Design","Prototyping","Wireframing","Website Content","Web Design","Interaction Design","User Flow","Art Direction","Creative Direction"],"title":"Talented and extremely details oriented  UI/UX website Designer / Art Director  - Upwork","description":"Parcks is a Brighton, UK based company that develops advanced consumer electronics products to build a complete&nbsp;&nbsp;and unified services ecosystem for everyone. Our mission is to give access to everyone to an easier and safer alternative for daily basis mobile and computing technology. To make life easier and simple for things that people do every day, all the time.\nA job at Parcks is more than a position. Because we like to think in a completely different way and to turn upside down all conceptions you could have about what it means to work for a company in the 21th century. At Parcks, a great product is before anything else a unique and unforgettable sensorial experience. We do not just design beautiful products, we deliver a dream coming true with simple tools that work for people who need it. An artificial boundary has been established between Art and Science. The narrow minded way of thinking is preventing us to really comprehend what it takes to design the perfect interaction between humans and technology. We like to redefine the world as we know it, to break the rules, to stand out from thr crowd and the common thinking. A love for exception, a cult for non conformism, to challenge all your senses, a passion for the smallest but so significant details. Because we are certain that technology designed in the best way makes the world better for every single human being. Because Parcks is a community of artists, engineers, designers, supporters, dreamers and thinkers of all kind, all bonded by one thing in common : Passion.\nIt becomes more than a job, a meaning, a way of thinking, a purpose.\nWe are looking for a very talented UI/UX Designer to work on a long term project. This mission is just the first step of a much wider project.\nSCOPE OF THE PROJECT :\nYou will be the head of Parcks website design and will work along development team in charge to integrate the designs.\nREQUIREMENTS :\nWe have very high standards and expectations in term of quality and minimalism design. We are looking for a creative mind, an outside the box thinker and absolutely detailed oriented. Who has a vocation with accurate colour management and who is in love with minimalist, soft, simple and clean interfaces. \nSomeone able to really fit and converge with the spirit of this company and the products. Someone with a great instinct and sense of aesthetics and who really understand what we need to achieve.\nSo small disclaimer, this is not a job for designers who are just making mainstream designs found all over the net on Wordpress websites with random typefaces and no space management.\nIf there is a real artist out there, do not search anymore, you have found home !\nThank you very much for taking the time to read our job offer. \nBe safe.\nKind regards \nParcks team<b>Skills</b>:        User Interface Design,                     User Experience Design,                     Prototyping,                     Wireframing,                     Website Content,                     Web Design,                     Interaction Design,                     User Flow,                     Art Direction,                     Creative Direction            ","link":"https://www.upwork.com/jobs/Talented-and-extremely-details-oriented-website-Designer-Art-Director_%7E017c25ff60038f6576?source=rss","processedDate":"2024-03-19T08:49:08.960Z","postedDate":"<b>Posted On</b>: February 22, 2024 17:25 UTC","id":"017c25ff60038f6576"},{"skillset":["JavaScript","React","Mapbox"],"title":"Experienced Mapbox Developer Wanted: Proficiency in React.js a Plus! - Upwork","description":"\nWe are seeking a skilled Mapbox developer with expertise in working with polygons to join our team. The ideal candidate will have hands-on experience in Mapbox development, particularly in implementing and managing polygon boundaries on buildings, editing boundaries, and implementing actions based on boundary interactions.\nResponsibilities:\nImplement and manage polygon boundaries on buildings using Mapbox technology.\nDevelop features for editing polygon boundaries with precision and ease of use.\nImplement actions and functionalities based on interactions with polygon boundaries.\nEnsure frequent updates and smooth performance of the map interface.\nRequirements:\nProficiency in Mapbox development, with a focus on polygon-related functionalities.\nExperience in React.js and its integration with Mapbox for front-end development.\nStrong understanding of spatial data and GIS concepts.\nAbility to optimize performance for smooth user experience.\nNice to Have:\nExperience with other mapping libraries or technologies.\nFamiliarity with agile development methodologies.\nStrong problem-solving skills and attention to detail.\nIf you are a Mapbox developer passionate about creating high-performance mapping solutions and are eager to work on challenging projects with a dynamic team, we encourage you to apply.\nApplication Instructions: [Specify how candidates should apply, such as sending resumes to an email address or applying through a job portal]\nFeel free to adjust the details and requirements as needed to align with your specific needs and preferences.<b>Skills</b>:        JavaScript,                     React,                     Mapbox            ","link":"https://www.upwork.com/jobs/Experienced-Mapbox-Developer-Wanted-Proficiency-React-Plus_%7E01df125f0c91ae7361?source=rss","processedDate":"2024-03-19T08:49:08.960Z","postedDate":"<b>Posted On</b>: February 22, 2024 14:19 UTC","id":"01df125f0c91ae7361"},{"skillset":["Autodesk AutoCAD","Autodesk Revit","Drafting"],"title":"CAD/Revit to create siting of Standard Plans on New House Lots - Upwork","description":"We have several standard house plans that we need re-created digitally in CAD or Revit. This way whenever we want to site a home on a lot the process will be easier (so there is a bit of work up front to create each design, and then sitings ongoing work). For each lot, we will have a plan of development (POD) that instructs how the home must be sited (i.e. Left/Right configuration, build-to-boundary, setbacks, etc). <b>Skills</b>:        Autodesk AutoCAD,                     Autodesk Revit,                     Drafting            ","link":"https://www.upwork.com/jobs/CAD-Revit-create-siting-Standard-Plans-New-House-Lots_%7E012622e5e8f40e6a7d?source=rss","processedDate":"2024-03-19T08:49:08.960Z","postedDate":"<b>Posted On</b>: February 22, 2024 00:08 UTC","id":"012622e5e8f40e6a7d"},{"skillset":["C++","Geometry","Applied Mathematics","C#","API"],"title":"Developing C++ API to Integrate External Advanced Geometric and Topological Analysis Capabilities - Upwork","description":"Overview:\nAdditive Flow, a Nano Dimension Division seeks a forward-thinking developer specialist in Structural Topologic Analysis and Advanced Geometry Modelling. The candidate will be responsible for enhancing our current design capabilities by integrating our existing framework with a third-party market leader tool. This role involves a project that requires a deep understanding of dotNet and C++ programming languages. The data involves 3D CAD geometry information, material databases, and boundary condition representation. \nProject:\nThe project scope is segmented into two main subjects:\n1)\tNew File Format: The first phase of the project is focused on enhancing current software capabilities by introducing the ability to import a new file format. This will be achieved by integrating and invoking an external C++ library. The goal is to convert these files into a set of triangles and vertices, forming an internal structure within the software infrastructure.\n2)\tTopological Analysis Extension: The second segment focuses building specific APIs to connect with external third-party topological analysis tool. This algorithm will be invoked within the software through an external C++ interface, and it will generate an optimal set of triangles and vertices which will be converted into the existing internal software infrastructure. \nInputs:\nDuring the project, the following resources will be provided:\n1)\tAccess to current software purely for conducting tests.\n2)\tAccess to the external Topological Analysis and Advanced Geometry Modelling tools.\nDeliverables:\nAt the conclusion of the project, the following deliverables are expected:\n1)\tValidated and tested APIs.\n2)\tDocumentation.\nDuties and Responsibilities:\n&bull;\tResponsible for integrating and invoking an external C++ library to convert files into existing Additive Flow framework.\n&bull;\tLeverage an external C++ interface to call functions to generate an optimal set of triangles and vertices.\n&bull;\tRegularly test the software to ensure its functionality and efficiency.\n&bull;\tConnect the provided external tool for Topological Analysis and Implicit Geometry Modelling to enhance the capabilities of the current software.\n&bull;\tContinually seek opportunities to improve the current software by identifying potential enhancements and integrating new technologies as appropriate.\nQualification: \n&bull;\tBachelor&rsquo;s degree in computer science, Engineering, Applied Mathematics, or related field.\n&bull;\tDemonstrable experience with CAD or FEA software development.\nMust-Have Skills: \n&bull;\tProficiency in C++ and C# programming and software development.\n&bull;\tSolid understanding of CAD functions and mesh generation.\n&bull;\tExperience with computational geometry and numerical methods.\n&bull;\tAbility to write maintainable, efficient code.\n&bull;\tStrong analytical and problem-solving skills.\n&bull;\tGood understanding of structural topologic analysis.\nNice-to-Have Skills: \n&bull;\tAdvanced degree in Computer Science, Engineering, Applied Mathematics, or related field.\n&bull;\tKnowledge of CAD modelling and CAE simulation software.\n&bull;\tExperience with high-performance computing (GPGPU).\n&bull;\tFamiliarity with software development best practices.\n&bull;\tExcellent teamwork and communication skills.\n&bull;\tDemonstrable experience building C++ or C# APIs.\nCompany Culture: \nAdditive Flow is all about making innovative software in a way that&#039;s good for the world. We value fresh ideas, taking care of the planet, being honest, focusing on our customers, doing our best, working together, helping each other grow, and welcoming different viewpoints. We&#039;re on a mission to make technology that doesn&#039;t just make money but also makes the world a better place.<b>Skills</b>:        C++,                     Geometry,                     Applied Mathematics,                     C#,                     API            ","link":"https://www.upwork.com/jobs/Developing-API-Integrate-External-Advanced-Geometric-and-Topological-Analysis-Capabilities_%7E01845f57340e0cdb86?source=rss","processedDate":"2024-03-19T08:49:08.960Z","postedDate":"<b>Posted On</b>: February 21, 2024 13:58 UTC","id":"01845f57340e0cdb86"},{"skillset":["Real Estate","Autodesk AutoCAD","Drafting","Construction","2D Design"],"title":"CAD Specialist for Condo Project Conversion and Design - Upwork","description":"CAD Specialist for Condo Project Conversion and Design\nOverview\nWe are seeking a skilled CAD Specialist to join our project team on a freelance basis. The primary task will be to convert existing scale PDF documents of a condo project into CAD format. Following the conversion, the specialist will be responsible for delineating condo property boundaries, defining common areas, and establishing rights of way to an adjacent business. An existing condo project will serve as a reference point for the development of the current project.\nResponsibilities\n- Convert detailed PDF documents of a condo project to CAD with high accuracy and attention to detail.\n- Create clear delineations of condo property boundaries within the CAD model.\n- Define common areas and specific rights of way to adjacent businesses in accordance with project requirements.\n- Use an adjacent condo project as a reference to ensure consistency and coherence in design and planning.\n- Collaborate with project managers and stakeholders to review and adjust CAD drawings as necessary.\n- Provide detailed documentation and reports on design specifications and adjustments made during the project lifecycle.\nQualifications\n- Proven experience in CAD design and drafting, specifically with projects related to real estate, architecture, or civil engineering.\n- Strong proficiency in CAD software (AutoCAD, Revit, or similar).\n- Ability to interpret and convert PDF documents into detailed CAD drawings.\n- Knowledge of real estate development, zoning laws, and property boundary definitions.\n- Excellent communication skills, with the ability to work collaboratively with a remote team.\n- Attention to detail and a strong commitment to accuracy and precision in design.\n- Portfolio of previous work that demonstrates experience relevant to this project.\nProject Details\n- Duration: Project completed within 30 days\n- Location: Remote.\n- Compensation: Competitive, based on experience. Please include your rate expectations in your application.\n-Start Date:** As soon as possible.\nApplication Process\nInterested candidates are invited to submit the following materials for consideration:\n- Resume/CV\n- Cover letter outlining your experience relevant to this project\n- Portfolio of relevant previous work\n- Rate expectations\nWe thank all applicants for their interest, however, only those selected for an interview will be contacted.<b>Skills</b>:        Real Estate,                     Autodesk AutoCAD,                     Drafting,                     Construction,                     2D Design            ","link":"https://www.upwork.com/jobs/CAD-Specialist-for-Condo-Project-Conversion-and-Design_%7E012be528b991ad3f75?source=rss","processedDate":"2024-03-19T08:49:08.960Z","postedDate":"<b>Posted On</b>: February 21, 2024 12:14 UTC","id":"012be528b991ad3f75"},{"skillset":["3D Modeling","Interior Design","3D Rendering","Autodesk AutoCAD","SketchUp","Autodesk Revit","Municipal Architecture","CAD Drafting","2D Design","Residential Design","CAD","3D Drawing","Architectural Design"],"title":"Master layout plan  - Upwork","description":"Hi \nA master layout plan for 3 acres land which comprises 12 farmhouse plots of each 2 kanals.\nWith internal road of 22&rsquo; .\nTrees on each farmhouse boundary \nA 3D farmhouse / kitchen garden/ Car park / main gate for one plot as sample , but another 11 plain as it is with grass etc. \nAnd approach road of 11&rsquo; connecting to these 3 acres and main road of 16&rsquo; . \nAny clarification pl ask freely , and charges . <b>Skills</b>:        3D Modeling,                     Interior Design,                     3D Rendering,                     Autodesk AutoCAD,                     SketchUp,                     Autodesk Revit,                     Municipal Architecture,                     CAD Drafting,                     2D Design,                     Residential Design,                     CAD,                     3D Drawing,                     Architectural Design            ","link":"https://www.upwork.com/jobs/Master-layout-plan_%7E01f9ab796379813f4f?source=rss","processedDate":"2024-03-19T08:49:08.960Z","postedDate":"<b>Posted On</b>: February 20, 2024 19:44 UTC","id":"01f9ab796379813f4f"},{"skillset":["CFD Analysis","Computational Fluid Dynamics","ANSYS"],"title":"Ansys Fluent simulation of Natural ventilation of building - Upwork","description":"I have building drawing available in revit . you have to import geometry into ansys fluent,&nbsp;&nbsp;do meshing required apply boundary conditions etc and do simulations. and also help me learn these things only<b>Skills</b>:        CFD Analysis,                     Computational Fluid Dynamics,                     ANSYS            ","link":"https://www.upwork.com/jobs/Ansys-Fluent-simulation-Natural-ventilation-building_%7E01f838d55e290d4446?source=rss","processedDate":"2024-03-19T08:49:08.960Z","postedDate":"<b>Posted On</b>: February 20, 2024 15:05 UTC","id":"01f838d55e290d4446"},{"skillset":["Mechanical Engineering","Robotics","Robot Operating System"],"title":"Advanced Robotic Lawn Mower Development - Upwork","description":"I&#039;m in need of skilled experts to construct a highly functional automated robotic mower optimized for handling a large area (5,000+ sq ft).\nKey Features:\n- Ability to schedule mowing sessions\n- Wire free boundary\n- Remote operation through a smartphone app\n- Obstacle detection and avoidance\n- Ability to mow structured lines and patterns\n- All-Wheel Drive and slope handling capabilities\n- Rigid design that can endure challenging Australian weather and climate\n- Waterproof design\n- Robust engineering to guarantee a clean cut\nProficiencies required:\n- Robotic Automation\n- App Development\n- Mechanical Engineering\n- Industrial Design\n- Knowledge of extreme weather conditions and ground slopes\nExperience with similar projects, specifically robotic lawn mowers, will be greatly appreciated.<b>Skills</b>:        Mechanical Engineering,                     Robotics,                     Robot Operating System            ","link":"https://www.upwork.com/jobs/Advanced-Robotic-Lawn-Mower-Development_%7E013ac3db0278c02795?source=rss","processedDate":"2024-03-19T08:49:08.960Z","postedDate":"<b>Posted On</b>: February 19, 2024 13:23 UTC","id":"013ac3db0278c02795"},{"skillset":["3D Modeling","3D Design","Finite Element Analysis","CAE","CATIA","Freecad","ANSYS","Mechanical Design","Mechanical Engineering","Engineering Design","Industrial &amp; Product Design Consultation","Product Design","CAD","Finite Element Modeling","Structural Analysis"],"title":"Simulation study of thermal seal of various parameters for industrial packaging application - Upwork","description":"I want to learn about how to apply the boundary condition and also about the convergence.\nAlso, need the guidance on my research purpose on the actual and simulation.<b>Skills</b>:        3D Modeling,                     3D Design,                     Finite Element Analysis,                     CAE,                     CATIA,                     Freecad,                     ANSYS,                     Mechanical Design,                     Mechanical Engineering,                     Engineering Design,                     Industrial &amp; Product Design Consultation,                     Product Design,                     CAD,                     Finite Element Modeling,                     Structural Analysis            ","link":"https://www.upwork.com/jobs/Simulation-study-thermal-seal-various-parameters-for-industrial-packaging-application_%7E016153e2793bee09f7?source=rss","processedDate":"2024-03-19T08:49:08.960Z","postedDate":"<b>Posted On</b>: February 15, 2024 01:56 UTC","id":"016153e2793bee09f7"},{"skillset":["Autodesk Revit","Building Information Modeling","Architectural Design","Architectural Rendering","Drafting","3D Rendering","3D Drawing","Floor Plan Design","3D Modeling"],"title":"Revit Specialist Wanted: Expertise in 3D Modeling, Structural Detailing, and Rendering. - Upwork","description":"I have pdf contains 2d drawing \n1. 3D Architectural Modeling of Ground floor and First Floor in revit only(.rvt file)\n2. Structural Detailing of drawings in revit only (.rvt file)\n3. [Beautification / Detailing] Boundary wall, Lawns, Surrounding Roads/Society Look, etc in&nbsp;&nbsp;Twinmotion only (Image format)/.png or .jpg\n4. Rendering + Detailed Animated Video of 60 &ndash; 90 seconds&nbsp;&nbsp;IN Twinmotion only (MP4)<b>Skills</b>:        Autodesk Revit,                     Building Information Modeling,                     Architectural Design,                     Architectural Rendering,                     Drafting,                     3D Rendering,                     3D Drawing,                     Floor Plan Design,                     3D Modeling            ","link":"https://www.upwork.com/jobs/Revit-Specialist-Wanted-Expertise-Modeling-Structural-Detailing-and-Rendering_%7E01d102030e9bd18e35?source=rss","processedDate":"2024-03-19T08:49:08.960Z","postedDate":"<b>Posted On</b>: February 13, 2024 11:36 UTC","id":"01d102030e9bd18e35"},{"skillset":["Mechanical Engineering","3D Modeling","Abaqus","Simulation Software"],"title":"Looking for help with recreating an Abaqus fatigue setup - Upwork","description":"I am attempting to reproduce a high cycle fatigue study in Abaqus on a two component system (geometry provided) with well defined load conditions, material properties, and documented results. I have the initial setup prepared in Abaqus/CAE 2022 and am looking for guidance on setting up surface constraints and loads to properly establish the same boundary conditions as shown in the report. This can either be accomplished through 1-on-1 help using a program like TeamViewer, or I can provide additional setup details as needed for you to recreate the problem on your own machine. If you prefer sticking to your own workflow, I would just request a summary of the settings used or access to the .cae file itself. Lastly, I do not need you to use your own machine to run the study once set up (as it could be resource intensive). I would just ask for confirmation that the job is set up correctly.\nSee the following URL for reference on the fatigue test (Section 3, Figs 3 and 4): \nhttps://www.sciencedirect.com/science/article/pii/S2214860420306023\nExpectations:\n* Interprete forces based on information provided in the literature. Advise on correct vectors/amplitudes for the cyclic load as well as the steady tensile load. This paper uses several LCF/HCF magnitudes; feel free to work one case.\n* Advise on setup of component interactions. This problem involves a bearing with given friction coefficient that acts upon a housing. \n* Educate on setting up load steps for this fatigue problem. \n* Assistance with properly applying material properties (defined in provided literature) without access to a library would be useful.\n* If you have experience with producing point maps through Abaqus FEA results, I am looking for advising on exporting location-based stress values from the job result.\nHappy to provide more details/context and additional model files once we connect.\nThanks!\nEric<b>Skills</b>:        Mechanical Engineering,                     3D Modeling,                     Abaqus,                     Simulation Software            ","link":"https://www.upwork.com/jobs/Looking-for-help-with-recreating-Abaqus-fatigue-setup_%7E01cfcb537063ddf0df?source=rss","processedDate":"2024-03-19T08:49:08.960Z","postedDate":"<b>Posted On</b>: January 30, 2024 19:36 UTC","id":"01cfcb537063ddf0df"},{"skillset":["Teaching","Computer Science","Numerical Analysis","NumPy","SciPy","Academic Writing","Mathematics"],"title":"Expert Tutor Needed for Numerical Methods Course - Ongoing Homework Assistance - Upwork","description":"We are seeking a highly skilled and knowledgeable tutor to provide ongoing homework assistance for a comprehensive Numerical Methods course. The ideal candidate should possess a strong foundation in mathematics and computer science, with expertise in various numerical methods and their applications.\nCourse Contents:\nFloating Point Arithmetic: In-depth understanding of correctly rounded arithmetic, rounding error, cancellation error, and condition number.\nSequences and Series: Techniques for accelerating convergence and knowledge of asymptotic series.\nNumerical Linear Algebra: Proficiency in least squares, the Gram-Schmidt procedure, singular value decomposition, and eigenvalue algorithms.\nNonlinear Optimization: Experience with rootfinding, bisection, Newton&rsquo;s method, the continuation method, and simplex methods.\nFourier Analysis and Signal Processing: Familiarity with the fast Fourier transform, Nyquist frequency, bells, and Gibbs phenomenon.\nQuadrature: Knowledge of Gaussian quadrature, adaptive integration, Euler-Maclaurin formula, and Newton-Cotes formulas.\nFunction Approximation and Interpolation: Understanding of Lagrange interpolation, Weierstrass theorem, best approximating polynomial, Chebyshev approximation, and the Runge phenomenon.\nSearching and Sorting: Skills in quicksort, quadtrees and octrees, and an understanding of the curse of dimensionality.\nProbability and Random Numbers: Proficiency in random number generators, randomness tests, Monte Carlo methods, and bootstrap.\nDifferential Equations: Experience with finite differences, initial value problems, boundary value problems, Euler&rsquo;s method, Richardson extrapolation, and the finite element method.\nResponsibilities:\nProvide detailed and clear explanations of complex numerical methods concepts.\nAssist with homework and assignments, ensuring a thorough understanding of the material.\nOffer guidance on best practices and problem-solving techniques in numerical methods.\nBe available for regular online sessions to discuss course content and assignments.\nRequirements:\nAdvanced degree in Mathematics, Computer Science, or a related field.\nProven experience in teaching or tutoring numerical methods at a high level.\nExcellent communication skills and ability to explain complex concepts clearly.\nAvailability to meet online for discussions and tutoring sessions.\nAdditional Information:\nThe first meeting is scheduled for January 25, 2024, at 9 PM EST.\nCourse notes and homework materials will be provided after the agreement.\nA total of 5 such sessions shall be conducted, please check the attached files for more information on the course content.<b>Skills</b>:        Teaching,                     Computer Science,                     Numerical Analysis,                     NumPy,                     SciPy,                     Academic Writing,                     Mathematics            ","link":"https://www.upwork.com/jobs/Expert-Tutor-Needed-for-Numerical-Methods-Course-Ongoing-Homework-Assistance_%7E017a9d709487d93fe4?source=rss","processedDate":"2024-03-19T08:49:08.960Z","postedDate":"<b>Posted On</b>: January 25, 2024 18:22 UTC","id":"017a9d709487d93fe4"},{"skillset":["CFD Analysis","Engineering Simulation","Finite Element Analysis","Mechanical Engineering","OpenFOAM"],"title":"Seeking OPENFOAM Tutor for mixed coded boundary in Coupled Heat Transfer Simulation - Upwork","description":"I am a second-year doctoral researcher currently working on heat transfer simulations using OPENFOAM. My research involves coupled heat transfer phenomena, including conduction, convection, and radiation on the internal faces of three horizontal or inclined cavities.\nI am looking for a knowledgeable tutor who can assist me through live sessions, specifically focusing on mastering the radiation model within OPENFOAM. The ideal candidate should have expertise in this area and be able to provide guidance on implementing and optimizing radiation simulations.\nResponsibilities:\nConduct live tutoring sessions to help me understand and implement radiation models in OPENFOAM.\nProvide guidance on coupled heat transfer simulations and optimization techniques.\nAssist in troubleshooting and problem-solving related to OPENFOAM simulations.\nRequirements:\nProficiency in using OPENFOAM for heat transfer simulations, particularly in modeling radiation.\nExperience with coupled heat transfer simulations involving conduction, convection, and radiation.\nStrong communication skills and ability to explain complex concepts clearly.\nAvailability for approximately 8 hours per month, with flexibility to schedule sessions according to mutual convenience.\nBudget:\nI am offering a budget of $100 for 8 hours of tutoring per month. Payment will be made at the end of each 2-hour session upon its successful completion.\nIf you are interested and meet the specified requirements, please respond with your qualifications, availability, and any relevant experience you have with OPENFOAM and radiation modeling. Feel free to include a brief overview of your teaching approach.\nThank you for considering this opportunity. I look forward to collaborating with a skilled tutor who can help enhance my understanding of OPENFOAM simulations.<b>Skills</b>:        CFD Analysis,                     Engineering Simulation,                     Finite Element Analysis,                     Mechanical Engineering,                     OpenFOAM            ","link":"https://www.upwork.com/jobs/Seeking-OPENFOAM-Tutor-for-mixed-coded-boundary-Coupled-Heat-Transfer-Simulation_%7E01895917ebdbf4450a?source=rss","processedDate":"2024-03-19T08:49:08.960Z","postedDate":"<b>Posted On</b>: January 20, 2024 12:35 UTC","id":"01895917ebdbf4450a"},{"skillset":["Auth0","OKTA","Single Sign-On","DevOps","JavaScript"],"title":"Auth0 and Okta engineer required to support existing solution  - Upwork","description":"We are a small engineering team in CET timezone who build custom web apps (usually with ReactJS and Angular) which are integrated with Auth0 or Okta CIAM for authentication.&nbsp;&nbsp;Once in production, we offer customers a support contract that includes 24/7 support and 1 hour SLA.&nbsp;&nbsp;&nbsp;&nbsp;We can manage this in our own timezone (0800-2000 CET) and seek a partner to cover the other hours (2000-0800 CET).\nThe project is to be available to respond within an hour for any maintenance or issues relating to Auth0 platform or Okta CIAM platform.\nSince Auth0 is a SaaS platform, the contract is intended to provide extra assurance beyond what the vendor offers.\nThe ideal match would be a software developer with IAM and ideally Auth0/Okta expertise in a timezone that matches the requirements.&nbsp;&nbsp;Communication and issues would be raised via a Service Desk system and integrated to Slack. <b>Skills</b>:        Auth0,                     OKTA,                     Single Sign-On,                     DevOps,                     JavaScript            ","link":"https://www.upwork.com/jobs/Auth0-and-Okta-engineer-required-support-existing-solution_%7E012faf3528db547632?source=rss","processedDate":"2024-03-19T08:49:14.650Z","postedDate":"<b>Posted On</b>: March 12, 2024 17:57 UTC","id":"012faf3528db547632"},{"skillset":[],"title":"OKTA engineer needed - Upwork","description":"OKTA trouble shooting support. OKTA syncing issues on environment.\nAssistance with migration from Okta to Azure AD as a primary IAM solution. \nStrong knowledge of OKTA important. ","link":"https://www.upwork.com/jobs/OKTA-engineer-needed_%7E01bde429d8ec41aae6?source=rss","processedDate":"2024-03-19T08:49:14.651Z","postedDate":"<b>Posted On</b>: February 29, 2024 18:05 UTC","id":"01bde429d8ec41aae6"},{"skillset":["Node.js","MySQL","AngularJS","Web Development","Flutter Stack","Java","PHP","Progressive Web App"],"title":"Owner transaction system - Upwork","description":"Rental login platform with okta login /signup \nAdd Rental (address) - Validate correct the address.\na Invite users, draft lease, upload lease. \nset up rental payments integration. \nbuild 2 sample reports on cashflow . vacant lists\nFile storage system to store documents and pictures<b>Skills</b>:        Node.js,                     MySQL,                     AngularJS,                     Web Development,                     Flutter Stack,                     Java,                     PHP,                     Progressive Web App            ","link":"https://www.upwork.com/jobs/Owner-transaction-system_%7E0118dd161f4b17525a?source=rss","processedDate":"2024-03-19T08:49:14.651Z","postedDate":"<b>Posted On</b>: February 25, 2024 22:14 UTC","id":"0118dd161f4b17525a"},{"skillset":["Python","OAuth","Security Engineering","Single Sign-On"],"title":"Build OAuth/OIDC connectors for PING, Okta, Azure - Upwork","description":"Become a Key Player in Our Team\nPrivateID is hiring a skilled, hands-on developer to implement a &ldquo;shadow&rdquo; Identity Provider (IdP), focusing on building branded OIDC connectors for PING, ForgeRock, Okta, Azure, and Google Identity, tailoring each OIDC connector to fulfill unique client requirements, and creating documentation. \nAbout PrivateID: We are a close-knit team of remote developers working to support large enterprises with our patented, encrypted biometric recognition service.\nRequirements\n-&nbsp;&nbsp;Demonstrated skill in the design and implementation of OpenID Connect, OAuth, and Multi-Factor Authentication (MFA) solutions.\n-&nbsp;&nbsp;Solid technical foundation in node.js, react.js, and python.\n-&nbsp;&nbsp;English proficiency.\nExpectations\n-&nbsp;&nbsp;Individual contributors only; no agencies please\n-&nbsp;&nbsp;Commitment to participate in daily team meetings via webcam, with a requirement to collaborate for up to 4.5 hours daily, primarily between 8:00 AM to 12:00 PM EST. While the role is flexible, allowing for task completion beyond scheduled meeting times, availability during these hours is non-negotiable.\n-&nbsp;&nbsp;If you cannot attend the meetings, please do not apply.\nWe invite you to join us if you have a passion for technology, excel in a remote work setting, and align with the qualifications outlined above. Let&#039;s make a dent in the world, together.<b>Skills</b>:        Python,                     OAuth,                     Security Engineering,                     Single Sign-On            ","link":"https://www.upwork.com/jobs/Build-OAuth-OIDC-connectors-for-PING-Okta-Azure_%7E015f2b00ad26f8178c?source=rss","processedDate":"2024-03-19T08:49:14.651Z","postedDate":"<b>Posted On</b>: February 20, 2024 16:26 UTC","id":"015f2b00ad26f8178c"},{"skillset":["Microsoft Active Directory","Microsoft Azure","Active Directory Federation Services"],"title":"Okta to azure migration - Upwork","description":"We have 10 SAML connections and 2 OIDC connections that are to be migrated from Okta to azure AD.&nbsp;&nbsp;I need strategy, approach, solution and a high level POC to demonstrate this to a prospective client. \nNeed this done in one week with appropriate scripting to do it as one click migration.&nbsp;&nbsp;\nShould provide high quality documentation with steps so this can be set up in our lab and demonstrated to the prospect.&nbsp;&nbsp;\nhttps://www.microsoft.com/en-us/security/business/microsoft-entra<b>Skills</b>:        Microsoft Active Directory,                     Microsoft Azure,                     Active Directory Federation Services            ","link":"https://www.upwork.com/jobs/Okta-azure-migration_%7E01591278dd994f5c8d?source=rss","processedDate":"2024-03-19T08:49:14.651Z","postedDate":"<b>Posted On</b>: February 20, 2024 07:28 UTC","id":"01591278dd994f5c8d"},{"skillset":["OAuth","OKTA","Single Sign-On"],"title":"Okta integration Expert  - Upwork","description":"We&#039;re looking for a Okta integration expect to help with out Okta implementation. \nTo start we&#039;d like to have a several calls to educate us on the best practices and fix our current issues with the our Okta. <b>Skills</b>:        OAuth,                     OKTA,                     Single Sign-On            ","link":"https://www.upwork.com/jobs/Okta-integration-Expert_%7E012b68241c451fce67?source=rss","processedDate":"2024-03-19T08:49:14.651Z","postedDate":"<b>Posted On</b>: February 19, 2024 07:45 UTC","id":"012b68241c451fce67"},{"skillset":["Administrative Support","User Identity Management","OKTA"],"title":"IAM Implementation Manager - Upwork","description":"We are seeking an experienced Okta Implementation Consultant to join our team. The ideal candidate will have a proven track record of successfully implementing Okta in multiple projects within organizations of at least 100 people. This role requires a strong technical background, excellent project management skills, and a deep understanding of Okta&#039;s capabilities. The successful candidate will be responsible for overseeing the entire Okta implementation process, from initial assessment and planning to configuration, testing, and integration. They will also provide ongoing support and maintenance post-implementation. Skills required for this role include:\n- Okta implementation\n- Project management\n- Technical expertise\n- Problem-solving\n- Communication\n- Collaboration\n- Implementation SOPs\n- Technical Training Documentation<b>Skills</b>:        Administrative Support,                     User Identity Management,                     OKTA            ","link":"https://www.upwork.com/jobs/IAM-Implementation-Manager_%7E01f73451167bee91df?source=rss","processedDate":"2024-03-19T08:49:14.651Z","postedDate":"<b>Posted On</b>: February 16, 2024 20:08 UTC","id":"01f73451167bee91df"},{"skillset":["Single Sign-On","OKTA","Microsoft Azure","Azure DevOps"],"title":"SME : OKTA to Azure SSO migration - Upwork","description":"We at Intelliswift Softwares, looking for SME having expertise on OKTA to Azure SSO migrations.\nThere is a new project opportunity and we need someone having indepth knowledge and working experience on OKTA - Single Sign On Azure.\nYou are expected to provide Pre-Sales &amp;amp; BA support for this opportunity.\nExpected work is 10-15 hours a week for next 2-3 months.<b>Skills</b>:        Single Sign-On,                     OKTA,                     Microsoft Azure,                     Azure DevOps            ","link":"https://www.upwork.com/jobs/SME-OKTA-Azure-SSO-migration_%7E016d20d33d88ce1bdc?source=rss","processedDate":"2024-03-19T08:49:14.651Z","postedDate":"<b>Posted On</b>: February 16, 2024 06:55 UTC","id":"016d20d33d88ce1bdc"},{"skillset":["Java","Spring Framework","OKTA","OAuth"],"title":"OKTA integration with Tomcat 9 JAVA Spring based application - Upwork","description":"Integrate Tomcat 9 JAVA 1.8 and Spring framework based application to support OKTA authentication and authorization. We already have SAML authentication and authorization but running into issues with OKTA integration. Help resolve the issues/rewrite/make changes to ensure login, logout and permissions work.<b>Skills</b>:        Java,                     Spring Framework,                     OKTA,                     OAuth            ","link":"https://www.upwork.com/jobs/OKTA-integration-with-Tomcat-JAVA-Spring-based-application_%7E01148a7b4eb7b39c11?source=rss","processedDate":"2024-03-19T08:49:14.651Z","postedDate":"<b>Posted On</b>: February 10, 2024 21:36 UTC","id":"01148a7b4eb7b39c11"},{"skillset":["Auth0","OKTA","OAuth","Single Sign-On"],"title":"Auth0 Expert Needed: Setup and configure Okta as Identity Provider option - Upwork","description":"Overview:\nWe are seeking a highly skilled Auth0 expert to help us set up and configure a new Okta connection for our SaaS application. Currently, we leverage Auth0 as our Identity Provider and have enabled Google Social and Microsoft AD integrations. Expanding to Okta will enhance our offering by catering to customers who utilize Okta for their user authentication.&nbsp;&nbsp;\nSpecific Requirements:\nProven Expertise: Strong understanding and experience working with Auth0, particularly configuring connections.\nOkta Proficiency: Deep knowledge of Okta configuration and integration best practices.\nExperience is Key: Prior experience successfully implementing Okta as a Identity Provider for Auth0.\nClear Communication: Ability to collaborate effectively, provide timely updates, and clearly explain technical concepts.\nProject Scope:\nAnalyze existing Auth0 configuration and assess compatibility with Okta integration.\nConfigure a new Okta SAML connection in Auth0 according to industry best practices.\nEnsure smooth user experience transition between Auth0 and Okta login flows.\nThoroughly test and validate the integrated Okta connection functionality.\nProvide clear documentation and support throughout the implementation process.<b>Skills</b>:        Auth0,                     OKTA,                     OAuth,                     Single Sign-On            ","link":"https://www.upwork.com/jobs/Auth0-Expert-Needed-Setup-and-configure-Okta-Identity-Provider-option_%7E0122921fb3b1678bc5?source=rss","processedDate":"2024-03-19T08:49:14.651Z","postedDate":"<b>Posted On</b>: February 09, 2024 20:41 UTC","id":"0122921fb3b1678bc5"},{"skillset":["Web Application","API Integration","Python","Node.js","OAuth","OKTA"],"title":"OAuth, OIDC Expert - Full Stack Engineer Consultant - No Agencies please - Upwork","description":"We are a small group of remote developers based all over the world, and we are growing! We are very selective about the engineers and clients we work with. We deliver biometric recognition services to our customers without fuss or drama.\nWe are looking for an OIDC expert engineer to join our team. You will be responsible for creating branded OAuth/OIDC &ldquo;branded&rdquo; connectors with PING, ForgeRock, Okta and Azure, customizing OIDC connectors for customers, working on focused customer projects, finding, reporting and fixing bugs and glitches, and documenting the solution for proper support.\nExperience with Verifiable Credentials (VCs) is a definite plus. \nRequirements and skills:\nDesigning/implementing OpenID Connect, OAuth, MFA.\nTechnologies: NodeJS, Javascript, API development, VC, Blockchain\nExperience with one or more: Ping Davinci, Okta, AzureAD, Forgerock\nCloud: GCP, AWS\nTeam Participation and problem solving\nFluent English communication skills\nNo agencies.&nbsp;&nbsp;You must have a working Webcam to meet daily with your team members. Expect up to 4.5 hours of collaborative work per day (usually 7:30 AM to 12:00 PM EST). Much of the work can be finished away from meetings.&nbsp;&nbsp;\nPlease do not apply if you cannot meet reliably, or are not able to show up on time.<b>Skills</b>:        Web Application,                     API Integration,                     Python,                     Node.js,                     OAuth,                     OKTA            ","link":"https://www.upwork.com/jobs/OAuth-OIDC-Expert-Full-Stack-Engineer-Consultant-Agencies-please_%7E01433154a1e8af279e?source=rss","processedDate":"2024-03-19T08:49:14.651Z","postedDate":"<b>Posted On</b>: February 06, 2024 19:15 UTC","id":"01433154a1e8af279e"},{"skillset":["JavaScript","Google Chrome Extension","Auth0","OKTA","OAuth","Firebase"],"title":"Chrome Extension developer to add login functionality - Upwork","description":"Experience with Chrome Extensions\nExperience with Authentication (Auth0 / Firebase / Super Tokens)\nIf you implemented such project in the past - great<b>Skills</b>:        JavaScript,                     Google Chrome Extension,                     Auth0,                     OKTA,                     OAuth,                     Firebase            ","link":"https://www.upwork.com/jobs/Chrome-Extension-developer-add-login-functionality_%7E010d72755ccb6e6db5?source=rss","processedDate":"2024-03-19T08:49:14.651Z","postedDate":"<b>Posted On</b>: February 02, 2024 08:19 UTC","id":"010d72755ccb6e6db5"},{"skillset":["React","Node.js","SaaS","Next.js","API Development","API","API Integration","RESTful API","Amazon Web Services"],"title":"Build a platform that integrates with most cloud services and third party apps - Upwork","description":"Need a developer to build a platform that integrates and pulls data from third party cloud services.\nThe developer should have extensive experience developing and integrating API&#039;s.\nSome examples of the integrations that have to be developer are for:\n- AWS\n- Workday\n- BambooHR\n- Jira/Confluence\n- MDM software\n- Github\n- Okta\nThe above is an example list. The exact integrations and requirements will have to be discussed. \nThese requirements are for creating an MVP. If you are able to create a basic frontend for the platform, that will be a bonus but not a requirement.\nThis will be an ongoing project, we will start with short tasks to understand the requirements and move on to complex ones later. We are also open to hiring multiple developers for specific expertise.<b>Skills</b>:        React,                     Node.js,                     SaaS,                     Next.js,                     API Development,                     API,                     API Integration,                     RESTful API,                     Amazon Web Services            ","link":"https://www.upwork.com/jobs/Build-platform-that-integrates-with-most-cloud-services-and-third-party-apps_%7E01920ea9c883ab77ae?source=rss","processedDate":"2024-03-19T08:49:14.651Z","postedDate":"<b>Posted On</b>: January 18, 2024 11:36 UTC","id":"01920ea9c883ab77ae"},{"skillset":["Python","Amazon Web Services","Laravel","Serverless Computing","Vue.js","AWS IoT Core","Amazon ECS","Node.js","API Development","Amazon MWS"],"title":"Scalable Backend API Developer - 2 - Upwork","description":"Job Details\nTypeScript\nNode.js\nAmazon Web Services (AWS)\nSummary:\nJoin our team as a Back-End Developer and be part of an exciting project involving a social media app with integrated shopping services. In this role, you will work with Typescript and AWS technologies to build a robust back-end infrastructure following a microservices and serverless architecture. The app allows users to earn rewards by watching advertisements, and scalability is a key priority. If you are passionate about developing scalable solutions, leveraging AWS services, and optimizing system performance, this opportunity is perfect for you.\nGeneral Information:\nOur company is developing a social media app that seamlessly integrates shopping services and offers users the ability to earn rewards through advertisement engagement. The back-end architecture follows a microservices and serverless approach, utilizing Typescript and AWS technologies. We prioritize scalability and have a strong focus on infrastructure responsibility, leveraging tools like Terraform for managing our working infrastructure. As a Back-End Developer, you will work in a DevOps environment and collaborate with cross-functional teams to improve and expand the existing product.\nTasks and Deliverables:\nBuild and maintain a scalable and efficient back-end infrastructure using Typescript and AWS technologies.\nDevelop microservices and leverage serverless frameworks to optimize performance and resource utilization.\nImplement the Export Media API using Node.js and TypeScript, ensuring seamless integration with the app&#039;s serverless domain and AWS SDK.\nCollaborate with third-party providers, such as Byteplus for media processing and AI, to enhance system functionality.\nContinuously improve the system by revamping and refactoring existing components while ensuring compatibility and scalability.\nWork closely with the team to meet the Q1 soft launch deadline, ensuring high-quality code and seamless deployment.\nKeep testing in mind during development, ensuring robustness and reliability of the back-end functionalities.\nRequired Experience:\nStrong proficiency in Typescript and experience working with AWS services.\nFamiliarity with microservices architecture and serverless frameworks.\nSolid understanding of Node.js and experience in developing APIs.\nExperience with CI/CD pipelines, deployment automation, and version control systems.\nAbility to work in a collaborative team environment and communicate effectively.\nNice to Have Experience:\nKnowledge of Okta for authentication and authorization.\nPrevious experience in developing social media or e-commerce platforms.\nFamiliarity with Terraform for infrastructure management.\nExperience with third-party media processing and AI services.\nA strong focus on testing methodologies and ensuring system reliability.<b>Skills</b>:        Python,                     Amazon Web Services,                     Laravel,                     Serverless Computing,                     Vue.js,                     AWS IoT Core,                     Amazon ECS,                     Node.js,                     API Development,                     Amazon MWS            ","link":"https://www.upwork.com/jobs/Scalable-Backend-API-Developer_%7E0154ed6fd53cfd96ce?source=rss","processedDate":"2024-03-19T08:49:14.651Z","postedDate":"<b>Posted On</b>: January 11, 2024 06:12 UTC","id":"0154ed6fd53cfd96ce"},{"skillset":["React","Tailwind CSS","Twilio API","GraphQL","API Integration","Magento","Strapi","SendGrid"],"title":" Magento 2.0 Middle and Back End and Advanced Front End Web Technologies at Fur4.com - Upwork","description":"**Job Opening: Senior Full Stack Developer at Fur4.com**\n**Overview:**\nFur4.com, emerging from the success of the Furminator Pet Brush with annual sales over 15 million units, is launching a pioneering product to transform pet care. We seek a Senior Full Stack Developer skilled in Magento 2.0 and advanced web technologies for a remote role. \n**Responsibilities:**\n- Develop scalable software solutions, focusing on user-friendly experiences.\n- Utilize React for front-end development aligned with design specs.\n- Manage a Strapi CMS, enhancing content flexibility.\n- Integrate APIs (Stripe, Twilio, Sendgrid) to boost platform functionality.\n- Modernize Magento 2.0 dashboards with an API-first strategy.\n- Employ GraphQL, OAuth, Auth0, and REST to refine data querying, authentication, and web services.\n- Overhaul registration and login processes for improved access and security.\n- Collaborate on milestones, driving product strategy.\n**Requirements:**\n- 10+ years in full-stack development, specializing in Magento 2.0.\n- Proficient in React, Tailwind, Strapi, GraphQL, OAuth, Auth0, and REST.\n- Experienced in creating secure, user-friendly registration/login systems.\n- Strong portfolio demonstrating expertise in complex system optimization.\n- Excellent problem-solving, teamwork, and communication skills.\n**We Offer:**\n- Key role in an innovative pet care project.\n- Opportunity to shape our platform&#039;s future.\n- Competitive salary, remote flexibility.\n- Collaborative, progressive team environment.\n**Apply:**&nbsp;&nbsp;\nPassionate about making a significant impact in pet care with your Magento 2.0 and web tech expertise? Send your resume, cover letter, and portfolio to [insert contact email]. Join us at Fur4.com in redefining pet care.\n**Join Our Team: Criteria**\n- Individual contributors only; no agencies.\n- Full-time commitment to this project and potential future projects at Platformz Agency ([www.platformz.us](http://www.platformz.us)).\n- Solution-focused, responsible, and accountable for task ownership.\n- Aim for underpromising and overdelivering to set realistic client expectations.\n- Unwavering dedication to meeting deadlines.\n- Enthusiasm for innovation and being part of a groundbreaking agency.\nMeet these criteria and interested in setting new development standards? We&#039;re excited to hear from you.<b>Skills</b>:        React,                     Tailwind CSS,                     Twilio API,                     GraphQL,                     API Integration,                     Magento,                     Strapi,                     SendGrid            ","link":"https://www.upwork.com/jobs/Magento-Middle-and-Back-End-and-Advanced-Front-End-Web-Technologies-Fur4-com_%7E0139e1c51dc6bf208a?source=rss","processedDate":"2024-03-19T08:49:20.354Z","postedDate":"<b>Posted On</b>: March 18, 2024 15:33 UTC","id":"0139e1c51dc6bf208a"},{"skillset":["Software Debugging","HTML","CSS 3","API Integration","API","JavaScript","Web Development","JSON","Bubble.io","Auth0"],"title":"Bubble.io + WikiMedia API Expert - Upwork","description":"** Important: Manual hours will not be allowed, you must be comfortable using the Upwork Timer **\nConnecting Bubble.io to the Wikimedia API experience is needed or you will get stuck quickly.\nWe are starting a new company:&nbsp;&nbsp;https://kogi.ai\nKogi is an AI company which is producing text and animations which show how to repair mechanical machines.&nbsp;&nbsp;We have expert AI Engineers on staff which are producing AI Agents which enter all the data into a Wikimedia server.&nbsp;&nbsp;You will not need to worry about how the instruction data is produced - another team will handle that.\nYour goal is to build and maintain the Bubble.io front end which displays the content from the Wikimedia server.\nWe have built an MVP of the App in Bubble.io\nThis was done quickly and is rough but functional.\nWe now want to hire a team of Bubble.io Engineers to help us clean up the app and get it ready for alpha launch within the next 2-4 weeks.\nThe main functionality of the App is in place, but we need to add some features in order to be able to launch.&nbsp;&nbsp;Most importantly to review the stability and security of the sign up and password features.\nYou must have experience with connecting bubble to uncommon and obscure APIs.&nbsp;&nbsp;We had a real hard time connecting Bubble to the Wikimedia API we are using for data.&nbsp;&nbsp;We had to upgrade the Wikimedia server to OAuth 2.0 before it even worked.\nHere is a video walkthrough of what the App looks like right now:\nhttps://www.loom.com/share/0f88a54cbf91453080a5b85279a20a6e?sid=1f55dd5d-104e-4b29-b4c5-146872fbc4cc\nHere is the documentation for Wikimedia API:\nhttps://api.wikimedia.org/wiki/Main_Page\nThis is not a project for someone just learning Bubble.io - the API integration is complex and will be challenging unless you have done this before.\nI am happy to answer any questions you may have about this project.\nthank you for taking the time to consider working with us.\n-Larry<b>Skills</b>:        Software Debugging,                     HTML,                     CSS 3,                     API Integration,                     API,                     JavaScript,                     Web Development,                     JSON,                     Bubble.io,                     Auth0            ","link":"https://www.upwork.com/jobs/Bubble-WikiMedia-API-Expert_%7E013c0eb84b660c5e30?source=rss","processedDate":"2024-03-19T08:49:20.354Z","postedDate":"<b>Posted On</b>: March 16, 2024 23:46 UTC","id":"013c0eb84b660c5e30"},{"skillset":["Web Application","Ionic Framework","JavaScript"],"title":"Ionic web app - fullstack developer needed - Upwork","description":"I want to engage someone for ~2 months on a fulltime basis. The idea is to ship working software every week.\nThe work is very well specified with designs and clear acceptance criteria.\nThe deliverable will be a web application making use of Ionic components.&nbsp;&nbsp;A second stage of the project will see us building Android and iOS builds, so we want to incorportate Ionic to our system architecture from day 1.\nBackend: Node/ExpressJS\nFrontend: React (Ionic has a React component library)\nPostgress managed DB\nS3 api-compatible object store for storing images and other assets\nAuth0 for authentication\nWe will potentially use a headless CMS like Strapi, this is not yet 100% clear.\nThe web app is logically relatively simple.&nbsp;&nbsp;The technical risk comes from working with video. We would like to use Mux to handle end-to-end video recording, encoding, storage, retrieval, streaming, etc.&nbsp;&nbsp;Users can upload a video, and other users can view it in-app.\nWe will deal with devops, setting up infrastructure and using Github actions to make sure your commits to our repo are building and deploying to the appropriate environment.\nAside from the basic plumbing, the project will be a fresh start for you, albeit with very clear specifications of what is to be achieved.\nLooking to get started next week so will carefully consider applications the next few days.&nbsp;&nbsp;As I said, for now this would likely be 300 hours +/- 50 for the initial phase of the project.\nPlease confirm somehow in your message that you are a human and not a robot.\nNote that we are price sensitive, but the second stage of this project would see an hourly rate increase.&nbsp;&nbsp;We do need someone with existing experience as this is a fullstack project from scratch.<b>Skills</b>:        Web Application,                     Ionic Framework,                     JavaScript            ","link":"https://www.upwork.com/jobs/Ionic-web-app-fullstack-developer-needed_%7E01b32a4da46756fbfd?source=rss","processedDate":"2024-03-19T08:49:20.354Z","postedDate":"<b>Posted On</b>: March 15, 2024 21:32 UTC","id":"01b32a4da46756fbfd"},{"skillset":["Amazon Web Services","React","API Integration"],"title":"Full Stack Engineer (NextJS, Rust, AWS) - Upwork","description":"I am looking for someone to set up authentication for an app that I am building. \nThe front end is Next JS (pages)\nThe back end is Rust\nI am trying to use Auth0 as my authentication handler but am having difficulty implementing for my use case. \nI could use some help here. <b>Skills</b>:        Amazon Web Services,                     React,                     API Integration            ","link":"https://www.upwork.com/jobs/Full-Stack-Engineer-NextJS-Rust-AWS_%7E01ab90a20f15c4dc1e?source=rss","processedDate":"2024-03-19T08:49:20.354Z","postedDate":"<b>Posted On</b>: March 14, 2024 23:54 UTC","id":"01ab90a20f15c4dc1e"},{"skillset":["Amazon Cognito","User Identity Management","LDAP","Auth0","Information Security Consultation","Security Analysis","Cybersecurity Management","OAuth","API Integration","Single Sign-On","Application Security","Vulnerability Assessment","OKTA","Solution Architecture Consultation"],"title":"Shibboleth deployement - Upwork","description":"shibboleth deployment, installation and configuration<b>Skills</b>:        Amazon Cognito,                     User Identity Management,                     LDAP,                     Auth0,                     Information Security Consultation,                     Security Analysis,                     Cybersecurity Management,                     OAuth,                     API Integration,                     Single Sign-On,                     Application Security,                     Vulnerability Assessment,                     OKTA,                     Solution Architecture Consultation            ","link":"https://www.upwork.com/jobs/Shibboleth-deployement_%7E01951c8df9d66544ea?source=rss","processedDate":"2024-03-19T08:49:20.354Z","postedDate":"<b>Posted On</b>: March 14, 2024 05:57 UTC","id":"01951c8df9d66544ea"},{"skillset":["JavaScript","Node.js","React"],"title":"Auth0 Multi-tenant for multiple organizations expert - Upwork","description":"Need a consultant who has an experience in Auth0 Multi-tenant implementation.\nBudget is flexible.\nNeed to get this done in this week.\nOnly apply if you really have specific experience.<b>Skills</b>:        JavaScript,                     Node.js,                     React            ","link":"https://www.upwork.com/jobs/Auth0-Multi-tenant-for-multiple-organizations-expert_%7E0158634a8790940934?source=rss","processedDate":"2024-03-19T08:49:20.354Z","postedDate":"<b>Posted On</b>: March 13, 2024 18:35 UTC","id":"0158634a8790940934"},{"skillset":["Web Development","JavaScript","HTML","CSS","HTML5"],"title":"Build a bid writing website similar to typeform and formless.ai - Upwork","description":"Hi there, I&#039;m looking for a javascript web developer to create a copy of formless.ai using an openai key and unsplash to create a form with a large question and a large answer, an always changing background image, no input boxes visible, generated by prompts on a node backend. You should create user areas using Auth0 with buttons like Register, Login, Log out,&nbsp;&nbsp;and Edit profile. This is a fixed budget project leading to a much larger 3-month long website project which integrates with this one. You are expected to use GPT4 to complete this within 2 weeks.<b>Skills</b>:        Web Development,                     JavaScript,                     HTML,                     CSS,                     HTML5            ","link":"https://www.upwork.com/jobs/Build-bid-writing-website-similar-typeform-and-formless_%7E016053e6128f114e28?source=rss","processedDate":"2024-03-19T08:49:20.354Z","postedDate":"<b>Posted On</b>: March 12, 2024 13:22 UTC","id":"016053e6128f114e28"},{"skillset":["PostgreSQL","Python","API","Database","Auth0","User Authentication"],"title":"Token Generation from Postgresql Dataset (User Management) - Upwork","description":"Objective: Develop backend code to generate unique SovAI SDK (my own python sdk) tokens for each user after they authenticate via Auth0 and complete a Stripe payment.\nKey steps:\nWhen a user logs in via Auth0, sync their information with your Postgres database.\nAfter the user completes a Stripe payment, trigger the token generation process.\nGenerate a unique API token for the user, likely leveraging the SovAI SDK.\nStore the generated token securely in your Postgres database, associating it with the user&#039;s account.\nReturn the token to the client-side to be displayed to the user.<b>Skills</b>:        PostgreSQL,                     Python,                     API,                     Database,                     Auth0,                     User Authentication            ","link":"https://www.upwork.com/jobs/Token-Generation-from-Postgresql-Dataset-User-Management_%7E01f4ceaed81fc4d076?source=rss","processedDate":"2024-03-19T08:49:20.354Z","postedDate":"<b>Posted On</b>: March 11, 2024 13:03 UTC","id":"01f4ceaed81fc4d076"},{"skillset":["Auth0"],"title":"Need help with setting up Auth0 OAuth 2.0 for our JetAdmin Application - Upwork","description":"We are wanting to setup passwordless login with Jet Admin which has an integration Auth0.\nHappy to do it on a project based price<b>Skills</b>:        Auth0            ","link":"https://www.upwork.com/jobs/Need-help-with-setting-Auth0-OAuth-for-our-JetAdmin-Application_%7E0114f3ac661ce82222?source=rss","processedDate":"2024-03-19T08:49:20.354Z","postedDate":"<b>Posted On</b>: March 10, 2024 06:48 UTC","id":"0114f3ac661ce82222"},{"skillset":["React","Tailwind CSS","TypeScript","Material UI"],"title":"Seeking Front End Developer for Short Term Project - Upwork","description":"We are seeking an experienced front-end developer for contract-based work. Your primary responsibility will be to collaborate with our development team in the development of our customer portal.\nOur portal is built on React and primarily relies on C# for the backend. Your primary focus for this project will be to develop components / pages that utilize data coming in from the backend and display it in a clean, responsive, and professional manner. Other notable technologies currently being used on the front-end are:\n&bull;\tTypescirpt\n&bull;\tVite\n&bull;\tAuth0\n&bull;\tReact Query\n&bull;\tMaterial UI\n&bull;\tChartJS\n&bull;\tTailwind CSS\nWe are looking for an individual who can actively develop and engage in efficient communication to achieve our objectives. Our team operates in MST timezone, working from 7:30 AM to 3:30 PM.\nWe are open to establishing a long-term relationship for similar projects in the future if it suits your preference.<b>Skills</b>:        React,                     Tailwind CSS,                     TypeScript,                     Material UI            ","link":"https://www.upwork.com/jobs/Seeking-Front-End-Developer-for-Short-Term-Project_%7E01cd645f34dac717b5?source=rss","processedDate":"2024-03-19T08:49:20.355Z","postedDate":"<b>Posted On</b>: March 07, 2024 20:05 UTC","id":"01cd645f34dac717b5"},{"skillset":["API Integration","Laravel","PHP","API","Web Development","Auth0"],"title":"Some Logic in route of Laravel Project - Upwork","description":"I am looking for someone who can implement the authentication, rate limiting to the route in Laravel project.<b>Skills</b>:        API Integration,                     Laravel,                     PHP,                     API,                     Web Development,                     Auth0            ","link":"https://www.upwork.com/jobs/Some-Logic-route-Laravel-Project_%7E01772ef8865af09f59?source=rss","processedDate":"2024-03-19T08:49:20.355Z","postedDate":"<b>Posted On</b>: March 07, 2024 18:08 UTC","id":"01772ef8865af09f59"},{"skillset":["React","Node.js","JavaScript","MongoDB","Web Development","Web Application","FastAPI","User Authentication","Auth0","OAuth"],"title":"Fix MERN/fast API/EC2 - Implement User Onboarding &amp; Setup Setup Data flows - Fixed Price ONLY - Upwork","description":"Tasks to fix:\nFrontend/User Flow\n1) Login flow/questionnaire/User onboarding for users (everything was previously working with firebase. Code is already written. Need to switch it on again)\n2) Add a small module, will require a few UI changes (allows users to freely input text responses). We&#039;ll create a pipeline to ingest this data (will provide guidance). \n3) After user has selections, then store user data in MongoDB and/or Firebase (backend code not written yet)\nFix 2 APIs:\n1) Fix fastAPI endpoint deployed on EC2 (should be fed some different type of data from MongoDB) \n2) Redeploy API endpoints to all in one region. 6 APIs in total, 1 is in Ireland, rest are in japan. Switch them all to Ireland. \nRequirements: fastAPI/MERN/MongoDB/Search API experience (e.g. for ecommerce websites)\nTimeframe: Maximum 2 days. Not much to do. Just need it all re-implemented. Small task for good feedback. Need a fixed price offer.<b>Skills</b>:        React,                     Node.js,                     JavaScript,                     MongoDB,                     Web Development,                     Web Application,                     FastAPI,                     User Authentication,                     Auth0,                     OAuth            ","link":"https://www.upwork.com/jobs/Fix-MERN-fast-API-EC2-Implement-User-Onboarding-amp-Setup-Setup-Data-flows-Fixed-Price-ONLY_%7E01319127186267a853?source=rss","processedDate":"2024-03-19T08:49:20.355Z","postedDate":"<b>Posted On</b>: March 07, 2024 11:08 UTC","id":"01319127186267a853"},{"skillset":["Laravel","PHP","API","MySQL","API Integration","JavaScript"],"title":"Senior Laravel Developer - Upwork","description":"We need a senior Laravel/PHP/LAMP stack developer with Auth0 auth experience.\nQualifications\n- proven track of LAMP stack product development experience\n- proven experience of Auth0 integration\n- excellent communication\n- responsibility\n- who adheres timeline strictly\nRequirements\n- github profile\n- LAMP sample code\n- Auth0 integration sample\nDo not reply if you don&#039;t have proven experience, if you have proven experience we have high possibility of long term engagement.<b>Skills</b>:        Laravel,                     PHP,                     API,                     MySQL,                     API Integration,                     JavaScript            ","link":"https://www.upwork.com/jobs/Senior-Laravel-Developer_%7E01c825ba5920702a3e?source=rss","processedDate":"2024-03-19T08:49:20.355Z","postedDate":"<b>Posted On</b>: March 07, 2024 08:16 UTC","id":"01c825ba5920702a3e"},{"skillset":["React Native","Expo.io","Booking Management System","Mobile App Development"],"title":"React native app development for new booking app - Upwork","description":"Hi!\nI run a startup called Jammed and we already have a web app that you can see at demo.jammed.app. \nThe React native app is built in Expo and is already underway, and this task is to bring our customer booking app this to native devices. \nI&#039;m also a developer, and you&#039;ll report directly to me - the app will need to search and filter existing studios (what i&#039;m working on now), find a time to book in the room using the existing APIs, integrate with Auth0, and allow customers to book and pay. The project is fairly large, but already has a customer base and API, and I&#039;ll also be contributing code and API backend changes to the project.\nI&#039;m planning to launch a beta for this app in May, and hopefully have a working version by then, and then to improve it over time - so the gig might be quite a long term one.<b>Skills</b>:        React Native,                     Expo.io,                     Booking Management System,                     Mobile App Development            ","link":"https://www.upwork.com/jobs/React-native-app-development-for-new-booking-app_%7E017f9135c7950b8a79?source=rss","processedDate":"2024-03-19T08:49:20.355Z","postedDate":"<b>Posted On</b>: March 05, 2024 19:37 UTC","id":"017f9135c7950b8a79"},{"skillset":["AWS Lambda","Auth0","GitLab","HIPAA","Node.js","API","MongoDB","Serverless Stack","SQL","Twilio","JavaScript","3CX","Web Application","Email Deliverability","Project Management"],"title":"MVP for the Service Industry  - Upwork","description":"Building an MVP focused on solving a problem for the service business industry. Need help with backend development on AWS, Twilio, and ChatGPT.&nbsp;&nbsp;We have mapped and flow requirements for the project and are looking to move quickly.<b>Skills</b>:        AWS Lambda,                     Auth0,                     GitLab,                     HIPAA,                     Node.js,                     API,                     MongoDB,                     Serverless Stack,                     SQL,                     Twilio,                     JavaScript,                     3CX,                     Web Application,                     Email Deliverability,                     Project Management            ","link":"https://www.upwork.com/jobs/MVP-for-the-Service-Industry_%7E016950c9556e7f29b1?source=rss","processedDate":"2024-03-19T08:49:20.355Z","postedDate":"<b>Posted On</b>: March 04, 2024 20:49 UTC","id":"016950c9556e7f29b1"},{"skillset":["Java","Liferay","Auth0"],"title":"Liferay portal implementation - Upwork","description":"Liferay portal\nHome page, sub pages, libraries, authentication, css, html, figma\nFull time\nLiferay dxp 7.4\nRead from API<b>Skills</b>:        Java,                     Liferay,                     Auth0            ","link":"https://www.upwork.com/jobs/Liferay-portal-implementation_%7E0114bdae03a6064808?source=rss","processedDate":"2024-03-19T08:49:20.355Z","postedDate":"<b>Posted On</b>: March 04, 2024 11:22 UTC","id":"0114bdae03a6064808"},{"skillset":["Python","PostgreSQL","Web Application","HTML","CSS","JavaScript"],"title":"Develop a Custom Email-to-Podcast Application - Upwork","description":"We are seeking an experienced full-stack developer to build a proof of concept (POC) for a novel application that converts email newsletters into narrated podcast episodes accessible via a private RSS feed. This project involves creating a user-friendly web interface for account creation, processing emails, stripping unnecessary metadata, utilizing Text-to-Speech (TTS) services for narration, and generating a unique, private RSS feed for each user.\nCore Functionalities:\nAccount Creation: Enable users to sign up and manage their accounts.\nCustom Email Address Generation: Upon account creation, generate a custom email address for users to forward newsletters.\nEmail Processing and Metadata Stripping: Process incoming emails, strip unnecessary metadata, and prepare the content for narration.\nText-to-Speech Conversion: Convert email content into high-quality audio using a TTS service.\nRSS Feed Generation: Upload narrated content to a unique, private RSS feed for each user.\nRequired Skills and Experience:\nProficiency in HTML, CSS, JavaScript (React or Vue.js preferred for front-end development).\nStrong background in Python or Node.js for back-end development.\nExperience with email processing libraries and APIs.\nFamiliarity with Text-to-Speech services such as Google Cloud Text-to-Speech, Amazon Polly, or IBM Watson Text to Speech.\nKnowledge of RSS feed generation and management.\nExperience with databases (e.g., PostgreSQL, MongoDB) and authentication services (e.g., Auth0, Firebase Authentication).\nComfortable deploying and managing applications on cloud platforms (AWS, Google Cloud, or Heroku).<b>Skills</b>:        Python,                     PostgreSQL,                     Web Application,                     HTML,                     CSS,                     JavaScript            ","link":"https://www.upwork.com/jobs/Develop-Custom-Email-Podcast-Application_%7E0159ac365e14c61e34?source=rss","processedDate":"2024-03-19T08:49:20.355Z","postedDate":"<b>Posted On</b>: March 04, 2024 01:24 UTC","id":"0159ac365e14c61e34"},{"skillset":["Web Development","API"],"title":"Build a client portal and Retool internal dashboard - Upwork","description":"Speckle is a new pentesting firm.\nWe are looking for a Full Stack Developer to build a client portal and an internal dashboard using Retool. \nThis will provide a secure and efficient way for clients to access their reports and for our security engineers to submit test data.\nClient Portal Development:\n&nbsp;&nbsp;- Implement secure end-user authentication using one of the following services: Kin, Stytch, Auth0, or Supabase.\n&nbsp;&nbsp;- Design and develop a user-friendly interface for clients to log in and retrieve their penetration testing reports.\n&nbsp;&nbsp;- Ensure the portal is scalable and can be expanded to include additional features in the future.\nRetool Dashboard Development:\n&nbsp;&nbsp;- Create an internal dashboard using Retool for penetration testing engineers to submit and manage test data.\n&nbsp;&nbsp;- Ensure the dashboard is intuitive and caters to the specific data submission requirements of penetration testing reports.\n&nbsp;&nbsp;- Integrate the dashboard with the client portal to streamline the report generation and delivery process.<b>Skills</b>:        Web Development,                     API            ","link":"https://www.upwork.com/jobs/Build-client-portal-and-Retool-internal-dashboard_%7E01a15a8da464145fd1?source=rss","processedDate":"2024-03-19T08:49:20.355Z","postedDate":"<b>Posted On</b>: March 02, 2024 05:21 UTC","id":"01a15a8da464145fd1"},{"skillset":["Make.com","Marketing Automation"],"title":"Make.com integration - Upwork","description":"create a make.com integration between \nAuth0 Customer.io Stripe pipedrive&nbsp;&nbsp;Calendly \nI would like to set this up tomorrow and test the automation<b>Skills</b>:        Make.com,                     Marketing Automation            ","link":"https://www.upwork.com/jobs/Make-com-integration_%7E01eaed012ebeafd948?source=rss","processedDate":"2024-03-19T08:49:20.355Z","postedDate":"<b>Posted On</b>: February 29, 2024 21:58 UTC","id":"01eaed012ebeafd948"},{"skillset":["AWS Lambda","Auth0","GitLab","HIPAA","Node.js","API","MongoDB","Serverless Stack","SQL","Twilio","JavaScript","3CX","Web Application","Email Deliverability","Project Management"],"title":"Work in Twilio - Upwork","description":"Work in Twilio, including transfering numbers and some tracking info. <b>Skills</b>:        AWS Lambda,                     Auth0,                     GitLab,                     HIPAA,                     Node.js,                     API,                     MongoDB,                     Serverless Stack,                     SQL,                     Twilio,                     JavaScript,                     3CX,                     Web Application,                     Email Deliverability,                     Project Management            ","link":"https://www.upwork.com/jobs/Work-Twilio_%7E01b986d09e2f01b154?source=rss","processedDate":"2024-03-19T08:49:20.355Z","postedDate":"<b>Posted On</b>: February 29, 2024 18:17 UTC","id":"01b986d09e2f01b154"},{"skillset":["React","Node.js","JavaScript","MongoDB","Web Development","Web Application","FastAPI","User Authentication","Auth0","OAuth"],"title":"Fix MERN/fast API/EC2 - Implement User Onboarding &amp; Setup Setup Data flows - Upwork","description":"Tasks to fix:\nFrontend/User Flow\n1) Login flow/questionnaire/User onboarding for users (everything was previously working with firebase. Code is already written. Need to switch it on again)\n2) Add a small module, will require a few UI changes (allows users to freely input text responses). We&#039;ll create a pipeline to ingest this data (will provide guidance). \n3) After user has selections, then store user data in MongoDB and/or Firebase (backend code not written yet)\nFix 2 APIs:\n1) Fix fastAPI endpoint deployed on EC2 (should be fed some different type of data from MongoDB) \n2) Redeploy API endpoints to all in one region. 6 APIs in total, 1 is in Ireland, rest are in japan. Switch them all to Ireland. \nRequirements: fastAPI/MERN/MongoDB/Search API experience (e.g. for ecommerce websites)\nTimeframe: Maximum 2 days. Not much to do. Just need it all re-implemented. Small task for good feedback.<b>Skills</b>:        React,                     Node.js,                     JavaScript,                     MongoDB,                     Web Development,                     Web Application,                     FastAPI,                     User Authentication,                     Auth0,                     OAuth            ","link":"https://www.upwork.com/jobs/Fix-MERN-fast-API-EC2-Implement-User-Onboarding-amp-Setup-Setup-Data-flows_%7E01fe034ae753c705b0?source=rss","processedDate":"2024-03-19T08:49:20.355Z","postedDate":"<b>Posted On</b>: February 29, 2024 11:37 UTC","id":"01fe034ae753c705b0"},{"skillset":["DevOps","CI/CD","Terraform"],"title":"DevOps Terraform engineer needed to support a team of devs - Upwork","description":"Looking for someone who can support us with DevOps tasks. \nCurrently working with GCP, Auth0, Azure, GitHub Actions<b>Skills</b>:        DevOps,                     CI/CD,                     Terraform            ","link":"https://www.upwork.com/jobs/DevOps-Terraform-engineer-needed-support-team-devs_%7E01fa8c6b82e5866a80?source=rss","processedDate":"2024-03-19T08:49:20.355Z","postedDate":"<b>Posted On</b>: February 28, 2024 13:02 UTC","id":"01fa8c6b82e5866a80"},{"skillset":["React","Node.js","JavaScript","MongoDB","Web Development","Web Application","FastAPI","User Authentication","Auth0","OAuth"],"title":"Finish MERN project/fast API/EC2 - Implement User Onboarding &amp; Setup Setup Data flows - Upwork","description":"Fix bugs with MERN stack project and implement following:\nFrontend/User Flow\n1) Login flow/questionnaire/User onboarding for users (everything is already implemented in the frontend, need to write logic for backend).\n1.1) Add a small module, will require a few UI changes (allows users&nbsp;&nbsp;to freely input text responses). We&#039;ll create a pipeline to ingest this data (will provide guidance). \n2) After user has selections, then store user data in MongoDB and/or Firebase\n2.1) Store data in MongoDB collections from quiz\nAPIs to be fixed:\n3) Fix fastAPI endpoint deployed on EC2 (should be fed some different type of data from MongoDB) \n4) Shift fastAPI endpoints should all be the same URL (right now some are different and locations)\nRequirements: fastAPI/MERN/MongoDB/Search API experience (e.g. for ecommerce websites)\nTimeframe: Maximum 1 week. Not much to do. Just need it all re-implemented quickly. Doesn&#039;t have to be perfect. Shouldn&#039;t take more than 3 to 4 days if proficient. Opportunity to work long term afterwards.\nNOTE: Would prefer fixed price offer. <b>Skills</b>:        React,                     Node.js,                     JavaScript,                     MongoDB,                     Web Development,                     Web Application,                     FastAPI,                     User Authentication,                     Auth0,                     OAuth            ","link":"https://www.upwork.com/jobs/Finish-MERN-project-fast-API-EC2-Implement-User-Onboarding-amp-Setup-Setup-Data-flows_%7E0117df2b08c0fa0204?source=rss","processedDate":"2024-03-19T08:49:20.355Z","postedDate":"<b>Posted On</b>: February 28, 2024 10:06 UTC","id":"0117df2b08c0fa0204"},{"skillset":["Laravel","PHP","API","Web Development","API Integration","Auth0","RESTful API","Web Application","Custom PHP","jQuery"],"title":"Looking for a Laravel developer for my Project - Upwork","description":"I has a web application in Laravel, Need a developer who can integrate Mobile OTP Verification (Auth). Most recommended Twillo SMS gateway.\nHere is my website:\nhttps://app.jaimax.in/login\nRightnow we have email otp, need SMS otp aswell.<b>Skills</b>:        Laravel,                     PHP,                     API,                     Web Development,                     API Integration,                     Auth0,                     RESTful API,                     Web Application,                     Custom PHP,                     jQuery            ","link":"https://www.upwork.com/jobs/Looking-for-Laravel-developer-for-Project_%7E010eb79981d5698b99?source=rss","processedDate":"2024-03-19T08:49:20.355Z","postedDate":"<b>Posted On</b>: February 28, 2024 10:06 UTC","id":"010eb79981d5698b99"},{"skillset":["MongoDB","API Integration","React","Azure Bot Service","Azure App Service"],"title":"Backend Developer - Upwork","description":"Backend Developer\nBackend programmers are responsible for developing services and providing access to\ndata required by frontend programmers. Writes business logic and retrieves data from\ndatabases.\nJob Responsibilities:\n● Work with professional software engineering practices &amp;amp; best practices for the full\nsoftware development life cycle\n● Translate product strategy and requirements into a maintainable and scalable\nsolution design\n● Collaborate closely with the product team and other cross-functional teams\n● Thorough understanding of Node.js and its core principles\n● Demonstrated commitment to quality through continuous integration, code\nreviews and testing\nRequirements:\n● proficiency in React, Node.JS and MongoDB\n● 3+ years production experience with React, Node.js or related frameworks and technologies\n● technical experience setting up Azure database &amp;amp; services\nknowledgeable building and deploying with 3rd party apps &amp;amp; API (Stripe, Auth0, GetStream)\n● Experience with continuous delivery and deployment on cloud platforms\n● can identify and troubleshoot bugs and errors in the system\nbonus criteria: familiar with ChatGPT and/or can create/ deploy bots backend<b>Skills</b>:        MongoDB,                     API Integration,                     React,                     Azure Bot Service,                     Azure App Service            ","link":"https://www.upwork.com/jobs/Backend-Developer_%7E015ee7e019d67720db?source=rss","processedDate":"2024-03-19T08:49:20.355Z","postedDate":"<b>Posted On</b>: February 26, 2024 02:18 UTC","id":"015ee7e019d67720db"},{"skillset":["React","HTML","CSS","Web Design","Web Development"],"title":"Redesign existing saas using nextjs - Upwork","description":"Looking for someone to redesign existing saas to improve ux. \nCurrent webapp is express + react, looking to migrate away from that.\nNew project will only deal with stripe, auth0, and webapp. The backend portion of nextjs will use code similar to existing code base. The only complexity will be creating a good ux, however I do have a reference website I will share that which will help with the design.\nNote: due to volume of applicants I only hope on a call with freelancers I&#039;m likely going ahead with. <b>Skills</b>:        React,                     HTML,                     CSS,                     Web Design,                     Web Development            ","link":"https://www.upwork.com/jobs/Redesign-existing-saas-using-nextjs_%7E0164e40457167e1ab3?source=rss","processedDate":"2024-03-19T08:49:20.355Z","postedDate":"<b>Posted On</b>: February 25, 2024 09:26 UTC","id":"0164e40457167e1ab3"},{"skillset":["Next.js","React","Svelte"],"title":"Saas webapp redesign - Upwork","description":"Looking to have a webapp redesigned and implemented using react. It will have auth0 and stripe integration. \nCurrently the webapp is a custom react dashboard calling apis. I will share a reference website for the ux I am aiming for, and the current webapp to better give you an idea of work required.\nThe webapp will simply be interacting with a db and lambda, no api calls besides stripe and auth0.\nPlease state your ideal choice of technology in the proposal. Looking for a cost effective solution at this stage. <b>Skills</b>:        Next.js,                     React,                     Svelte            ","link":"https://www.upwork.com/jobs/Saas-webapp-redesign_%7E01a714722a2710a779?source=rss","processedDate":"2024-03-19T08:49:20.355Z","postedDate":"<b>Posted On</b>: February 25, 2024 00:21 UTC","id":"01a714722a2710a779"},{"skillset":["Web Application","Web Development"],"title":"Web dashboard for film production company - Upwork","description":"## Overview\nCreate a dashboard for filmmaker to \n- Send movie proposals with synopsis, genre, budget, etc..\n- Upload assets to an S3 Bucket\n- Accept contract proposals through DocuSign\n- View/browse analyics about movie revenues\n- Browse revenue reports\n## Stack\n- React\n- Postgres\n- Node JS APIs\n- Authentication through Auth0\n- Use tailwindUI for CSS<b>Skills</b>:        Web Application,                     Web Development            ","link":"https://www.upwork.com/jobs/Web-dashboard-for-film-production-company_%7E015d39110091f30469?source=rss","processedDate":"2024-03-19T08:49:20.355Z","postedDate":"<b>Posted On</b>: February 24, 2024 18:18 UTC","id":"015d39110091f30469"},{"skillset":["WordPress","Auth0","WordPress Plugin","Web Development","JavaScript","WordPress Development"],"title":"Need help implementing auth0 on a wordpress website - Upwork","description":"We are looking for an experienced developer to integrate Login by Auth0 into our custom login panel. Our platform currently operates with a&nbsp;&nbsp;login system, but we aim to enhance security and user experience by integrating Auth0&#039;s authentication solutions.<b>Skills</b>:        WordPress,                     Auth0,                     WordPress Plugin,                     Web Development,                     JavaScript,                     WordPress Development            ","link":"https://www.upwork.com/jobs/Need-help-implementing-auth0-wordpress-website_%7E01a138c6ccb9e21130?source=rss","processedDate":"2024-03-19T08:49:20.355Z","postedDate":"<b>Posted On</b>: February 22, 2024 05:39 UTC","id":"01a138c6ccb9e21130"},{"skillset":["WordPress","Auth0","WordPress Plugin","Web Development","JavaScript","WordPress Development"],"title":"Need help implementing auth0 on a wordpress website - Upwork","description":"We are looking for an experienced WordPress developer to integrate Auth0 into our WordPress website. The developer must have a strong understanding of PHP, WordPress, and experience working with authentication and authorization systems.\nRequirements:\n&bull;&nbsp;Install and configure the Auth0 WordPress plugin on our website.\n&bull;&nbsp;Set up and configure an Auth0 application to work seamlessly with our WordPress site.\n&bull;&nbsp;Customize the login and registration process, including social logins and multi-factor authentication, according to our requirements.\n&bull;&nbsp;Test and troubleshoot the Auth0 integration to ensure a smooth user experience.\nThanks<b>Skills</b>:        WordPress,                     Auth0,                     WordPress Plugin,                     Web Development,                     JavaScript,                     WordPress Development            ","link":"https://www.upwork.com/jobs/Need-help-implementing-auth0-wordpress-website_%7E01af6bec234d0a1f2d?source=rss","processedDate":"2024-03-19T08:49:20.355Z","postedDate":"<b>Posted On</b>: February 22, 2024 03:20 UTC","id":"01af6bec234d0a1f2d"},{"skillset":["Node.js","React Native","JavaScript","CSS","HTML"],"title":"Node.js &amp; React Native (Full Stack) - Ad Hoc Tasks - Upwork","description":"We have a short term requirement for good Full Stack coders (Node.js &amp;amp; React Native) to help us complete some Ad Hoc tasks for our Dating App.\nTech Stack is: \nBE - Node.js (some Type Script and Nest.js), MongoDB\nFE - React Native (some Javascript, CSS, HTML)\nOther: GitHub, Render, Auth0\nWorking mainly in Apple Connect / Test Flight.\nYou will need to be able to work quickly, providing accurate estimates for tasks on a fixed fee basis (for a number of hours charged). Then deliver on time, with frequent communication and updates.\nCompany &amp;amp; Job Details: \nOur company is launching a new Dating App. We have most of the App completed and are close to launch. There are a few screens and features that we need to be completed and we are looking for someone who can work quickly to develop screens to a high level of quality (for reasonable rates). Back End support can be provided by our existing team. There are already templates for the existing pages in GitHub which can be repurposed to create new pages (designs in Figma). We don&#039;t need design advice at this stage, we&#039;re just looking for someone with the skills in the Tech Stack listed. \nIf we find someone good that we can work well with there is potentially more work over the long term. Fluent English Essential.<b>Skills</b>:        Node.js,                     React Native,                     JavaScript,                     CSS,                     HTML            ","link":"https://www.upwork.com/jobs/Node-amp-React-Native-Full-Stack-Hoc-Tasks_%7E013fc52e59a9555775?source=rss","processedDate":"2024-03-19T08:49:20.355Z","postedDate":"<b>Posted On</b>: February 20, 2024 22:35 UTC","id":"013fc52e59a9555775"},{"skillset":["Website","React","JavaScript","CSS"],"title":"[ReactJS] Dashboard Developer Needed - Upwork","description":"We&#039;re looking to build out and maintain our existing dashboard that was written with React + Tailwind + Auth0. The dashboard is deployed as a static website on S3 and connects to our existing API.\nThe goal of this project is to find a contractor available to work with us for 10-20+ hours per week. Eventually, we hope to convert you to full-time (30+ hours per week).<b>Skills</b>:        Website,                     React,                     JavaScript,                     CSS            ","link":"https://www.upwork.com/jobs/ReactJS-Dashboard-Developer-Needed_%7E01ea372dc0686a0eaf?source=rss","processedDate":"2024-03-19T08:49:20.355Z","postedDate":"<b>Posted On</b>: February 20, 2024 22:07 UTC","id":"01ea372dc0686a0eaf"},{"skillset":["Hybrid App Development","React Native","Flutter","Android","iOS","Auth0","REST API"],"title":"Mobile App Development for Health Insurance provider - Upwork","description":"We are looking for someone to redevelop our member mobile application to bring it in line with our member website. This application&#039;s primary purpose is allowing members to submit and view health insurance claims and retrieve details of their coverage.\nWe are looking for Android and iOS applications to be written in either React Native or Flutter, though are open to other suggestions.\nThe application will communicate with our back end using existing REST APIs, and authentication and authorization are provided using Auth0.\nA short video showing what we would like to accomplish will be shared with short listed applicants.<b>Skills</b>:        Hybrid App Development,                     React Native,                     Flutter,                     Android,                     iOS,                     Auth0,                     REST API            ","link":"https://www.upwork.com/jobs/Mobile-App-Development-for-Health-Insurance-provider_%7E0158fa3824b0622cc1?source=rss","processedDate":"2024-03-19T08:49:20.355Z","postedDate":"<b>Posted On</b>: February 15, 2024 17:51 UTC","id":"0158fa3824b0622cc1"},{"skillset":["Software Architecture &amp; Design","C#","ASP.NET","Microsoft IIS",".NET Framework","OneLogin","Auth0"],"title":"SSO implementation with .NET application - Upwork","description":"We are seeking a skilled .NET Developer with experience in Single Sign-On (SSO) implementations to work with our team. Our product is a multi-tenant application built on the .NET framework, and we are looking to build standard SSO support (SAML 2.0, Azure AD) into our application.\nRequirements:\nFamiliarity with the .NET framework and design/architectural patterns.\nKnowledge of SSO implementations, specifically SAML 2.0 and Azure AD.\nUnderstanding of multi-tenant application architecture.<b>Skills</b>:        Software Architecture &amp; Design,                     C#,                     ASP.NET,                     Microsoft IIS,                     .NET Framework,                     OneLogin,                     Auth0            ","link":"https://www.upwork.com/jobs/SSO-implementation-with-NET-application_%7E015445260c302b2486?source=rss","processedDate":"2024-03-19T08:49:20.355Z","postedDate":"<b>Posted On</b>: February 05, 2024 18:45 UTC","id":"015445260c302b2486"},{"skillset":["Next.js","TypeScript"],"title":"Work on a Next.js UI - Upwork","description":"Work on a Next.js application that is based on &amp;quot;Horizon UI&amp;quot; UI kit. Utilizing Auth0, Hasura GraphQL and more.<b>Skills</b>:        Next.js,                     TypeScript            ","link":"https://www.upwork.com/jobs/Work-Next_%7E015f87704cee620e2a?source=rss","processedDate":"2024-03-19T08:49:20.355Z","postedDate":"<b>Posted On</b>: February 05, 2024 16:53 UTC","id":"015f87704cee620e2a"},{"skillset":["Flask","Python","CSS","HTML"],"title":"Clean up flask app - Upwork","description":"Complete All Routes:\nFinalize pending routes within the Flask framework to ensure full website functionality.\nTroubleshoot and debug any issues related to route implementation.\nConnect to Templates:\nIntegrate routes seamlessly with templates, ensuring a smooth user experience.\nImplement best practices for template rendering and responsiveness.\nUpdate and Integrate Bootstrap Design:\nEnhance the website&#039;s visual aesthetics by updating and integrating Bootstrap design elements.\nEnsure a cohesive and modern design that aligns with our brand.\nConnect Auth0 to SparkPost:\nIntegrate Auth0 for secure authentication and user management.\nConnect Auth0 with SparkPost for reliable transactional email communication.<b>Skills</b>:        Flask,                     Python,                     CSS,                     HTML            ","link":"https://www.upwork.com/jobs/Clean-flask-app_%7E0123e06cb440d32591?source=rss","processedDate":"2024-03-19T08:49:20.355Z","postedDate":"<b>Posted On</b>: January 26, 2024 18:27 UTC","id":"0123e06cb440d32591"},{"skillset":["Node.js","React Native","Auth0"],"title":"Dynamic client registration React native - Upwork","description":"We have a simple react native app with a login button that is for users to login to Auth0. \nWe want to change this logic so the user of the app doesn&#039;t need to login. \nWe want the device to be registered through Dynamic Application Registration and always be recognised by our server.\nWe need someone who is familiar with Auth0 and can advise a solution either on React native side or on node.js server side. <b>Skills</b>:        Node.js,                     React Native,                     Auth0            ","link":"https://www.upwork.com/jobs/Dynamic-client-registration-React-native_%7E013c671e193b5eaf58?source=rss","processedDate":"2024-03-19T08:49:20.355Z","postedDate":"<b>Posted On</b>: January 24, 2024 00:10 UTC","id":"013c671e193b5eaf58"},{"skillset":["Amazon Web Services","Elasticsearch","JavaScript"],"title":"AWS Open Search Expert Technical Lead for search setup project - Upwork","description":"You Skill sets \n1.OPEN SEARCH EXPERT : ONLY APPLY IF YOU HAVE WORKED 1-2&nbsp;&nbsp;Years in open search\nKnows inside out in open search\n2.Good AWS fundamentals such as understanding of IAM (Identity Access Management) for roles and permissions, VPC (Virtual Private Cloud) concepts for networking and security.\n3. Solid understanding and experience in AWS OpenSearch service basics such as how to provision and manage service domains, node scaling, domain configuration, and index creation.\n4. Implementation experience with search capabilities mentioned on this page https://opensearch.org/docs/latest/search-plugins/searching-data/index/\nProject Objective:\nWe are running a SaaS platform with media items - music and videos and want to implement a new search solution.\nWe need a consultant architect&nbsp;&nbsp;to work with our lead developer to accelerate the setup and optimization of AWS OpenSearch for our organization, facilitating advanced search capabilities, efficient data indexing from DynamoDB, and robust reporting through Kibana. The specialist will architect a scalable and efficient solution, integrating AWS AppSync for seamless data synchronization and enhancing search functionalities to interpret plurals, antonyms, and other linguistic nuances.\n#### Responsibilities:\n1. **Fastrack OpenSearch Setup:**\n&nbsp;&nbsp;&nbsp;- Quickly set up and configure the AWS OpenSearch service, ensuring a secure and scalable foundation.\n&nbsp;&nbsp;&nbsp;- Implement best practices for OpenSearch deployment, including access policies, network configuration, and resource allocation.\n2. **Solution Architecture:**\n&nbsp;&nbsp;&nbsp;- Design the overall architecture of the solution, focusing on scalability, reliability, and security.\n&nbsp;&nbsp;&nbsp;- Plan and document the structure of data indices, considering future growth and the need for agile data retrieval.\n3. **AppSync Integration:**\n&nbsp;&nbsp;&nbsp;- Integrate AWS AppSync to facilitate real-time data synchronization between our applications and the OpenSearch service.\n&nbsp;&nbsp;&nbsp;- Ensure smooth data flow and immediate searchability of newly inputted data, leveraging GraphQL for efficient queries and mutations.\n4. **Indexing DynamoDB:**\n&nbsp;&nbsp;&nbsp;- Develop a strategy for indexing data from DynamoDB tables in OpenSearch, including the creation of index patterns and mappings.\n&nbsp;&nbsp;&nbsp;- Implement mechanisms to handle large datasets and complex data structures, ensuring quick and accurate search results.\n5. **Dynamic Index Updating:**\n&nbsp;&nbsp;&nbsp;- Create a system to automatically update indexes when changes occur in the source data (DynamoDB), ensuring data consistency and accuracy in search results.\n&nbsp;&nbsp;&nbsp;- Utilize AWS Lambda or other AWS services for event-driven updates to the OpenSearch index.\n6. **Reporting with Kibana:**\n&nbsp;&nbsp;&nbsp;- Set up Kibana for data visualization and reporting, tailoring dashboards to meet organizational needs.\n&nbsp;&nbsp;&nbsp;- Train team members on utilizing Kibana for generating insights, monitoring search performance, and making data-driven decisions.\n7. **Search Engine Optimization:**\n&nbsp;&nbsp;&nbsp;- Tweak the OpenSearch engine to enhance search functionalities, including support for plurals, antonyms, and other linguistic variations.\n&nbsp;&nbsp;&nbsp;- Optimize search relevance and performance, implementing custom analyzers and token filters as necessary.\n#### Qualifications:\n- Proven experience with AWS OpenSearch, DynamoDB, and AppSync.\n- Strong background in solution architecture with a focus on search technologies.\n- Knowledge of GraphQL, AWS Lambda, and other AWS services.\n- Experience in setting up Kibana for reporting and data visualization.\n- Ability to write efficient code/scripts in Python, Node.js, or other relevant languages.\n- Excellent problem-solving skills and attention to detail.\n- Strong communication and training abilities.\n#### Deliverables:\n- A fully functional AWS OpenSearch setup, integrated with DynamoDB and AppSync.\n- Comprehensive documentation on the architecture, setup process, and maintenance procedures.\n- Customized Kibana dashboards for operational insights and reporting.\n- A guide and training for the team on managing and optimizing the search solution.\nThis role requires a blend of technical expertise, strategic planning, and effective communication to ensure a successful implementation and utilization of AWS OpenSearch within our organization. \nWe need someone who can&nbsp;&nbsp;start ASAP<b>Skills</b>:        Amazon Web Services,                     Elasticsearch,                     JavaScript            ","link":"https://www.upwork.com/jobs/AWS-Open-Search-Expert-Technical-Lead-for-search-setup-project_%7E015a0e51fee323a4e8?source=rss","processedDate":"2024-03-19T08:49:32.083Z","postedDate":"<b>Posted On</b>: March 04, 2024 07:42 UTC","id":"015a0e51fee323a4e8"},{"skillset":["Smart Contract","Solidity","Rust","Cryptography","Blockchain","Cryptocurrency"],"title":"Smart Contract Developer | Equity Partner in Innovative Crypto Project - Upwork","description":"We are building a Web3 aggregator with a purpose-driven mission to redefine user experience by seamlessly integrating digital identity, assets, and social interactions. In our early development stage, we offer a unique opportunity for significant creative and strategic input.\n✦ Role Summary:\nSeeking a visionary Blockchain Developer to join as a partner in an equity-based position. You will be instrumental in:\n&bull; Collaborating on the design of our innovative blockchain architecture.\n&bull; Developing smart contracts for feature enhancements.\n&bull; Contributing to tokenomics and strategic discussions.\n✦ Ideal Candidate:\n&bull; Experienced in developing Smart Contracts in Solidity or CosmWasm (Rust).\n&bull; Brings extensive experience in the crypto domain, with expertise in digital identity, cryptography, NFTs, and blockchain technology foundations.\n&bull; Exhibits a driven attitude, eager for a collaborative build experience within an exciting startup environment.\n&bull; Shows motivation and proficiency in crypto technologies and a capacity for significant contributions to strategic planning.\n✦ Nice to Have:\nWe value candidates who also bring:\n&bull; Full Stack Development: Proficiency with front-end (e.g., React, Vue.js) and back-end (e.g., Node.js, Express) technologies, along with database knowledge.\n&bull; DevOps &amp;amp; Cloud: Experience with CI/CD, containerization (Docker, Kubernetes), and cloud platforms (AWS, Azure, Google Cloud).\n&bull; UX/UI Design Insights: A good eye for user-friendly design and the ability to collaborate effectively with design teams.\n&bull; Agile Experience: Comfort with Agile development and project management tools.\n&bull; Security Awareness: Knowledge of cybersecurity best practices, especially in blockchain and web development.\n&bull; Leadership Qualities: Strong communication skills and potential leadership experience.\n&bull; Innovative Mindset: A passion for technology and innovation, keeping up with industry trends.\n✦ What We Offer:\n&bull; Negotiable equity stake, with a standard 4-year vesting period and a 1-year cliff, complemented by platform tokens upon launch.\n&bull; A transition to a salaried position post-funding, inclusive of salary and additional token allocations.\n&bull; A fully remote, flexible work setup emphasizing collaboration, communication, and a shared commitment to our vision.\n✦ How to Apply:\nSubmit your application with:\n&bull; A resume or LinkedIn profile link.\n&bull; A proposal letter detailing your fit for this role and your vision for contributing to our project.\n&bull; Portfolio or examples of past blockchain work (if available).\n&bull; To ensure you&#039;ve read the job. Please include the word &amp;quot;VELOCITY&amp;quot; at the end of your proposal.\n✦ Our Team Ethos:\nWe champion clear, open communication, deep collaboration, and a strong commitment to our project&#039;s success. We foster a partnership mindset, with regular sync-ups and a supportive approach to all tasks.\n✦ Application Note:\nCompletion of Upwork&#039;s interview question section is mandatory for consideration!! This step is crucial for assessing your experience and alignment with the project&#039;s goals.\n✦ Your Opportunity:\nThis position offers a chance to be at the forefront of Web3 innovation, within a project poised to tackle some of the most pressing challenges in the space. If you are passionate about blockchain technology and eager to contribute to a groundbreaking venture, we welcome your application.<b>Skills</b>:        Smart Contract,                     Solidity,                     Rust,                     Cryptography,                     Blockchain,                     Cryptocurrency            ","link":"https://www.upwork.com/jobs/Smart-Contract-Developer-Equity-Partner-Innovative-Crypto-Project_%7E01cad374ae021421c6?source=rss","processedDate":"2024-03-19T08:49:37.778Z","postedDate":"<b>Posted On</b>: March 07, 2024 22:06 UTC","id":"01cad374ae021421c6"},{"skillset":["Administrative Support","Data Entry","Customer Service","Email Communication"],"title":"Remote Virtual Assistant Position at Orchard Operations - Upwork","description":"About Orchard Operations:\nOrchard Operations is a leading full-scale digital and interactive solutions company based in Beverly Hills, California. We are dedicated to continuously building and strengthening the visions of our clients across various industries. With a diverse portfolio of brands and service offerings in technology, retail, and media, we pride ourselves on delivering exceptional solutions that align with our clients&#039; expertise, identity, and goals.\nPosition Overview:\nOrchard Operations is seeking a dedicated and efficient Remote Virtual Assistant to support our CEO. This role is crucial for managing a wide range of administrative tasks, ensuring the smooth operation of our executive office. The ideal candidate is a highly organized, tech-savvy professional with outstanding communication skills and the ability to manage multiple tasks efficiently.\nKey Responsibilities:\n\tManage and organize calendars.\n\tSchedule and coordinate meetings.\n\tTake detailed notes during meetings.\n\tBook travel arrangements.\n\tManage email correspondence.\n\tCreate content for personal social media accounts.\n\tManage expense reports.\n\tConduct research for projects.\n\tPrepare presentations.\n\tHandle various administrative tasks.\n\tProvide support to the Orchard Operations team as needed.\nRequirements:\n\tAt least 2 years of proven experience in a virtual assistant or similar role.\n\tFluent in English with excellent written and verbal communication skills.\n\tFamiliarity with current technologies (e.g., desktop sharing, cloud services, VoIP).\n\tProficient in MS Office, with a strong understanding of word-processing software and spreadsheets.\n\tKnowledgeable in online calendars and scheduling (e.g., Google Calendar).\n\tExceptional communication skills across phone, email, and instant messaging.\n\tExcellent time management and organizational skills.\n\tHigh school diploma required; additional qualifications as an Administrator or Executive Assistant are a plus.\n\tExperience in the media and production spaces is preferred.\nWork Schedule:\nAvailability required seven days a week. Specific shift times, salary, and benefits will be determined based on the applicant&#039;s country of residence.\nHow to Apply:\nInterested candidates are invited to submit their resume and a cover letter outlining their qualifications and experience relevant to the role. Please submit your application via Upwork.\nJoin us at Orchard Operations to embark on a dynamic career path while contributing to diverse and innovative projects. We look forward to welcoming a new member to our team who is eager to make an impact and grow with us.<b>Skills</b>:        Administrative Support,                     Data Entry,                     Customer Service,                     Email Communication            ","link":"https://www.upwork.com/jobs/Remote-Virtual-Assistant-Position-Orchard-Operations_%7E0109318aac22a5bb04?source=rss","processedDate":"2024-03-19T08:49:37.778Z","postedDate":"<b>Posted On</b>: March 01, 2024 08:00 UTC","id":"0109318aac22a5bb04"},{"skillset":["Email Support","DNS","Cloud Migration","Webmail","Google Cloud Platform","Email","Technical Support","User Identity Management","Domain Migration","Google Workspace","Web Hosting","Email Deliverability","Office 365","Spam Filter","Microsoft Exchange Server"],"title":"Perform overall Klaviyo diagnostics including DNS, DKIM, SPF, etc.  - Upwork","description":"Perform overall Klaviyo diagnostics including DNS, DKIM, SPF, etc.&nbsp;&nbsp;Also check pixel to be sure its installed properly.<b>Skills</b>:        Email Support,                     DNS,                     Cloud Migration,                     Webmail,                     Google Cloud Platform,                     Email,                     Technical Support,                     User Identity Management,                     Domain Migration,                     Google Workspace,                     Web Hosting,                     Email Deliverability,                     Office 365,                     Spam Filter,                     Microsoft Exchange Server            ","link":"https://www.upwork.com/jobs/Perform-overall-Klaviyo-diagnostics-including-DNS-DKIM-SPF-etc_%7E01ce972ded93c275d8?source=rss","processedDate":"2024-03-19T08:49:37.779Z","postedDate":"<b>Posted On</b>: February 26, 2024 22:17 UTC","id":"01ce972ded93c275d8"},{"skillset":["Website","Node.js","TypeScript","CSS","Web Development","Landing Page","Responsive Design"],"title":"Responsive website landing page - Upwork","description":"We are on the lookout for a talented web designer who can not only redesign our company&#039;s website into a modern, responsive one-page landing page but also help in developing a cohesive brand identity around our existing logo. Our company, Alboum, specializes in a wide range of IT solutions and consultations, including CMS management, website design, API and software development, cloud services (Google Cloud, AWS, Azure), cybersecurity (including pentesting and WAF setup), NLP integration, and VR/AR solutions.\nRequirements:\nStrong portfolio showcasing modern web design projects and brand development work.\nProficiency in web design tools (e.g., Adobe Creative Suite, Sketch, Figma) and a good understanding of web development fundamentals to ensure designs can be practically implemented.\nExperience designing responsive websites optimized for both mobile and desktop platforms.\nCreative ability to develop a brand identity that complements our logo and translates our IT services into a visually appealing web presence.\nSkills in creating a layout that clearly communicates our services in a concise, user-friendly manner on a single page.\nEnglish proficiency is a must; Arabic language skills are a bonus. We can assist with Arabic content integration and ensure RTL compatibility for Arabic.\nResponsibilities:\nDevelop a modern, responsive one-page website design that effectively showcases our brand and services, building around our existing logo to create a cohesive brand identity.\nCollaborate with our team to gain a deep understanding of our services and how they can be best represented on the website.\nDeliver design mockups for review, adjusting based on feedback to ensure the final design meets our vision and expectations.\nEnsure the final design is user-friendly and optimized for an excellent user experience across all devices and platforms.\nComplete the project within the agreed timeline, providing final design files and guidelines for the developed brand identity.\nWhat We Provide:\nOur company logo and a detailed explanation of our services and the scope of work.\nSupport for Arabic language content integration, if needed, including assistance with RTL layout adjustments.\nContinuous collaboration and clear communication throughout the project.\nHow to Apply:\nInterested candidates should submit a proposal containing:\nA portfolio of your web design and brand development projects.\nYour proposed approach for designing a modern one-page website and developing a brand identity around our existing logo.\nAvailability and estimated timeline to deliver the project.\nAny initial thoughts or questions regarding the project scope.\nWe are eager to partner with a web designer who can bring our digital presence to life while helping us establish a strong brand identity. Further details about our services will be shared, and we will work closely with you following a compelling proposal.<b>Skills</b>:        Website,                     Node.js,                     TypeScript,                     CSS,                     Web Development,                     Landing Page,                     Responsive Design            ","link":"https://www.upwork.com/jobs/Responsive-website-landing-page_%7E01adbd74403016f92e?source=rss","processedDate":"2024-03-19T08:49:37.779Z","postedDate":"<b>Posted On</b>: February 23, 2024 12:20 UTC","id":"01adbd74403016f92e"},{"skillset":["Cloud Security","Cloud Implementation","Business with 10-99 Employees","Tech &amp; IT","Python","MySQL","AWS Amplify","Cloud Computing","Project Management","Security Infrastructure"],"title":"IT Consultant - Upwork","description":"\n We are looking for a knowledgeable and experienced IT Consultant to join our team. The IT Consultant will be responsible for providing strategic advice and technical guidance to our clients on various IT-related matters. This role involves analyzing their current systems, identifying areas for improvement, and recommending solutions to enhance efficiency and productivity.\nRequired Qualifications:\n&bull;\tPrevious experience working at the big 4 ( Deloitte, PWC, EY, Accenture).\n&bull;\tProven experience working as an IT Consultant or in a similar role.\n&bull;\tStrong understanding of IT systems, infrastructure, and security.\n&bull;\tProficiency in assessing business needs and translating them into technical requirements.\n&bull;\tExcellent problem-solving skills and the ability to think critically.\n&bull;\tEffective communication skills, both written and verbal.\n&bull;\tAbility to work independently and collaboratively within a team.\n&bull;\tProject management experience and familiarity with Agile methodologies.\nPreferred Qualifications:\n&bull;\tIndustry certifications such as ITIL, CompTIA, or PMP.\n&bull;\tExperience with cloud computing platforms (e.g., AWS, Azure, Google Cloud).\n&bull;\tKnowledge of cybersecurity best practices and compliance standards.\n&bull;\tExperience in specific industries such as healthcare, finance, or e-commerce.\n&bull;\tProficiency in programming languages such as Python, Java, or SQL.\nAbout Us: At LELOIR, we are dedicated to providing innovative IT solutions that drive business growth and success. Our team is comprised of passionate professionals who are committed to delivering exceptional service to our clients. \nWe value collaboration, integrity, and continuous learning, and we strive to create a supportive and inclusive work environment where every team member can thrive.\nLELOIR is an equal opportunity employer and is committed to fostering an inclusive and diverse workplace. We do not discriminate based on race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or veteran status. We believe that diversity strengthens our team and enriches our company culture.<b>Skills</b>:        Cloud Security,                     Cloud Implementation,                     Business with 10-99 Employees,                     Tech &amp; IT,                     Python,                     MySQL,                     AWS Amplify,                     Cloud Computing,                     Project Management,                     Security Infrastructure            ","link":"https://www.upwork.com/jobs/Consultant_%7E011f321afa8b2a8383?source=rss","processedDate":"2024-03-19T08:49:37.779Z","postedDate":"<b>Posted On</b>: February 22, 2024 10:00 UTC","id":"011f321afa8b2a8383"},{"skillset":["RESTful API","Oracle Cloud","Oracle Integration Cloud Service"],"title":"Oracle APEX Vendor Portal  - Upwork","description":" Developing a Vendor Portal using Oracle APEX 23.1 or higher outlines several critical features and capabilities. Here&#039;s a review and breakdown of the key components:\nVendor Service:\nAccount Management: Each vendor and their employees will have separate accounts to manage activities. This includes the ability to upload invoices to an object store and view their status.\nInvoice Management: Vendors can check the payment status of invoices, delete, and re-upload corrected invoices if they have not been processed yet.\nSecurity: The portal will feature role-based security, allowing vendors to create user accounts and set access levels based on specific needs.\nWorkflow Management:\nInvoice Approval Process: The portal will implement a workflow for invoice approvals. This workflow could involve up to three levels of approval, depending on the charge type and the amount of money involved.\nOperator and Administrator Services:\nOperator Role: Once an invoice is approved, operators can review and make necessary updates before the invoice is committed to a final table for processing by the ERP system.\nAdministrator Role: Administrators can manage various aspects, such as onboarding new vendors, viewing status reports, and overriding workflows if necessary.\nIntegration:\nThe portal will be developed with REST API endpoints to facilitate data exchange between the vendor portal and third-party systems, including ERP systems.\nAuthentication:\nThe system will support authentication through identity providers such as Office 365/Azure AD, Google, and others.<b>Skills</b>:        RESTful API,                     Oracle Cloud,                     Oracle Integration Cloud Service            ","link":"https://www.upwork.com/jobs/Oracle-APEX-Vendor-Portal_%7E01e6ea8ce529d9c443?source=rss","processedDate":"2024-03-19T08:49:37.779Z","postedDate":"<b>Posted On</b>: December 28, 2023 20:22 UTC","id":"01e6ea8ce529d9c443"},{"skillset":["Kubernetes","RESTful API","NGINX","Microservice","Node.js","Apache Kafka","ExpressJS","Google Cloud Platform"],"title":"Senior Backend Developer “UpWork Verified” - Upwork","description":" We are a Italian business school and we searching for a remote senior backend developer who will work for us&nbsp;&nbsp;with upwork time tracker 8 hours day,&nbsp;&nbsp;Monday -Friday&nbsp;&nbsp;over a year work; in base of the time zone we will define work day hours (start - end ), we make a daily meeting and we manage tasks with clickup task manager, \nwe talking for a social network e-learning platform&nbsp;&nbsp;already in development; \nwe need to add 1 senior backend developer in our team made by ( 2 ui designer 2 frontend 2 backend ) \nThis project is based on BFF&nbsp;&nbsp;&amp;quot;backend for frontend&amp;quot; were backend is made in&nbsp;&nbsp;( node.js + express.js ) and frontend ( nuxt.js ) are separately and comunicate&nbsp;&nbsp;by Rest&nbsp;&nbsp;Api designed on Stoplight&nbsp;&nbsp;so it&rsquo;s important knowledge in Rest Api , Microservice , dockers,&nbsp;&nbsp;communication by microservice by messenger agent broker google pub/sub and grpc&nbsp;&nbsp;, the developer will find&nbsp;&nbsp;the task on clickup and it start ( the task ) from a Meet with the backend team leader&nbsp;&nbsp;+ ui team leader who will present the functionality , the first step of the task after presentation will be Design Api schema model object&nbsp;&nbsp;&nbsp;( Stoplight ) and database design ( Mongo DB + mongoose ). This is a preview of how we want to work.\nCan you tell how much experiences u have with node.js backend with micro service , pub sub broker agent , grpc&nbsp;&nbsp;and nginx ? We actually use google cloud platform services, how skilled you are on developer a rest ful Api with all best practice required, and eventually if required create integration with the api of external tools ? \nAt least if you available&nbsp;&nbsp;for this work we will create a meeting code test in live \nMeeting duration 30 - 60 minutes ( interview + code test sharing a repository on GitHub developer email ) \nThe developer have to clone in local the repo and start make the test.\nONLY UP WORK VERIFYED USERS!!! We don t work out of upwork,&nbsp;&nbsp;no users who try to scam with fake identity!!\nWe are a professional business\nWaiting for a answer, \nBest regard \nSigid Vigani&nbsp;&nbsp;<b>Skills</b>:        Kubernetes,                     RESTful API,                     NGINX,                     Microservice,                     Node.js,                     Apache Kafka,                     ExpressJS,                     Google Cloud Platform            ","link":"https://www.upwork.com/jobs/Senior-Backend-Developer-UpWork-Verified_%7E0150ebc552c8064f70?source=rss","processedDate":"2024-03-19T08:49:37.779Z","postedDate":"<b>Posted On</b>: December 19, 2023 18:13 UTC","id":"0150ebc552c8064f70"},{"skillset":["Laravel","MongoDB","Docker","JavaScript","CSS","MySQL","PHP"],"title":"Full Stack Web Developer (PHP Laravel) - Upwork","description":"| Why C-MORE? |&nbsp;&nbsp;&nbsp;\nC-MORE is a technology company, specializing in Software as a Service for sustainability management (ESG). C-MORE is committed to the idea that the success and future of companies depend on the successful integration of sustainability data, indicators, and initiatives (ESG) in their business models. Therefore, C-MORE develops market-leading sustainability management software as plug-and-play SaaS for SMEs, financial institutions needing to assess and improve their portfolios&#039; ESG maturity, and enterprises needing to assess and improve the ESG maturity of the complex value chains they are part of. C-MORE&#039;s purpose is to collaborate, co-create and cooperate with its clients in the transition to this new approach.​ We embrace a Culture of Collaboration, Mission-Driven, Openness, Responsibility, and Excellence\n&nbsp;\n| Who and why are we hiring? |\nC-MORE is seeking a seasoned PHP Full Stack Developer who is driven by our mission to deliver top-quality software solutions. You should be excited about collaborating with a dynamic team, be open to new ideas and approaches, take responsibility for your tasks and deliverables, and strive for excellence in all aspects of your work.\n&nbsp;\nREQUIREMENTS AND SKILLS:\n&middot; Degree in Computer Science, Information Technology, or related field.\n&middot; Proven experience as a Full Stack Developer or similar senior-level role in software development.\n&middot; Deep knowledge (3+ years) of PHP as a back-end language. Familiarity with other back-end languages (e.g. C#, Java, Python) is preferred.\n&middot; Proficiency in Laravel framework and Docker is essential (3+ years), with experience in other JavaScript frameworks (e.g. Angular, React, Node.js) being a plus.\n&middot; Deep knowledge of front-end languages HTML and JavaScript, and strong familiarity with CSS, XML, and jQuery.\n&middot; Familiarity with a range of databases, including MySQL, MongoDB, and Oracle.\n&middot; Experience developing both web and mobile applications.\n&middot; Knowledge of Agile methodologies and its application in a development environment.\n&middot; Ease with MS 365.\n&middot; Conversational english\n&middot; Strong problem-solving skills and attention to detail.\n&middot;Excellent communication and teamwork skills, embodying our values of collaboration and openness.\n&middot;Ability to work independently and manage time efficiently, demonstrating a sense of responsibility.\n&middot;Experience in international and/or remote teams/environments is a plus.\nAt C-MORE, we don&rsquo;t want to only accept differences. We want to celebrate the difference and see beyond the obvious. C-More is proud to be an equal opportunity company, that does not discriminate against race, color, national origin, ancestry, marital status, religion, sex, sexual orientation, age, citizenship, disability, or gender identity. <b>Skills</b>:        Laravel,                     MongoDB,                     Docker,                     JavaScript,                     CSS,                     MySQL,                     PHP            ","link":"https://www.upwork.com/jobs/Full-Stack-Web-Developer-PHP-Laravel_%7E01046994637d6a9b2d?source=rss","processedDate":"2024-03-19T08:50:00.053Z","postedDate":"<b>Posted On</b>: February 08, 2024 21:33 UTC","id":"01046994637d6a9b2d"},{"skillset":["SailPoint Platform"],"title":"SailPoint Engineer - Upwork","description":"Responsibilities:\n- Design, configure, and implement SailPoint IdentityNow platform components including connectors, workflows, policies, and access certifications.\n- Integrate SailPoint with various systems such as Active Directory, LDAP, HR systems, and applications to automate provisioning and access management processes.\n- Develop custom scripts, rules, and workflows to extend SailPoint functionality and address unique business requirements.\n- Provide technical support, troubleshoot issues, and optimize SailPoint deployments for performance and scalability.\n- Create technical documentation\n- Ensure compliance with regulatory requirements and security best practices by implementing appropriate controls and policies within SailPoint.\n- Collaborate with cross-functional teams including security, IT operations, compliance, and business units to drive successful implementation and adoption of SailPoint solutions.<b>Skills</b>:        SailPoint Platform            ","link":"https://www.upwork.com/jobs/SailPoint-Engineer_%7E01bb29a404ee6ebc13?source=rss","processedDate":"2024-03-19T08:50:05.630Z","postedDate":"<b>Posted On</b>: February 07, 2024 10:53 UTC","id":"01bb29a404ee6ebc13"}]