[{"skillset":["Shopify","Shopify Plus","JavaScript","CSS","Java","API"],"title":"Shopify app experts with Java stack - Upwork","description":"We need to migrate a Shopify app developed as a private app on a new server using code from GitHub.\nYou should have hands-on experience developing and deploying Shopify apps using the Java stack.\nPlease note that the earlier developer is not available to make any knowledge transition, however our immediate objective is to deploy the app on a new server with code from GitHub and install it on a store<b>Skills</b>:        Shopify,                     Shopify Plus,                     JavaScript,                     CSS,                     Java,                     API            ","link":"https://www.upwork.com/jobs/Shopify-app-experts-with-Java-stack_%7E011c2e52c385463c25?source=rss","processedDate":"2024-03-19T08:44:37.584Z","postedDate":"<b>Posted On</b>: March 14, 2024 08:59 UTC","id":"011c2e52c385463c25"},{"skillset":["AI Agent Development","Web Application","AI App Development","Python"],"title":"Debug and Deploy SMS APP - Python - Upwork","description":"Job Description:\nWe are seeking a talented and motivated Scheduling App Developer to join our team and assist in implementing a scheduling app for pickup games. The app is built in Python and requires integration with Google Sheets and Twilio to send updates on game status via SMS.\nResponsibilities:\nCollaborate with the development team to implement and enhance the scheduling app for pickup games.\nIntegrate the app with Google Sheets API to store player information and game schedules.\nImplement Twilio API to enable SMS updates on game status to registered users.\nDebug and troubleshoot issues within the app to ensure smooth functionality.\nWork closely with the team to gather requirements and provide technical solutions.\nDevelop and maintain documentation for the app&#039;s architecture, APIs, and functionalities.\nAssist in the transition of the app into a mobile application that complements the SMS text-based version.\nRequirements:\nStrong proficiency in Python programming language.\nExperience with web development frameworks such as Flask or Django.\nFamiliarity with Google Sheets API and Twilio API for integration purposes.\nAbility to debug and troubleshoot issues in a timely manner.\nExcellent communication skills and ability to work collaboratively in a team environment.\nExperience in mobile app development (iOS/Android) is a plus.<b>Skills</b>:        AI Agent Development,                     Web Application,                     AI App Development,                     Python            ","link":"https://www.upwork.com/jobs/Debug-and-Deploy-SMS-APP-Python_%7E016c8a58580a4764bf?source=rss","processedDate":"2024-03-19T08:44:37.584Z","postedDate":"<b>Posted On</b>: March 13, 2024 23:31 UTC","id":"016c8a58580a4764bf"},{"skillset":["Android","iOS","Mobile App Development","iOS Development","Android App Development"],"title":"Need a developer for android and iOS app - Upwork","description":"This is an app for ios and android both platforms and this is a reward calculator app which is having almost no functionality , calculator has a specific formula to be followed up and main motive is of app is generate leads. \nDeveloper must have knowledge to make an developer account.\nDeveloper must know the whole procedure how to deploy the app on play store or app store.<b>Skills</b>:        Android,                     iOS,                     Mobile App Development,                     iOS Development,                     Android App Development            ","link":"https://www.upwork.com/jobs/Need-developer-for-android-and-iOS-app_%7E01351db7f9307362a6?source=rss","processedDate":"2024-03-19T08:44:37.584Z","postedDate":"<b>Posted On</b>: March 12, 2024 14:56 UTC","id":"01351db7f9307362a6"},{"skillset":["iOS","Smartphone","Mobile App Development","iOS Development"],"title":"Customize and Publish an existing iOS app for Thingsboard Cloud - Upwork","description":"I have used MD format to format the requirements.&nbsp;&nbsp;you can also take a look at it from this link:\nhttps://the-nm.notion.site/Thingsboard-iOS-App-Technical-Requirements-Doc-fc801905450f47f09fa816aa60e4c236?pvs=4\n# 📰Background\nCurrently we are using Thingsboard as the IOT Dashboard.&nbsp;&nbsp;It&rsquo;s functional and working in production, but there is no iOS app for it.&nbsp;&nbsp;We need to be able to look at things from the mobile dashboard and right now he can&rsquo;t do it.&nbsp;&nbsp;Thingsboard does support an iOS app, but it need to be customized and published on the app store for employess to download and use.\nwe are using Thingsboard Cloud PE version 3.6.2PE+\nOur thingsboard API endpoint is&nbsp;&nbsp;https://thingsboard.cloud\n# 🖌️Design\nThe iOS app is already built, (Github repo below) it just need to be slightly modified and updated.&nbsp;&nbsp;The iconset that needs to be used is here:\n---\n### Download the iOS App from Github\n[ThingsBoard PE Mobile Application Documentation](https://thingsboard.io/docs/pe/mobile/)\n---\n### Customize App Icons\nthen to customize the app with the icons, use this document and iconset. \n[astromarine-icons.zip](https://prod-files-secure.s3.us-west-2.amazonaws.com/899fb3f1-b038-4d61-aa24-3fe4ae1dd69a/47c9ebd6-d61f-4cd8-8e37-0fa07fcd1d50/astromarine-icons.zip)\n[Customize ThingsBoard PE Mobile Application](https://thingsboard.io/docs/pe/mobile/customization/)\n### White label the App\nWhite label the App with the images and colors from the iconset located above.\n[Configure white-labeling in ThingsBoard PE Mobile Application](https://thingsboard.io/docs/pe/mobile/white-labeling/)\n# 🎧Requirements\nExplicit functional and non-functional requirements required pre-approval.\n- [ ]&nbsp;&nbsp;This is an internal-only app, so should be available to just our internal employees.&nbsp;&nbsp;Not sure which way is better, Ad&nbsp;&nbsp;Hoc Distribution or Testflight.&nbsp;&nbsp;Our employees, managers and executives should be able to download the app, not for outside use.\n- [ ]&nbsp;&nbsp;Before publishing, need approval.\n# 🎧Deliverables\n- [ ]&nbsp;&nbsp;Deliver the finished app archive\n- [ ]&nbsp;&nbsp;Publish to testflight internal only (or ad hoc)\n- [ ]&nbsp;&nbsp;Instructions for our internal app manager on how to deploy to our employees\n# Test Cases\n| Given | When | Then | Priority |\n| --- | --- | --- | --- |\n| the download link for the app | logging in | show the main thingsboard Dashboard | HIGH |\n| the app | starting up | splash page has the astromarine logo |&nbsp;&nbsp;|\n|&nbsp;&nbsp;|&nbsp;&nbsp;|&nbsp;&nbsp;|&nbsp;&nbsp;|\n**How will you validate the solution is working correctly?**\nWe will download the app, test to make sure that the icons are installed properly and the splash screen is correct and that it is not publicly available.<b>Skills</b>:        iOS,                     Smartphone,                     Mobile App Development,                     iOS Development            ","link":"https://www.upwork.com/jobs/Customize-and-Publish-existing-iOS-app-for-Thingsboard-Cloud_%7E01386905c2d9778bce?source=rss","processedDate":"2024-03-19T08:44:37.584Z","postedDate":"<b>Posted On</b>: March 12, 2024 03:24 UTC","id":"01386905c2d9778bce"},{"skillset":["Android","App Store Upload","App Store Description"],"title":"Deploy app to production on 10 app stores - Upwork","description":"We have an app we&#039;d like to deploy to production on 10 third party apps. These are the appstores below:\nGalaxy App Store\nApToide\nPalmstore\nXiaomi app store\nLG Smart world\nHuwawei appstore\nSony Apps\nAmazon Appstore\nGetjar\nUptodown\nThe freelancer is expected to create accounts for each appstore and bypass identity verification where necessary.\nAppstore content such as logo, screenshots, text content, etc. will he provided on demand<b>Skills</b>:        Android,                     App Store Upload,                     App Store Description            ","link":"https://www.upwork.com/jobs/Deploy-app-production-app-stores_%7E0181c7e986338965b6?source=rss","processedDate":"2024-03-19T08:44:37.584Z","postedDate":"<b>Posted On</b>: March 10, 2024 06:42 UTC","id":"0181c7e986338965b6"},{"skillset":["JavaScript","Web Development","API Integration","React Native","React","PHP"],"title":"&quot;Senior Full Stack Web and Mobile App Developer.&quot; - Upwork","description":"Senior Full Stack Web and mobile app Developer\nWe are looking for Senior MERN Stack and React Native developer having at least 5 Years of \nworking experience.\nAbout Us\nWe are Buy and Sales force Service base company looking forward to launching our own \nProduct .\nWhat we are looking for\nAt least 5 years of experience with Express/Node.JS \nAt least 5 years of experience using Mongo or similar data storage\nAt least 5 years of building single page applications based on RESTful APIs\nAt least 5 years of React Native experience.\nHave published at least 3 or 4 app to play store and app store.\nKnowledge of React Native Animations.\nFeels comfortable in having standup meeting with Team-mates.\nAbility to look at the big picture: we&#039;re a collaborative small team and expect you to look at the \nbig picture, and proactively anticipate problems, interact with other departments and teammembers, and come up with solutions\nStrong understanding of database design and management\nExperience with databases such as MySQL, MongoDB, DynamoDB, etc.Knowledge of unittesting (TDD/BDD tool i.e. Jasmine, Mocha, Protractor)\nFamiliarity with Git and Git workflow\nExperience with cloud-based technologies such as AWS or Azure\nAggressive problem diagnosis and creative problem-solving skills\nStrong communication and collaboration skills\nAbility to work independently and in a team environment\nAbility to work and thrive in a fast-paced environment, learn rapidly and master diverse web \ntechnologies and techniques\nPreferred Technical and Professional Expertise\nA bachelor&#039;s masters degree or higher in Computer Science or a related technical field.\nAdvanced experience with MERN (MongoDB, Express, REACT,REACT-NATIVE, Node) (5\nyears)\nAbility to Build and Test RESTful APIs (at least 5 years)\nResponsibilities:\n&bull; Develop, test, deploy and maintain web applications using the MERN stack\n&bull; Write clean, efficient, and well-documented code\n&bull; Participate in code reviews and ensure that code meets the company&#039;s coding standards\n&bull; Collaborate with product owners, designers, and other developers to build high-quality \nsoftware\n&bull; Define code architecture decisions to support high-performance products\n&bull; Translate wireframes and PSD Designs into functional web applications\n&bull; Conduct and participate in project planning &amp;amp; scheduling and design discussions\n&bull; Test to ensure efficiency and optimize applications for maximum speed and scalability\n&bull; Mentor and provide guidance to junior developers\n&bull; Integrate data from various back-end services and databases\n&bull; Stay plugged into emerging technologies/industry trends and apply them into operations and \nactivities\n&bull; Maintain responsibility for completion and accuracy of work products\nSkills\nMongoDB, ReactJS, ExpressJS, NodeJs ,NoSQL, SQL\nFull Time\nGender: Male/Female\nMinimum Education: Masters / Bachelors\nCareer Level: Experienced Professional\nMinimum Experience: 5 Years<b>Skills</b>:        JavaScript,                     Web Development,                     API Integration,                     React Native,                     React,                     PHP            ","link":"https://www.upwork.com/jobs/quot-Senior-Full-Stack-Web-and-Mobile-App-Developer-quot_%7E018725ceaec5e89c9b?source=rss","processedDate":"2024-03-19T08:44:37.584Z","postedDate":"<b>Posted On</b>: March 09, 2024 17:47 UTC","id":"018725ceaec5e89c9b"},{"skillset":[],"title":"Expert to Deploy application - Upwork","description":"Hiring Freelancer,\nIf you have experience in Deployment of the application on various app store this is a suitable project for you.\nRole-\nYou have to deploy the application on Play store and App store.\nNote- Only Freelancer needed, agency or team please don&#039;t apply.","link":"https://www.upwork.com/jobs/Expert-Deploy-application_%7E01e87e3264d12e90c0?source=rss","processedDate":"2024-03-19T08:44:37.584Z","postedDate":"<b>Posted On</b>: March 09, 2024 05:44 UTC","id":"01e87e3264d12e90c0"},{"skillset":["Landing Page","Ecommerce Website","Page Speed Optimization","Responsive Design","Shopify Development","Shopify","CSS","HTML","PHP","Web Design"],"title":"Shopify Developer Needed for Customizing ‘Focal’ Theme Based on Existing Figma Design - Upwork","description":"We are in search of an experienced Shopify developer to customize our already purchased &lsquo;Focal&rsquo; theme to align perfectly with our existing Figma design. The project entails a comprehensive suite of tasks ranging from visual customization and responsive design adjustments to advanced feature integration and optimization to ensure an engaging and seamless shopping experience for our global audience. This role requires deep technical proficiency in Shopify and Figma, alongside a strong understanding of e-commerce principles to implement functional, optimized, and visually compelling features.\nResponsibilities:\n1. Theme Customization and Design:\n\t&bull;\tTailor the &lsquo;Focal&rsquo; Shopify theme to match our brand-specific design elements provided in Figma.\n\t&bull;\tEnsure the user interface is responsive and delivers a smooth experience across all devices (mobile, tablet, desktop).\n2. Domain and Hosting Setup:\n\t&bull;\tSupport the configuration of a top-level international domain, ensuring its proper function and connection to our Shopify store.\n\t&bull;\tAdvise on the optimal Shopify plan and assist with hosting setup to meet our business needs.\n3. Feature Development and Integration:\n\t&bull;\tIncorporate essential functionalities including user management, product management, SSL security, CDN acceleration, and caching strategies.\n\t&bull;\tSet up a global CDN to guarantee swift page loads regardless of visitor location.\n4. Marketing and SEO:\n\t&bull;\tImplement email marketing integrations and develop a content-rich news/blog section.\n\t&bull;\tOptimize the site for search engines, ensuring full Google indexation.\n5. User Experience Enhancements:\n\t&bull;\tIntroduce a multi-language feature to cater to a diverse global audience.\n\t&bull;\tIncorporate multiple currency options, enhancing the shopping experience for international customers.\n6. Social Media and Analytics:\n\t&bull;\tEmbed social media sharing options for platforms such as Facebook, Twitter, and Instagram.\n\t&bull;\tDeploy Google Analytics and Facebook Pixel to gather detailed marketing insights and traffic data.\n7. Customer Engagement Features:\n\t&bull;\tDevelop an integrated online customer service system utilizing platforms like WhatsApp, Line, Telegram, etc.\n\t&bull;\tIntroduce product reviews, ratings, and an instant buy-now option to boost engagement and conversions.\n8. Security and Compliance:\n\t&bull;\tEnforce stringent security measures to safeguard user information and prevent data breaches.\n\t&bull;\tImplement comprehensive policies for refunds, privacy, shipping, and terms of service to ensure legal compliance.\n9. Payment and Logistics Integration:\n\t&bull;\tAssist with setting up a variety of payment gateways (stripe, credit cards, digital currencies, etc.).\n\t&bull;\tProvide advice on effective logistics and shipping strategies.\n10. Maintenance and Support:\n\t&bull;\tOffer a full year of maintenance and continuous consultancy services post-launch.\n\t&bull;\tDeliver comprehensive documentation and training for the site management team.\nMilestones &amp;amp; Deliverables:\nMilestone 1: Theme Customization and Initial Setup\n\t&bull;\tDeliverable: Customization of the &lsquo;Focal&rsquo; theme to match the Figma design, with initial setup of domain and hosting.\nMilestone 2: Advanced Features and SEO Optimization\n\t&bull;\tDeliverable: Integration of advanced features as outlined, along with complete SEO optimization and marketing setup.\nMilestone 3: Final Testing, Launch, and Team Training\n\t&bull;\tDeliverable: Completion of final testing, successful store launch, and provision of training materials/sessions for the team.\nMilestone 4: Post-Launch Support and Optimization\n\t&bull;\tDeliverable: Ongoing support, maintenance, and any needed optimizations, ensuring a smooth operational phase.\nApplication Instructions:\nInterested candidates are requested to submit a proposal containing:\n\t&bull;\tA brief introduction about their Shopify and Figma experience.\n\t&bull;\tExamples from their portfolio that demonstrate experience with theme customization, especially with the Shopify &lsquo;Focal&rsquo; theme.\n\t&bull;\tAn outline of their approach to project execution, including strategies for ensuring device responsiveness and international user engagement.\n\t&bull;\tEstimated timelines and budget for achieving the outlined milestones.\nWe&rsquo;re looking for a developer who can not just fulfill the technical requirements but also passionately contribute to our vision of creating an unparalleled online shopping experience. Your expertise will be instrumental in transforming our Figma designs into a live, fully functional Shopify store that stands out in the competitive e-commerce space.<b>Skills</b>:        Landing Page,                     Ecommerce Website,                     Page Speed Optimization,                     Responsive Design,                     Shopify Development,                     Shopify,                     CSS,                     HTML,                     PHP,                     Web Design            ","link":"https://www.upwork.com/jobs/Shopify-Developer-Needed-for-Customizing-Focal-Theme-Based-Existing-Figma-Design_%7E0157a27a4c3f2d9526?source=rss","processedDate":"2024-03-19T08:44:37.584Z","postedDate":"<b>Posted On</b>: March 08, 2024 00:59 UTC","id":"0157a27a4c3f2d9526"},{"skillset":["GPT-4 API","Bubble.io"],"title":"Bubble io expert needed to create an app that uses GPT-4 API - Upwork","description":"The goal of this project is to create a Custom T Shirt Design&nbsp;&nbsp;website and deploy it to Bubble.io. The website will be used to produce custom shirt designs for our shopify store. \nThe user workflow is as follows:\n1. Upload&nbsp;&nbsp;a Shirt Design\n2. Use AI assistant if design is not made \n3. Use Dalee to generate t shirt designs \n4. Save those designs and send them to shopify \nLooking for first prototype within 3-5 Days. Short project at first but there&#039;s an opportunity for additional development and other projects afterwards, including full time work if desired.\nNo agencies please. When applying for the project, please mention your favorite AI tool and whether or not you &#039;ll be using AI to generate the Bubble app<b>Skills</b>:        GPT-4 API,                     Bubble.io            ","link":"https://www.upwork.com/jobs/Bubble-expert-needed-create-app-that-uses-GPT-API_%7E01b585a11ee0a52e3a?source=rss","processedDate":"2024-03-19T08:44:37.584Z","postedDate":"<b>Posted On</b>: March 05, 2024 08:12 UTC","id":"01b585a11ee0a52e3a"},{"skillset":["Python","Game Design","Game Development","Artificial Intelligence","JavaScript","Online Multiplayer","API","WebRTC","Wowza Media Server","GPT-4"],"title":"AI-Hosted Webcam Trivia Game - Upwork","description":"1 - Project Overview:\nCreate a trivia game website with webcam streaming.\nThe game will have an AI host that interacts with players.\n2 - Trivia Game Mechanics:\nImplement user registration, login, player avatar creation, question rounds.\nTrack scores and display leaderboards and jackpot.\n3 - Webcam Streaming:\nIntegrate WebRTC or RTMP for webcam streaming.\nCapture and display player webcams during gameplay with content momitoring.\n4 - AI Host: combination of\nPre-recorded AI Host: Scripted responses.\nLive AI Host (GPT-4): Real-time dynamic interactions.\nContext-Aware AI: Adapt based on game context.\n5 - Frontend and Backend:\nDevelop responsive UI using HTML/CSS/JavaScript.\nSet up APIs for game flow and AI interactions.\nStore data in a database.\n6 - Security and Privacy:\nSecure webcam streams and handle user data safely.\n7 - Testing and Deployment:\nTest components thoroughly.\nDeploy on a cloud platform.\n8 - Monetization:\nads, premium features, or in-app purchases.\nThe following skills will be needed:\nWeb Development Skills:\nFrontend Development:\nHTML, CSS, and JavaScript: Create the user interface (UI) for the website.\nResponsive Design: Ensure the site works well on various devices (desktop, tablet, mobile).\nWebcam Integration: Implement webcam access and video display.\nBackend Development:\nServer-Side Languages: Choose a language like Python (Flask/Django), Node.js, or Ruby on Rails.\nAPI Design: Create RESTful APIs for game flow, user authentication, and AI interactions.\nDatabase Management: Set up and manage databases (e.g., MySQL, PostgreSQL, or MongoDB).\nStreaming media\nStreaming and Video Skills:\nWebRTC or RTMP: Understand how to integrate streaming services for webcam video.\nVideo Encoding and Decoding: Handle video data efficiently.\nMedia Servers: Familiarity with setting up and configuring media servers for streaming.\nNatural language processing\nAI and NLP Skills:\nNatural Language Processing (NLP):\nIf using a live AI host, knowledge of NLP models (e.g., GPT-4).\nUnderstanding context, generating dynamic responses, and adapting based on interactions.\nScripting:\nFor pre-recorded AI hosts, write scripted responses.\nSecurity and Privacy Skills:\nWeb Security: Protect user data, especially webcam streams.\nAuthentication and Authorization: Secure user sessions and validate tokens.\nData Sanitization: Prevent SQL injection and other vulnerabilities.\nProject management\nProject Management and Communication Skills:\nPlanning and Organization: Break down tasks, set milestones, and manage timelines.\nEffective Communication: Coordinate with team members, freelancers, and stakeholders.\nAgile Methodologies: Understand agile practices for iterative development.\nCreativity\nCreativity and Game Design Skills:\nGame Mechanics: Design engaging trivia rounds, scoring, and leaderboards.\nContent Creation: Craft interesting trivia questions and educational tidbits.\nUser Experience (UX): Ensure a smooth and enjoyable player experience.\nOptional Skills:\nMonetization Strategies: Understand how to incorporate ads, subscriptions, or in-app purchases.\nMarketing and Promotion: Promote your trivia game through social media, influencers, and targeted ads.<b>Skills</b>:        Python,                     Game Design,                     Game Development,                     Artificial Intelligence,                     JavaScript,                     Online Multiplayer,                     API,                     WebRTC,                     Wowza Media Server,                     GPT-4            ","link":"https://www.upwork.com/jobs/Hosted-Webcam-Trivia-Game_%7E01a8d43ecbe7e7641a?source=rss","processedDate":"2024-03-19T08:44:37.585Z","postedDate":"<b>Posted On</b>: March 05, 2024 01:52 UTC","id":"01a8d43ecbe7e7641a"},{"skillset":["Node.js","Flutter","iOS","Android"],"title":"Completed Flutter App Publish - Upwork","description":"\nWe are seeking a skilled developer to assist in publishing a recently acquired full app source codehttps://codecanyon.net/item/mova-movie-web-series-live-tv-streaming-flutter-app-script-with-admin-panel/48173430 to both the Apple App Store and Google Play Market. The project includes deploying the backend server, integrating Firebase push notifications, adding localization capabilities to the mobile app, and updating the app&#039;s name and logo for both iOS and Android platforms.\nTasks:\n- Review the current app source code for Flutter(Dart) to understand its structure and functionality.\n- Deploy the backend web server and ensure it is fully operational and secure.\n- Integrate Firebase push notifications to enhance user engagement.\n- Implement localization functionality to make the app accessible in multiple languages.\n- Update the app&#039;s name and logo across iOS and Android platforms to reflect the new branding.\n- Prepare and submit the app to the Apple App Store and Google Play Market, adhering to their guidelines and requirements.\n- Perform thorough testing to ensure that the app functions correctly across different devices and operating systems.\nEstimated time: 1 day<b>Skills</b>:        Node.js,                     Flutter,                     iOS,                     Android            ","link":"https://www.upwork.com/jobs/Completed-Flutter-App-Publish_%7E017acc39d2c59912bb?source=rss","processedDate":"2024-03-19T08:44:37.585Z","postedDate":"<b>Posted On</b>: March 04, 2024 12:04 UTC","id":"017acc39d2c59912bb"},{"skillset":["API Development","Web Application","MySQL","PHP","Web Development","Android","CSS"],"title":"Setup and Customization White Labeled App (Cordova &amp; Pure PHP) - Upwork","description":"We need to set up and customize a ready template from the CodeCanyon. The white-labeled mobile application with the backend and admin panel. The mobile app is written with Cordova and the backend is written with pure PHP.\nCheck out the template:\nhttps://codecanyon.net/item/droptaxi-white-label-taxi-app-software-script/32257649\nRequirements:\n1. Setup and customize applications according to our company such as \n - Colors\n - Logo\n - Add Turkish Langage\n - And other minor customizations.\n2. If there are any bugs in the application fix them.\n3. One small custom feature (To add passenger names while ordering the ride)\n4. Deploy and release applications to the PlayStore and Appstore markets so we will have ready to use product<b>Skills</b>:        API Development,                     Web Application,                     MySQL,                     PHP,                     Web Development,                     Android,                     CSS            ","link":"https://www.upwork.com/jobs/Setup-and-Customization-White-Labeled-App-Cordova-amp-Pure-PHP_%7E0197907ab66746a328?source=rss","processedDate":"2024-03-19T08:44:37.585Z","postedDate":"<b>Posted On</b>: March 01, 2024 13:23 UTC","id":"0197907ab66746a328"},{"skillset":["React","Git","React Native","Android"],"title":"ReactNative Developer w/ Expertise in iOS, Android Builds/Release manager. Good Git skills required. - Upwork","description":"We are seeking a highly skilled and experienced ReactNative frontend developer who possesses expertise in creating and maintaining iOS and Android builds. As part of our development team, you will be responsible for building and maintaining responsive web applications using React.js and ensuring their successful deployment on both iOS and Android platforms. Your experience with the Apple Developer portal, Android development, and mobile integration tools such as AppsFlyer, OneSignal, and Firebase will be crucial in achieving smooth and efficient deployment, distribution, and ongoing maintenance of the applications.\nResponsibilities:\n- Collaborate with the development team to create highly interactive and responsive web applications using React.js.\n- Develop and maintain iOS and Android builds of the web applications.\n- Integrate web applications into mobile platforms, ensuring optimal performance and user experience.\n- Utilize the Apple Developer portal and Android development tools to manage mobile app deployments.\n- Implement mobile tracking and analytics using tools such as AppsFlyer and Firebase.\n- Integrate push notification services, such as OneSignal, into the mobile applications.\n- Optimize applications for maximum speed and responsiveness on mobile devices.\n- Conduct thorough testing and debugging on iOS and Android platforms to identify and fix issues.\n- Collaborate with the design team to ensure consistent branding and visual style across mobile platforms.\n- Deploy and distribute the mobile applications to the relevant app stores (e.g., Apple App Store, Google Play Store).\n- Configure app store listings, including app descriptions, screenshots, and promotional materials.\n- Monitor the app&#039;s performance, user feedback, and crash reports for maintenance and updates.\nRequired Skills and Qualifications:\n- Strong proficiency in React.js and its core principles.\n- Solid understanding of JavaScript, HTML5, CSS3, and responsive design.\n- Experience in creating and maintaining iOS and Android builds.\n- Familiarity with the Apple Developer portal and its submission processes.\n- Proficiency in Android development and knowledge of relevant tools and frameworks.\n- Experience with mobile analytics and tracking tools such as AppsFlyer and Firebase.\n- Knowledge of integrating push notification services like OneSignal.\n- Proficient in version control systems, specifically Git, for managing codebase efficiently.\nFamiliarity with RESTful APIs and asynchronous request handling.\n- Ability to work with UI/UX designers to bridge the gap between graphical design and mobile implementation.\n- Strong problem-solving skills and attention to detail.\n- Excellent communication and collaboration skills.\n- Experience with deploying mobile applications to app stores and managing app store listings.\nPreferred Qualifications:\n- Experience with React Native for mobile app development.\n- Familiarity with mobile app testing and debugging tools.\n- Understanding of mobile app optimization techniques.\n- Knowledge of mobile app security best practices.\nIf you have a true talent for creating stunning, polished UI screens and possess the skills to back it up, we would love to hear from you. Please provide your portfolio and any relevant work samples along with your application.\nPlease note that this is a remote position. Kindly include your availability, expected hourly rate, and preferred communication channels in your application. <b>Skills</b>:        React,                     Git,                     React Native,                     Android            ","link":"https://www.upwork.com/jobs/ReactNative-Developer-Expertise-iOS-Android-Builds-Release-manager-Good-Git-skills-required_%7E016544d35bdd6f3973?source=rss","processedDate":"2024-03-19T08:44:37.585Z","postedDate":"<b>Posted On</b>: February 28, 2024 16:20 UTC","id":"016544d35bdd6f3973"},{"skillset":["JavaScript","Smartphone","iOS","Android","Mobile App Development","Tablet","API","Desktop Application","PHP","Java"],"title":"Application development  - Upwork","description":"Developing an application for schools to track student fees would involve several key steps:\n1. features such as viewing fee statements, making payments, receiving notifications, etc., \n2. **Design**: Create a user-friendly interface for both administrators and parents. Admins need access to comprehensive fee management tools, while parents need a simple interface to view and pay fees.\n3. **Backend Development**: Build a robust backend system to store student data, fee information, payment history, etc.&nbsp;&nbsp;involve databases, APIs for payment gateways, and security measures to protect sensitive information.\n4. **Admin Panel Development**: Develop an admin panel with features like adding/editing student records, generating fee invoices, tracking payments, sending reminders, and generating reports.\n5. **Parent App Development**: Create a mobile application for parents to access their child&#039;s fee information, make payments securely, view payment history, and receive notifications about upcoming due dates or outstanding balances.\n6. **Integration of Payment Gateway**: Integrate a secure payment gateway to facilitate online payments within the app. This involves ensuring compliance with relevant regulations and implementing encryption for secure transactions.\n7. **Testing**: Thoroughly test the application for bugs, usability issues, and security vulnerabilities. This includes both automated testing and manual testing by real users.\n8. **Deployment**: Deploy the application to production servers and app stores, ensuring scalability and reliability to handle the expected user load.<b>Skills</b>:        JavaScript,                     Smartphone,                     iOS,                     Android,                     Mobile App Development,                     Tablet,                     API,                     Desktop Application,                     PHP,                     Java            ","link":"https://www.upwork.com/jobs/Application-development_%7E01fe9eebf6477ff1ed?source=rss","processedDate":"2024-03-19T08:44:37.585Z","postedDate":"<b>Posted On</b>: February 23, 2024 15:35 UTC","id":"01fe9eebf6477ff1ed"},{"skillset":["PostgreSQL","iOS Development","Mobile App Bug Fix","Android App Development","In-App Purchases","User Authentication","Ionic Framework","Angular","Java","Mobile App Improvement","Smartphone","iOS","Android"],"title":"PTFlash Solution (Web and Mobile Application) - Upwork","description":"Hi,&nbsp;&nbsp;I&#039;m looking for someone to finish my project.&nbsp;&nbsp;I have a web solution and mobile app that is used by service providers to manage their business. \nBelow is a link to the site.\nwww.ptflash.co.za\nRequirements are: \n1.&nbsp;&nbsp;I&#039;m at the final stretch and need someone to finish my Mobile application and deploy it to IOS and Android store.&nbsp;&nbsp;In order to deploy to Apple store I have to add the ability to Delete Account.&nbsp;&nbsp;\n2. I also need some additional information to be displayed on the enrolments listing on the Web.&nbsp;&nbsp;\n3. I also need a payment gateway to be integrated.&nbsp;&nbsp;&nbsp;(OZOW). \nPlease let me know whether this will be something that you will be able to do.&nbsp;&nbsp;<b>Skills</b>:        PostgreSQL,                     iOS Development,                     Mobile App Bug Fix,                     Android App Development,                     In-App Purchases,                     User Authentication,                     Ionic Framework,                     Angular,                     Java,                     Mobile App Improvement,                     Smartphone,                     iOS,                     Android            ","link":"https://www.upwork.com/jobs/PTFlash-Solution-Web-and-Mobile-Application_%7E0148d123d770025ca9?source=rss","processedDate":"2024-03-19T08:44:37.585Z","postedDate":"<b>Posted On</b>: February 22, 2024 15:21 UTC","id":"0148d123d770025ca9"},{"skillset":[],"title":"Develop User-Friendly AI Bot for Software Documentation - Upwork","description":"We seek a skilled and experienced freelancer to develop a user-friendly AI bot (DBSSBot) trained on our software documentation (user manual) and hosted on our own servers. The bot will answer user queries and provide informative responses, including embedded pictures and videos.\nResponsibilities:\nChoose and set up Amazon Bedrock.\nSet up Amazon Lex:\nCreate a new Lex bot and configure its channels (e.g., web chat, messaging app).\nDesign the conversation flow, intents, and slots to understand user queries.\nTrain the bot:\nExtract key information and entities from our user manual.\nCraft training phrases and corresponding responses that accurately address user questions.\nTest and refine the bot&#039;s performance through iterative training cycles.\nIntegrate multimedia:\nStore images and videos in a suitable location (e.g., AWS S3).\nImplement techniques to display images and videos within the bot&#039;s responses (e.g., linking or embedding).\nDeploy the bot:\nIntegrate the trained bot with our existing infrastructure on our servers.\nConduct thorough testing to ensure seamless operation and user experience.\nQualifications:\nStrong experience with Amazon Lex and its capabilities.\nSolid understanding of Natural Language Processing (NLP) concepts and techniques.\nProficiency in designing conversational flows and crafting chatbot dialogues.\nExperience integrating multimedia content into chatbots.\nFamiliarity with cloud-based deployment and server integration.\nExcellent communication and collaboration skills.\nAdditional Information:\nPlease provide links to your relevant portfolio or past projects.\nDescribe your experience with similar NLP projects, particularly those involving chatbot development and multimedia integration.\nOutline your approach to ensuring data security and user privacy throughout development.","link":"https://www.upwork.com/jobs/Develop-User-Friendly-Bot-for-Software-Documentation_%7E0132c02b1dbd5eaad9?source=rss","processedDate":"2024-03-19T08:44:37.585Z","postedDate":"<b>Posted On</b>: February 21, 2024 20:21 UTC","id":"0132c02b1dbd5eaad9"},{"skillset":["Node.js","MongoDB","React","Web Development","JavaScript","Web Design","PHP","HTML","Web Application","Adaptive Web Design"],"title":"Website/Web App Developer - Upwork","description":"We are looking for a skilled website/web app developer to assist in building a platform for scheduling bike rides with other people. The ideal candidate should have experience in developing responsive and user-friendly websites or web apps. Some key requirements for this project include:\n1. Set Up the Environment:\n* Use a web framework (e.g., React for the frontend).\n* Choose a backend technology (e.g., Node.js with Express).\n* Select a database (e.g., MongoDB).\n2. Frontend Development:\n* Design the UI/UX.\n* Implement React components for registration, login, event creation, event listing, and profile management.\n3. Backend Development:\n* Implement user authentication (e.g., JWT for secure login).\n* Create API endpoints for user registration, login, event creation, event listing, and profile updates.\n* Integrate with the database to store and retrieve data.\n4. Database Design:\n* Users collection (with fields for username, password, email, etc.).\n* Events collection (with fields for event details, location, date, creator, etc.).\n* Sign-ups collection (linking users with events they&#039;ve signed up for).\n5. Search Functionality:\n* Implement search logic to filter events by geographic region.\n6. Testing and Validation:\n* Ensure all functionalities work as expected.\n* Validate inputs on both client and server sides.\n7. Deployment:\n* Choose a hosting platform.\n* Deploy the frontend and backend.<b>Skills</b>:        Node.js,                     MongoDB,                     React,                     Web Development,                     JavaScript,                     Web Design,                     PHP,                     HTML,                     Web Application,                     Adaptive Web Design            ","link":"https://www.upwork.com/jobs/Website-Web-App-Developer_%7E0187faa0911271a19a?source=rss","processedDate":"2024-03-19T08:44:37.585Z","postedDate":"<b>Posted On</b>: February 21, 2024 19:17 UTC","id":"0187faa0911271a19a"},{"skillset":["React Native","JavaScript","React","Android"],"title":"PWA Development and Deployment Expert using Vite React - Upwork","description":"PLEASE SHOW YOUR PREVIOUS PROJECT ON HIRING LETTER! :)\nWe are seeking a skilled developer who can create a Progressive Web App (PWA) using Vite React JS and deploy it to the Google Store. The project involves converting existing code written in vanilla JS\ninto a PWA. \nThis is the code in Vanilla JS: https://github.com/catchspider2002/periodic-table.io\nand this is the application: https://ru.periodic-table.io/\nThe ideal candidate should have a solid understanding of Vite React and experience with PWA development and deployment. Attention to detail and the ability to follow instructions are crucial for this job. The successful candidate will work closely with our team to deliver a high-quality PWA that meets our requirements:\nTECHNICAL SPECIFICATIONS\nThe software &amp;quot;Periodic Table&amp;quot; is designed as a mobile application that runs on all devices supporting the Google Play platform. The &amp;quot;Periodic Table&amp;quot; software should support and adaptively work on screens with HD, Full HD, and 4K resolutions.\nThe operation of the &amp;quot;Periodic Table&amp;quot; software (navigation through the table, element selection, accessing the settings tab, etc.) can be done by touching the display of a touchscreen device. Alternative control of the software can be achieved by pressing corresponding buttons on a wireless remote control. The software control allows highlighting selected chemical elements, activating voice guidance with informational audio materials, adjusting the volume of audio playback, and managing other parameters according to the specifications.\nOn the main screen of the &amp;quot;Periodic Table&amp;quot; software, the Supplier should display the logo of the Customer.\nThe interface of the &amp;quot;Periodic Table&amp;quot; software by default includes the Russian and English languages, and it has the capability to expand the language base.\nIn the developed &amp;quot;Periodic Table&amp;quot; software, it is necessary to implement the entire interface and all functions reflected on the website: https://ru.periodic-table.io/. <b>Skills</b>:        React Native,                     JavaScript,                     React,                     Android            ","link":"https://www.upwork.com/jobs/PWA-Development-and-Deployment-Expert-using-Vite-React_%7E01353f120fff72d712?source=rss","processedDate":"2024-03-19T08:44:37.585Z","postedDate":"<b>Posted On</b>: February 21, 2024 12:24 UTC","id":"01353f120fff72d712"},{"skillset":["Flutter","Mobile App Development"],"title":"Requirement: Experienced Flutter Developer/Freelancer (Long-term Project) - Upwork","description":"One of our premier subsidiary digital entertainment brands located within the UK has recently created a requirement for an experienced Flutter developer to help support the ongoing development and maintenance of a new mobile app which is currently undergoing active production.\nWe are looking for an individual who has strong capabilities and expertise in Flutter development and Firebase database configuration.\nThe objectives included within this position, would include:\n- Restructuring certain areas of functionality within our existing application\n- Adjusting UI elements to meet our branding requirements.\n- To help extend and scale our app, based on features we&#039;ve created within the backend of our application.\n- To integrate WebView experiences in to our app.\n- To help deploy, test and eventually perform the final build of our app, to meet App Store requirements.\nOther Requirements:\n- Applying individuals must have strong English communication skills.\n- We do not accept invitations from agencies - We will only consider applications from freelancers.<b>Skills</b>:        Flutter,                     Mobile App Development            ","link":"https://www.upwork.com/jobs/Requirement-Experienced-Flutter-Developer-Freelancer-Long-term-Project_%7E01e614f957082d1f11?source=rss","processedDate":"2024-03-19T08:44:37.585Z","postedDate":"<b>Posted On</b>: February 20, 2024 15:38 UTC","id":"01e614f957082d1f11"},{"skillset":["Android","React Native","Smartphone","Mobile App Development","iOS"],"title":"React-native app deployment on google play store - Upwork","description":"We are looking for a skilled professional to deploy a React-native app on the Google Play Store. The app needs to connect with a Google Virtual Machine (VM) instance as a server. The job requires proficiency in React-native app development and experience with Google Play Store deployment. The successful candidate should have expertise in the following areas:<b>Skills</b>:        Android,                     React Native,                     Smartphone,                     Mobile App Development,                     iOS            ","link":"https://www.upwork.com/jobs/React-native-app-deployment-google-play-store_%7E014ae4df79ecc0cd60?source=rss","processedDate":"2024-03-19T08:44:37.585Z","postedDate":"<b>Posted On</b>: February 18, 2024 16:19 UTC","id":"014ae4df79ecc0cd60"},{"skillset":["React Native","JavaScript","Android App Development","Firebase Cloud Firestore","Android","Mobile App Development","Firebase"],"title":"App update Bigbucket Firebase deploy code and update new version .  - Upwork","description":"Need to update my Android app and update it on my play store. Codes on big bucket and firebase database used need to deploy and update.<b>Skills</b>:        React Native,                     JavaScript,                     Android App Development,                     Firebase Cloud Firestore,                     Android,                     Mobile App Development,                     Firebase            ","link":"https://www.upwork.com/jobs/App-update-Bigbucket-Firebase-deploy-code-and-update-new-version_%7E016dd2768dfc709f82?source=rss","processedDate":"2024-03-19T08:44:37.585Z","postedDate":"<b>Posted On</b>: February 18, 2024 16:47 UTC","id":"016dd2768dfc709f82"},{"skillset":["API Integration","MySQL","JavaScript","Web Development","GitLab","PostgreSQL","API Development","GitHub","Amazon EC2","Stripe","Payment Functionality","AWS CodeDeploy","PayPal"],"title":"App upload to app stores - Upwork","description":"Need senior developer to upload app into app store. I have current version on my cellphone. A successful upload is fixing app store issues due to old api etc. The app is now not functioning normally. Now, we need an expert to fix bugs, test and upload to both app stores. \nThanks\nIsaac<b>Skills</b>:        API Integration,                     MySQL,                     JavaScript,                     Web Development,                     GitLab,                     PostgreSQL,                     API Development,                     GitHub,                     Amazon EC2,                     Stripe,                     Payment Functionality,                     AWS CodeDeploy,                     PayPal            ","link":"https://www.upwork.com/jobs/App-upload-app-stores_%7E01c81b82cbcd27fb51?source=rss","processedDate":"2024-03-19T08:44:37.585Z","postedDate":"<b>Posted On</b>: February 17, 2024 20:57 UTC","id":"01c81b82cbcd27fb51"},{"skillset":["Android","React Native","iOS","Mobile App Development"],"title":"Deploy React native app to app store and google play - Upwork","description":"The app is already developed and it&#039;s working, Your job will be to deploy to app store and google play. <b>Skills</b>:        Android,                     React Native,                     iOS,                     Mobile App Development            ","link":"https://www.upwork.com/jobs/Deploy-React-native-app-app-store-and-google-play_%7E0129093ae289419456?source=rss","processedDate":"2024-03-19T08:44:37.585Z","postedDate":"<b>Posted On</b>: February 17, 2024 18:46 UTC","id":"0129093ae289419456"},{"skillset":["Shopify","Web Development","Web Design","JavaScript","Shopify Apps","Ecommerce Website Development","HTML","Shopify Templates"],"title":"Shopify App Developer - Fitness Store - Upwork","description":"Join our fast-growing fitness brand as a Shopify App Developer. We&#039;re on the lookout for an expert developer to enhance our online presence and create seamless user experiences.\nResponsibilities:\n- Develop, test, and deploy custom Shopify apps.\n- Collaborate with cross-functional teams on app integration.\n- Troubleshoot and optimize app functionality.\nRequirements:\n- Proven experience in Shopify app development.\n- Proficiency in Shopify Liquid, HTML, CSS, JavaScript.\n- Strong problem-solving skills and attention to detail.\nTo demonstrate that you&#039;ve read the complete description, please include &#039;Gym Shark&#039; before starting your cover letters. Also, attach relevant references of your past projects along with your resume<b>Skills</b>:        Shopify,                     Web Development,                     Web Design,                     JavaScript,                     Shopify Apps,                     Ecommerce Website Development,                     HTML,                     Shopify Templates            ","link":"https://www.upwork.com/jobs/Shopify-App-Developer-Fitness-Store_%7E011b2821196c54e47d?source=rss","processedDate":"2024-03-19T08:44:37.585Z","postedDate":"<b>Posted On</b>: February 15, 2024 18:48 UTC","id":"011b2821196c54e47d"},{"skillset":["Android","iOS","React Native","Android App Development","iOS Development","Flutter Stack","Flutter"],"title":"Debug mobile apps and create builds - flutter developer with backend experience. backend-laraval - Upwork","description":"need help with debugging, build and deploy apps to store.&nbsp;&nbsp;someone who has good&nbsp;&nbsp;flutter experience and can take care of backend code setup will be great. do some minor changes to the app.<b>Skills</b>:        Android,                     iOS,                     React Native,                     Android App Development,                     iOS Development,                     Flutter Stack,                     Flutter            ","link":"https://www.upwork.com/jobs/Debug-mobile-apps-and-create-builds-flutter-developer-with-backend-experience-backend-laraval_%7E01df7ae298a4714dae?source=rss","processedDate":"2024-03-19T08:44:37.585Z","postedDate":"<b>Posted On</b>: February 15, 2024 16:08 UTC","id":"01df7ae298a4714dae"},{"skillset":["Shopify","Shopify Theme","Shopify Apps"],"title":"Shopify Expert/Developer needed for Website Re-design - Upwork","description":"Looking for a Shopify Expert who can \n- Deploy a theme to an existing shopify store\n- Set up products and collections as per the new requirement\n- Each product will have multiple variant (attributes) that will exceed shopify limit of 100. To overcome, we have used Advance Variant app but are having some challenges. Need someone else with this situation.\n- Once the product set up is fixed, we will need around 200 products to be set up using Advance Variant app configuration/rules\n- Will need some design help to beautify the site with new banners, collection designs, etc.\n- May require some customization to support other custom requirements.\n- The new theme link is - https://new-ella-demo.myshopify.com/?fts=0\nAdditional details will be shared to selected participants over a meeting. Please provide your availability for a meeting within your bid proposal.\nThe total budget of this project is no more than $150. \nThe total timeframe is within 2 weeks i.e. by Feb 23. This time includes review and updates.\nDo not bid if you are not experienced with Shopify backend development and configuration.\nWill need atleast 5 shopify store links along with screenshots of the backend for those store for you to be considered.\nFor selected candidate, this may results into ongoing work for other shopify sites that we manage.\nGood luck.<b>Skills</b>:        Shopify,                     Shopify Theme,                     Shopify Apps            ","link":"https://www.upwork.com/jobs/Shopify-Expert-Developer-needed-for-Website-design_%7E01c0c56bf8618bfb7f?source=rss","processedDate":"2024-03-19T08:44:37.585Z","postedDate":"<b>Posted On</b>: February 14, 2024 22:02 UTC","id":"01c0c56bf8618bfb7f"},{"skillset":["Node.js","Amazon Web Services","React Native","iOS","Android","Mobile App Development","Hybrid App Development","Chat &amp; Messaging Software"],"title":"React Native Mobile App (Figma already complete) - Upwork","description":"Building a React Native mobile app that can be deployed to both the App Store and PlayStore. \nThe app will have 3 core features: \nUsers can create messages (text, audio, video, uploaded) in the app, that will be scheduled and sent at a later date (the confirmed death of the user).&nbsp;&nbsp;\nUsers can connect assets like bank accounts through Plaid integration, or manually, for the purposes of tracking net worth. Users will also be able to assign beneficiaries of each account or the total assets. \nUsers can edit and customize their profile. They can also create and customize their own event (funeral). \nI have already created the entire UX design in Figma and am in need of backend development expertise to build out the app and deploy to the Apple and Android stores.\nTo be considered, please send me references from App Store apps you&#039;ve built or been a part of deploying.\nWill need to hear your proposed tech stack and reasons why. I&#039;m pushing for AWS credits but open to pursuing Google Cloud or Azure as I have connections to get credits from all. <b>Skills</b>:        Node.js,                     Amazon Web Services,                     React Native,                     iOS,                     Android,                     Mobile App Development,                     Hybrid App Development,                     Chat &amp; Messaging Software            ","link":"https://www.upwork.com/jobs/React-Native-Mobile-App-Figma-already-complete_%7E01792d3a31d5296910?source=rss","processedDate":"2024-03-19T08:44:37.585Z","postedDate":"<b>Posted On</b>: February 14, 2024 10:16 UTC","id":"01792d3a31d5296910"},{"skillset":["React Native","Android","iOS","Smartphone","Mobile App Development"],"title":"React Native App Development - Upwork","description":"We are looking for a skilled React Native developer to build and deploy an existing app on the Android platform. The project requires assistance with publishing the app on the Google Play Store. The ideal candidate should have experience in React Native development, as well as knowledge of the app publishing process on the Play Store. They should be able to work independently and deliver high-quality results within a specified timeframe.<b>Skills</b>:        React Native,                     Android,                     iOS,                     Smartphone,                     Mobile App Development            ","link":"https://www.upwork.com/jobs/React-Native-App-Development_%7E0159f6fdb046ef02bb?source=rss","processedDate":"2024-03-19T08:44:37.585Z","postedDate":"<b>Posted On</b>: January 31, 2024 23:10 UTC","id":"0159f6fdb046ef02bb"},{"skillset":["Swift","Objective-C","Java","Android","iOS","Android App Development","Mobile App Development"],"title":"Mobile App Development - Upwork","description":"Looking for an iOS &amp;amp; Android developer to help us finish add features to our existing apps. PREFER INDIVIDUAL CONTRIBUTORS\nImmediate Need:\n- Add push notifications for in app chats, and triggered notifications\n- Add click to call/text for phone numbers in app\nLong Term Needs:\n- Maintenance\n- Add e-Signature verification\nRequirements:\nCandidate has to be very well versed with universal links, webkit, and app notifications specifically. Nice to have... App deployment automation via fastlane <b>Skills</b>:        Swift,                     Objective-C,                     Java,                     Android,                     iOS,                     Android App Development,                     Mobile App Development            ","link":"https://www.upwork.com/jobs/Mobile-App-Development_%7E010f82a5d22c7370a0?source=rss","processedDate":"2024-03-19T08:44:48.791Z","postedDate":"<b>Posted On</b>: March 06, 2024 23:54 UTC","id":"010f82a5d22c7370a0"},{"skillset":["React Native","Node.js","Android","C++","iOS Development","JavaScript"],"title":"Mobile Software Engineer - Upwork","description":"Seeking a mobile app developer/architect with 3+ years of experience in Android/iOS or frameworks like NativeScript/ReactNative. Proficiency in relevant languages and Agile/Scrum experience required. Previous app release experience preferred.\nBasic Qualifications\n3 or more years of software development/architecture experience building mobile applications using native languages (Android/iOS) and/or frameworks such as NativeScript or ReactNative.\nPreferred Qualifications\n2+ years of experience with iPhone and/or Android development platforms \nDevelopment experience with native iOS Apps: Swift, iOS SDK, and XCODE \nDevelopment experience with native Android Apps: Java and/or Kotlan and Android Studio\nDevelopment experience with RESTful API&#039;s and JSON\nDevelopment experience with NodeJS, JavaScript (ES6) and/or Golang\nExperience with frameworks like NativeScript, Vue, React, Angular 2.x, ReactNative\nStrong understanding of responsive design\nPrevious work in an Agile/Scrum environment\nC / C++ / Golang development is a plus\nParticipated in the release of at least 1 publicly-available app to the Apple App Store\nParticipating from inception to launch using automated tooling like Jenkins or Fastlane<b>Skills</b>:        React Native,                     Node.js,                     Android,                     C++,                     iOS Development,                     JavaScript            ","link":"https://www.upwork.com/jobs/Mobile-Software-Engineer_%7E0161c59e53445042d4?source=rss","processedDate":"2024-03-19T08:44:48.791Z","postedDate":"<b>Posted On</b>: February 27, 2024 08:22 UTC","id":"0161c59e53445042d4"},{"skillset":["Apple Watch","iPad App Development","App Marketplace","Fastlane","Apple Xcode","iOS","iPadOS","Objective-C","Swift","Native App Development","API Integration","iOS Development","Cocoa Touch","Core ML","Machine Learning"],"title":"iOS App Developer - Upwork","description":"Looking for a developer to build a custom calendar mobile app. The purpose of the app is to keep track of different procedures. <b>Skills</b>:        Apple Watch,                     iPad App Development,                     App Marketplace,                     Fastlane,                     Apple Xcode,                     iOS,                     iPadOS,                     Objective-C,                     Swift,                     Native App Development,                     API Integration,                     iOS Development,                     Cocoa Touch,                     Core ML,                     Machine Learning            ","link":"https://www.upwork.com/jobs/iOS-App-Developer_%7E01513e277cc58803cb?source=rss","processedDate":"2024-03-19T08:44:48.791Z","postedDate":"<b>Posted On</b>: February 24, 2024 14:53 UTC","id":"01513e277cc58803cb"},{"skillset":["Apache Cordova","PhoneGap"],"title":"Fix Cordova CI build failure - Upwork","description":"Hey there, we use GitHub Actions and Fastlane to deploy our Cordova apps.\nA while ago, our app stopped deploying for unknown reason. We did not change a thing in the Cordova configuration, ergo we assume the Github Actions containers got updated.\nWe are low on time, so I would like to find a candidate comfortable with Cordova tooling to bring our deploy pipelines back in order.\nI&#039;m attaching the failure message as an image. Please have a look.\nIf you manage to fix this issue, I would like you to help us further by maintaining our Cordova dependencies/configurations.<b>Skills</b>:        Apache Cordova,                     PhoneGap            ","link":"https://www.upwork.com/jobs/Fix-Cordova-build-failure_%7E0161b349389cfe5d21?source=rss","processedDate":"2024-03-19T08:44:48.791Z","postedDate":"<b>Posted On</b>: February 10, 2024 13:37 UTC","id":"0161b349389cfe5d21"},{"skillset":["Apple Watch","iPad App Development","App Marketplace","Fastlane","Apple Xcode","iOS","iPadOS","Objective-C","Swift","Native App Development","API Integration","iOS Development","Cocoa Touch","Core ML","Machine Learning"],"title":"HR Application - Upwork","description":"Introducing a Mobile App Platform for HR Consultation, designed to offer convenient access to HR services, tools, and resources on mobile devices as well as desktop computers. Below are the key features:\nHR Resource Library: Access a variety of HR resources categorized by topics such as recruitment, performance management, etc., aiding in quick problem-solving.\nVR Technology for Recruitment: Enhance recruitment with VR technology and AI, simulating real-life scenarios like interviews, providing automated assessments for informed hiring decisions.\nCandidate Evaluation: AI-powered video evaluation analyzes communication skills, personality traits, providing objective insights for unbiased hiring decisions, saving time and resources.\nTask Manager: Create and manage HR tasks such as recruiting, onboarding, etc., with deadline setting, task assignment, and progress tracking.\nNotifications: Personalized alerts for upcoming HR tasks, deadlines, ensuring timely completion of activities.\nChat/Call with HR Consultants: Direct connection with HR consultants for immediate assistance or consultation.\nReal-time Insights: Access real-time HR data for performance metrics, turnover rates, aiding in data-driven decisions.\nHR News and Trends: Stay updated with the latest industry developments and best practices.\nHR Chatbot: 24/7 support for HR-related queries, providing instant answers and learning from interactions.\nAnalytics and Reporting: Track and analyze HR metrics for informed decision-making.\nMonetization Strategies:\nSubscription-based Model: Charge a monthly or annual fee for access to the platform&#039;s features.\nCommission-based Model: Earn a commission on HR-related services or products purchased through the platform.\nAdvertising Model: Offer advertising opportunities to HR service providers targeting the app&#039;s user base.\nConsulting Model: Utilize the platform as a lead generation tool for consulting services.\nFreemium Model: Offer basic features for free, with premium features available for purchase.\nCombination Model: Combine various monetization models to create a hybrid approach tailored to business goals and user base.\nI am not sure if the above is enough as a starting point, however, I can share more details if required.<b>Skills</b>:        Apple Watch,                     iPad App Development,                     App Marketplace,                     Fastlane,                     Apple Xcode,                     iOS,                     iPadOS,                     Objective-C,                     Swift,                     Native App Development,                     API Integration,                     iOS Development,                     Cocoa Touch,                     Core ML,                     Machine Learning            ","link":"https://www.upwork.com/jobs/Application_%7E01586dfcc647edc22e?source=rss","processedDate":"2024-03-19T08:44:48.791Z","postedDate":"<b>Posted On</b>: February 17, 2024 16:10 UTC","id":"01586dfcc647edc22e"},{"skillset":["Android App Development","Android","Google Play"],"title":"Google play console - Upwork","description":"I want to publish my application in your Google Play console<b>Skills</b>:        Android App Development,                     Android,                     Google Play            ","link":"https://www.upwork.com/jobs/Google-play-console_%7E01bd725d7328c88c49?source=rss","processedDate":"2024-03-19T08:44:54.484Z","postedDate":"<b>Posted On</b>: March 17, 2024 11:15 UTC","id":"01bd725d7328c88c49"},{"skillset":["Android","Android App Development","Google Play","App Store Optimization","Mobile Programming Languages"],"title":"Finding Customer for Google Play Console Published App Selling - Upwork","description":"We have many apps and games deployed on the Google Play console those apps are live and in production, they have many downloads up to 14000. Now we want someone who can find Customers who can Buy our app on Play Store then we transfer the app to Play Store including the certificate password and source code \nanyone can do this by searching customer and transferring to the customer or anyone can buy our apps on Play Console apply here \nif you sell our app we will pay 40% of the app price. or we can pay 100$ per app \nwhen you apply to share your profile on the website or social media<b>Skills</b>:        Android,                     Android App Development,                     Google Play,                     App Store Optimization,                     Mobile Programming Languages            ","link":"https://www.upwork.com/jobs/Finding-Customer-for-Google-Play-Console-Published-App-Selling_%7E017a1c5ecc13f7cab7?source=rss","processedDate":"2024-03-19T08:44:54.484Z","postedDate":"<b>Posted On</b>: March 16, 2024 08:32 UTC","id":"017a1c5ecc13f7cab7"},{"skillset":["Android","Android App Development","Mobile App Development","Google Play","App Store Upload"],"title":"Upload my APP aab to GP store - Upwork","description":"Requirement：\n1. upload my APP aab we provide to your GP account \n2. transfer the app to GP account we provide 3 days after the successful launch of the app\n3. We will make payment 3 days after the app has been successfully transferred to our GP account<b>Skills</b>:        Android,                     Android App Development,                     Mobile App Development,                     Google Play,                     App Store Upload            ","link":"https://www.upwork.com/jobs/Upload-APP-aab-store_%7E014294c4989d581dd0?source=rss","processedDate":"2024-03-19T08:44:54.484Z","postedDate":"<b>Posted On</b>: March 13, 2024 07:21 UTC","id":"014294c4989d581dd0"},{"skillset":["Mobile App Development","Android App Development","Mobile UI Design","Flutter","Kotlin","C++","Google Play","App Store","HTML","Website","iOS Development"],"title":"Looking android app developer to solve my bug - Upwork","description":"Need someone to solve my bug on android project.&nbsp;&nbsp;&nbsp;<b>Skills</b>:        Mobile App Development,                     Android App Development,                     Mobile UI Design,                     Flutter,                     Kotlin,                     C++,                     Google Play,                     App Store,                     HTML,                     Website,                     iOS Development            ","link":"https://www.upwork.com/jobs/Looking-android-app-developer-solve-bug_%7E01c97fbc123c41aef2?source=rss","processedDate":"2024-03-19T08:44:54.484Z","postedDate":"<b>Posted On</b>: March 12, 2024 10:49 UTC","id":"01c97fbc123c41aef2"},{"skillset":["Mobile App Development","Smartphone","iOS","Android","Google Play","Android Things"],"title":"Google Play Console account needed - Upwork","description":"Looking for an individual/Agency with a Google Play Console account for temporary usage. The account should have been created prior to November 23, 2023.<b>Skills</b>:        Mobile App Development,                     Smartphone,                     iOS,                     Android,                     Google Play,                     Android Things            ","link":"https://www.upwork.com/jobs/Google-Play-Console-account-needed_%7E01769731c4bd168439?source=rss","processedDate":"2024-03-19T08:44:54.484Z","postedDate":"<b>Posted On</b>: March 11, 2024 11:39 UTC","id":"01769731c4bd168439"},{"skillset":["Smartphone","Google Play","iOS"],"title":"Mobile app review App Store, $5 - Upwork","description":"We&#039;re offering you $5 for a detailed and honest review of our mobile app on App Store. \nYour personal opinion and feedback are important to us!\nHow to participate:\n1 - Download the Life Assistant application - https://apps.apple.com/app/life-assistant-ela/id6444241517\n2 - Share your experience and leave a review on App Store (minimum 20 words).\nReviews for orders are accepted only from the target audience - North America (USA, Canada), Oceania (Australia, New Zealand), Great Britain, Ireland, the Netherlands, Sweden\nPayment: 5 dollars\nThanks for your time and honest review!<b>Skills</b>:        Smartphone,                     Google Play,                     iOS            ","link":"https://www.upwork.com/jobs/Mobile-app-review-App-Store_%7E01660e6b9e1e0269b1?source=rss","processedDate":"2024-03-19T08:44:54.484Z","postedDate":"<b>Posted On</b>: March 10, 2024 14:15 UTC","id":"01660e6b9e1e0269b1"},{"skillset":["Android App Development","Android Studio","Android","Java","Smartphone","Google Play","Mobile App Testing","Game Development"],"title":"App developer with Google Play console - Upwork","description":"We&#039;re seeking an adept app developer to assist in deploying our Android application on the Google Play Store. The app development and testing phases are complete, and we&#039;re now ready to launch.\n**Responsibilities:**\n1. **Asset Preparation:** Gather necessary assets and documentation required for app submission.\n2. **Compliance:** Ensure our app meets all Google Play Store requirements and guidelines.\n3. **Submission Management:** Upload the app to the Google Play Console and oversee the submission process.\n4. **Issue Resolution:** Address any feedback or issues raised by the Google Play Console team during the review process.\n5. **Support and Maintenance:** Provide ongoing support and maintenance for app updates and revisions.\n**Requirements:**\n- **Proven Deployment Experience:** Demonstrated experience in deploying Android applications on the Google Play Store.\n- **Familiarity with Google Play Console:** Knowledge of the Google Play Console and its submission process.\n- **Attention to Detail:** Strong attention to detail and ability to adhere to platform guidelines.\n- **Communication Skills:** Excellent communication skills with the ability to provide timely updates on project progress.\n- **Bonus Skills:** Prior experience with app development and knowledge of best practices.\n**How to Apply:**\nIf you meet the requirements and are interested in this opportunity, please submit a proposal outlining your relevant experience and approach to app deployment on the Google Play Store.\n**Note:** We are not requesting access to your Google Play Console account.\nNote:- Send screenshot of Google play console all apps dashbaord.<b>Skills</b>:        Android App Development,                     Android Studio,                     Android,                     Java,                     Smartphone,                     Google Play,                     Mobile App Testing,                     Game Development            ","link":"https://www.upwork.com/jobs/App-developer-with-Google-Play-console_%7E01cad2c41f73b69069?source=rss","processedDate":"2024-03-19T08:44:54.484Z","postedDate":"<b>Posted On</b>: March 10, 2024 12:27 UTC","id":"01cad2c41f73b69069"},{"skillset":["Android","Android App","Google Play"],"title":"GP Console - Upwork","description":"Calling all experienced app publishers! We&#039;re in need of skilled professionals to assist us in launching our apps on the Play Console platform. To qualify, you must have a valid GP Console account with at least three months of activity and prior experience in app publishing. Our compensation structure includes a $50 payout upon the app&#039;s release on the Google Play Market, followed by weekly $50 payments thereafter. Transparency is our priority, ensuring timely payment for your contributions. When applying, please provide screenshots of your GP Console library and a link to your app&#039;s Google Play Market page, if available. Don&#039;t miss out on this exciting opportunity to be part of our app publishing journey. Apply now and join our team today!<b>Skills</b>:        Android,                     Android App,                     Google Play            ","link":"https://www.upwork.com/jobs/Console_%7E01c1c6466104693be1?source=rss","processedDate":"2024-03-19T08:44:54.484Z","postedDate":"<b>Posted On</b>: March 08, 2024 10:38 UTC","id":"01c1c6466104693be1"},{"skillset":["Android","Android App","Google Play","Mobile App"],"title":"Android - Upwork","description":"Seeking Experienced App Publishers for Immediate Collaboration!\nOpportunity: Join our dynamic team to publish apps on the Play Console platform. We&#039;re looking for experienced professionals ready to contribute to our success.\nRequirements: A valid GP Console account is a must, with a minimum of three months of activity. Prior experience in app publishing is crucial to ensure a smooth process.\nCompensation: Enjoy a competitive compensation package starting with a $50 payout on the app&#039;s release day on the Google Play Market. Benefit from continuous financial rewards with weekly $50 payments thereafter.\nApplication Process: To apply, candidates are required to provide screenshots of their GP Console library, demonstrating their expertise and experience. Additionally, if available, include a link to your app&#039;s Google Play Market page to showcase your previous work.\nDon&#039;t Miss This Chance: This is a unique opportunity to leverage your app publishing skills, join a forward-thinking team, and play a pivotal role in our app&#039;s journey to the market.\nApply now to make an impact and become an integral part of our team!<b>Skills</b>:        Android,                     Android App,                     Google Play,                     Mobile App            ","link":"https://www.upwork.com/jobs/Android_%7E01a5a8e9bb59adab9f?source=rss","processedDate":"2024-03-19T08:44:54.484Z","postedDate":"<b>Posted On</b>: March 07, 2024 22:17 UTC","id":"01a5a8e9bb59adab9f"},{"skillset":["Android","Android App","Mobile App","Google Play"],"title":"GPC Android - Upwork","description":"Calling all experienced app publishers! We&#039;re in need of skilled professionals to assist us in launching our apps on the Play Console platform. To qualify, you must have a valid GP Console account with at least three months of activity and prior experience in app publishing. In return, we offer a $50 payout upon the app&#039;s release on the Google Play Market, followed by weekly $50 payments thereafter. When applying, please provide screenshots of your GP Console library and a link to your app&#039;s Google Play Market page, if available. Don&#039;t miss out on this exciting opportunity to be part of our app publishing journey. Apply now and join our team today!<b>Skills</b>:        Android,                     Android App,                     Mobile App,                     Google Play            ","link":"https://www.upwork.com/jobs/GPC-Android_%7E015317f91a0dcf4266?source=rss","processedDate":"2024-03-19T08:44:54.484Z","postedDate":"<b>Posted On</b>: March 06, 2024 18:15 UTC","id":"015317f91a0dcf4266"},{"skillset":["Android","Java","Android App Development","Google Play"],"title":"I want to transfer app from your google play console to my google play console - Upwork","description":"If you have an android app on your google play console and willing to transfer it on my account then contact me, if you don&#039;t have app on your google play console then I can give you app as well <b>Skills</b>:        Android,                     Java,                     Android App Development,                     Google Play            ","link":"https://www.upwork.com/jobs/want-transfer-app-from-your-google-play-console-google-play-console_%7E0140573d163e43c100?source=rss","processedDate":"2024-03-19T08:44:54.484Z","postedDate":"<b>Posted On</b>: March 06, 2024 12:11 UTC","id":"0140573d163e43c100"},{"skillset":["Android","Mobile App Development","Google Play","Android App Development","Java"],"title":"Publish a game app on Google Play Store  - Upwork","description":"I need to publish a game app on Google Play Store. You require a Google developer account with at least one app published. I paid $35 for the upload once the app is &amp;quot;in-live&amp;quot;. <b>Skills</b>:        Android,                     Mobile App Development,                     Google Play,                     Android App Development,                     Java            ","link":"https://www.upwork.com/jobs/Publish-game-app-Google-Play-Store_%7E0183f30749281cedc0?source=rss","processedDate":"2024-03-19T08:44:54.484Z","postedDate":"<b>Posted On</b>: March 06, 2024 03:21 UTC","id":"0183f30749281cedc0"},{"skillset":["Desktop Application Testing","Manual Testing","Smartphone","English","Android","Google Play"],"title":"Complete and record the tasks of the application Android on geo Brazil - Upwork","description":"We have application that need to research under the Brazilian locale.\nThe task is to install applications according to a list of rules with screen recording.\nMore information in the interview process.\nIMPORTANT: Your locale must be in Brazil, have android phone and use mobile internet, NOT wi-fi<b>Skills</b>:        Desktop Application Testing,                     Manual Testing,                     Smartphone,                     English,                     Android,                     Google Play            ","link":"https://www.upwork.com/jobs/Complete-and-record-the-tasks-the-application-Android-geo-Brazil_%7E017343a254b4804fb9?source=rss","processedDate":"2024-03-19T08:44:54.484Z","postedDate":"<b>Posted On</b>: March 05, 2024 10:47 UTC","id":"017343a254b4804fb9"},{"skillset":["Android","Google Play"],"title":"Pulish an app to Google Play Console - Upwork","description":"1. I need to upload my 1 app via your Google play console account.\n2. You can create a draft app and give access to it through the invite to my email address (if you&rsquo;re not sure how to do it, I&rsquo;ll send you instructions from Play Console official website). It doesn&#039;t give me access to your whole account, just to a draft, so don&#039;t worry about safety issues.\n3. Then we wait till the app is live and I update it. As soon as the update is live, you&rsquo;ll get paid - that&#039;s when the job is done, not when the app itself is live first.\n4.If you could helo to pass the close test which needs&nbsp;&nbsp;20 testers who have been opted-in for at least the last 14 days continuously. Then you will get extra pay\nIf you have any questions, please feel free to ask.<b>Skills</b>:        Android,                     Google Play            ","link":"https://www.upwork.com/jobs/Pulish-app-Google-Play-Console_%7E017aa626f284dbd440?source=rss","processedDate":"2024-03-19T08:44:54.485Z","postedDate":"<b>Posted On</b>: March 01, 2024 05:28 UTC","id":"017aa626f284dbd440"},{"skillset":["Mobile App Development","Mobile App Improvement","Google","Google Play","Analytics"],"title":"Google Play Developer Console Consultation - Upwork","description":"Consultation is required from someone who understands how Google Play Developer Console analytics work.\nCurrently, in our Google Play Developer Console for the mobile application, it shows that we have 250 active subscribers, with 80 being Buyers. We have a Free Trial that lasts for 3 days. Technically, it is impossible for 170 people to be on a Free Trial. We want to understand how to interpret the statistics; in which sections to find out how many active paid subscribers we have; why it shows 170 people on an active Free Trial; why Revenue is incorrect.<b>Skills</b>:        Mobile App Development,                     Mobile App Improvement,                     Google,                     Google Play,                     Analytics            ","link":"https://www.upwork.com/jobs/Google-Play-Developer-Console-Consultation_%7E01827e732bfba488a6?source=rss","processedDate":"2024-03-19T08:44:54.485Z","postedDate":"<b>Posted On</b>: March 01, 2024 17:06 UTC","id":"01827e732bfba488a6"},{"skillset":["Google Play","Android","Mobile App Development","iOS"],"title":"App development - Upwork","description":"Confirm ironsource account with google play account. \nYou need to reply to the email from ironsource from the developer&#039;s mail and confirm the account creation. \nPayment by the fact of account approve<b>Skills</b>:        Google Play,                     Android,                     Mobile App Development,                     iOS            ","link":"https://www.upwork.com/jobs/App-development_%7E01e7ba5abf411b1c83?source=rss","processedDate":"2024-03-19T08:44:54.485Z","postedDate":"<b>Posted On</b>: March 01, 2024 15:07 UTC","id":"01e7ba5abf411b1c83"},{"skillset":["Android","iOS","Google Play"],"title":"Urgently Needed: Experienced Developer to Quickly Resolve App Store Publishing Issues - Upwork","description":"Description:\nWe have developed a mobile app using Expo and React Native. While the app is functional, we are encountering specific issues during the publishing process on both the Apple App Store and Google Play Store. We are looking for an experienced developer who can swiftly address these problems and help us successfully publish our app on both platforms.\nResponsibilities:\nDiagnose and fix the issue related to screenshots that is preventing our app from being approved on the Apple App Store.\nResolve the problem that is causing our app to be stuck at the stage of 20 testers on Google Play Store.\nEnsure that all requirements for both platforms are met to achieve successful app publication.\nProvide guidance or recommendations to prevent similar issues in future updates or app releases.\nRequirements:\nStrong experience with Expo and React Native.\nProven track record of resolving app publishing issues on both the Apple App Store and Google Play Store.\nFamiliarity with the latest guidelines and requirements for app submissions on both platforms.\nExcellent problem-solving skills and attention to detail.\nAbility to work quickly and efficiently under tight deadlines.<b>Skills</b>:        Android,                     iOS,                     Google Play            ","link":"https://www.upwork.com/jobs/Urgently-Needed-Experienced-Developer-Quickly-Resolve-App-Store-Publishing-Issues_%7E0133caa80852ee0dde?source=rss","processedDate":"2024-03-19T08:44:54.485Z","postedDate":"<b>Posted On</b>: March 01, 2024 13:55 UTC","id":"0133caa80852ee0dde"},{"skillset":["Dart","Mobile App","Mobile App Development","Flutter","FlutterFlow","Google APIs","Google Maps","Google Maps API","Facebook Graph API","REST API","Firebase Cloud Firestore","Supabase","API","API Integration","Google Play"],"title":"Fix flutterflow issues - Upwork","description":"Hello!\nHamza we did some work over fiverr are you still working? if so id love to have a communication platform as i have an issue i would like fixed.<b>Skills</b>:        Dart,                     Mobile App,                     Mobile App Development,                     Flutter,                     FlutterFlow,                     Google APIs,                     Google Maps,                     Google Maps API,                     Facebook Graph API,                     REST API,                     Firebase Cloud Firestore,                     Supabase,                     API,                     API Integration,                     Google Play            ","link":"https://www.upwork.com/jobs/Fix-flutterflow-issues_%7E01a42eaace4a19ebdd?source=rss","processedDate":"2024-03-19T08:44:54.485Z","postedDate":"<b>Posted On</b>: February 29, 2024 11:52 UTC","id":"01a42eaace4a19ebdd"},{"skillset":["Google Play","App Store Optimization"],"title":"Google Play Console supplier - Upwork","description":"We are looking for a reliable supplier who already has active users of Google Play Console, ready to upload applications to their accounts.\nWhat we are looking for:\nA supplier with an existing database of Google Play Console users. A person willing to upload our applications to the accounts of their clients/users. A responsible and honest partner for long-term cooperation.\nWhat we offer:\nStable work and regular orders for application uploads. Fair and timely payment for each upload.\nIf you have a database of Google Play Console users and are interested in cooperation, please contact us to discuss the details.<b>Skills</b>:        Google Play,                     App Store Optimization            ","link":"https://www.upwork.com/jobs/Google-Play-Console-supplier_%7E019e4de995c9dd7ce4?source=rss","processedDate":"2024-03-19T08:44:54.485Z","postedDate":"<b>Posted On</b>: February 29, 2024 11:51 UTC","id":"019e4de995c9dd7ce4"},{"skillset":["Android","Google Play"],"title":"Publish My app to Google Play - Upwork","description":"\n1. I need to upload my 1 app via your Google play console account\n2. You can create a draft app and give access to it through the invite to my email address (if you&#039;re not sure howto do it, li&#039;l send you instructions from Play Console official website). lt doesn&#039;t give me access to your wholeaccount, iust to a draft, so don&#039;t worry about safety issues.\n3. Then I will update it and we wait till the app goes live.\n4. Help me to pass the close test which needs 20 testers for 14 days\n5.Once the app finally pass the close test and published , you will get paid<b>Skills</b>:        Android,                     Google Play            ","link":"https://www.upwork.com/jobs/Publish-app-Google-Play_%7E012047b47905892fbc?source=rss","processedDate":"2024-03-19T08:44:54.485Z","postedDate":"<b>Posted On</b>: February 27, 2024 01:48 UTC","id":"012047b47905892fbc"},{"skillset":["Dart","Mobile App","Mobile App Development","Flutter","FlutterFlow","Google APIs","Google Maps","Google Maps API","Facebook Graph API","REST API","Firebase Cloud Firestore","Supabase","API","API Integration","Google Play"],"title":"Flutter flow  - Upwork","description":"i want an app by Flutter flow like praktika app but only for English and I want it as mvp right now all I want is two pages one for 3 lessons and the other for a button when I click on it well recorded my voice and answer me voice by connecting it on chat gpt 3.5 or 4 idk what difference between them \nhow many hours it will take and how much it will cost?\ni want it like Praktika app when it answers me as a trainer i think they use prompts make the AI act as a trainer of English with some rules<b>Skills</b>:        Dart,                     Mobile App,                     Mobile App Development,                     Flutter,                     FlutterFlow,                     Google APIs,                     Google Maps,                     Google Maps API,                     Facebook Graph API,                     REST API,                     Firebase Cloud Firestore,                     Supabase,                     API,                     API Integration,                     Google Play            ","link":"https://www.upwork.com/jobs/Flutter-flow_%7E01427670ee85e5e3d6?source=rss","processedDate":"2024-03-19T08:44:54.485Z","postedDate":"<b>Posted On</b>: February 26, 2024 22:36 UTC","id":"01427670ee85e5e3d6"},{"skillset":["API","Mobile UI Design","Firebase","Google Play","Plugin Customization","iOS","Android App Development","Android","iOS Development","Tablet","Flutter"],"title":"Task application development for Android  - Upwork","description":"Task application development for Android make tasks polls survey daily check in login rewards application <b>Skills</b>:        API,                     Mobile UI Design,                     Firebase,                     Google Play,                     Plugin Customization,                     iOS,                     Android App Development,                     Android,                     iOS Development,                     Tablet,                     Flutter            ","link":"https://www.upwork.com/jobs/Task-application-development-for-Android_%7E01314750a825293742?source=rss","processedDate":"2024-03-19T08:44:54.485Z","postedDate":"<b>Posted On</b>: February 25, 2024 15:00 UTC","id":"01314750a825293742"},{"skillset":["Android","Google Play"],"title":"Need to publish my app to Google Play - Upwork","description":"1. I need to upload my 1 app via your Google play console account.\n2. You can create a draft app and give access to it through the invite to my email address (if you&rsquo;re not sure how to do it, I&rsquo;ll send you instructions from Play Console official website). It doesn&#039;t give me access to your whole account, just to a draft, so don&#039;t worry about safety issues.\n3. Then we wait till the app is live and I update it. As soon as the update is live, you&rsquo;ll get paid - that&#039;s when the job is done, not when the app itself is live first.\n4.If you could helo to pass the close test which needs&nbsp;&nbsp;20 testers who have been opted-in for at least the last 14 days continuously. Then you will get extra pay\nIf you have any questions, please feel free to ask.<b>Skills</b>:        Android,                     Google Play            ","link":"https://www.upwork.com/jobs/Need-publish-app-Google-Play_%7E01d6e7d13b820dbc6f?source=rss","processedDate":"2024-03-19T08:44:54.485Z","postedDate":"<b>Posted On</b>: February 22, 2024 01:37 UTC","id":"01d6e7d13b820dbc6f"},{"skillset":["Android","Android App Development","Mobile App Development","Google Play"],"title":"Help reinstate terminated Google Play developer account - Upwork","description":"Our Google Play Developer account has been terminated by a wrong detection from Google; they said that one of our apps contains a billing fraud code. \nTheir detection is completely wrong, and we have submitted an appeal, but we get the same response every time:\n&amp;quot;After reviewing your appeal, we have confirmed our initial decision and will not be able to reinstate your developer account.&amp;quot;\nWe need anyone who has experience with how to get our account reinstated again.\nWe will agree on the budget later on.<b>Skills</b>:        Android,                     Android App Development,                     Mobile App Development,                     Google Play            ","link":"https://www.upwork.com/jobs/Help-reinstate-terminated-Google-Play-developer-account_%7E0176a28e30b4e1844d?source=rss","processedDate":"2024-03-19T08:44:54.485Z","postedDate":"<b>Posted On</b>: February 21, 2024 12:57 UTC","id":"0176a28e30b4e1844d"},{"skillset":["Android","Java","Android App Development","Google Play"],"title":"Google play console account with the 1 application - Upwork","description":"Hi dear,\nwe want to buy the google play console account with the 1 application live and we will pay you for that 150$.\nRequirements: 1) google play console account\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2) at least 1 application\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3) live application scource code and jsk key\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;4) id password of google play console\nafter confirm our order you do not have any access to that account, it mean we are buying the google play console account with 1 application live and scource code. \nplease read the attach file we need this type of ss for the account \n1. Account ss\n2. payment confirm ss (which you has get in the google play console)<b>Skills</b>:        Android,                     Java,                     Android App Development,                     Google Play            ","link":"https://www.upwork.com/jobs/Google-play-console-account-with-the-application_%7E01231ebf6ca83b067a?source=rss","processedDate":"2024-03-19T08:44:54.485Z","postedDate":"<b>Posted On</b>: February 21, 2024 09:33 UTC","id":"01231ebf6ca83b067a"},{"skillset":["Mobile App Development","Apple Xcode","React Native","Microsoft Intune","Android","iOS Development","Google Play"],"title":"Experienced React Native Developer with Microsoft Intune SDK Integration\nExpertise - Upwork","description":"Company Overview\nJ2 Engineering is currently working on an enterprise mobile application project, and we are seeking an experienced React Native developer with a strong background in Microsoft Intune for a short-term, project-based role.\nProject Description\nThe focus of this project is to ensure the successful deployment and management of our existing mobile application within an enterprise environment, with Microsoft Intune compatibility. We have made significant strides in the project and are now seeking a Subject Matter Expert (SME) to validate our distribution approach and assist us in scoping the remaining efforts related to the integration of Intune SDK and Microsoft&rsquo;s Authentication Library (MSAL).\nResponsibilities\n - Review our current mobile application project and distribution strategy\n - Provide expert advice and validation of our approach\n - Assist in scoping the remaining efforts related to Intune SDK and MSAL integration\n - Contribute to software development efforts\nRequirements\n - Proven experience in enterprise mobile app development and distribution\n - Extensive knowledge of React Native\n - in-depth understanding of Microsoft Intune\n - Experience with Intune SDK and Microsoft&rsquo;s Authentication Library (MSAL)\n - Strong problem-solving skills\n - Excellent communication skills\nProject Duration\nThis is a short-term, project-based role with an expected duration of 1 to 3 months. The role can be performed remotely.\nHow to Apply\nInterested SMEs are invited to submit their resume, along with a brief explanation of their relevant experience and why they are interested in this project.<b>Skills</b>:        Mobile App Development,                     Apple Xcode,                     React Native,                     Microsoft Intune,                     Android,                     iOS Development,                     Google Play            ","link":"https://www.upwork.com/jobs/Experienced-React-Native-Developer-with-Microsoft-Intune-SDK-Integration-Expertise_%7E0132af0ff99f159122?source=rss","processedDate":"2024-03-19T08:44:54.485Z","postedDate":"<b>Posted On</b>: February 20, 2024 20:48 UTC","id":"0132af0ff99f159122"},{"skillset":["iOS","Android","App Store Optimization","Google Play","App Store"],"title":"High-growth tech startup seeking App Store / Google Play Compliance Expert/Consultant - Upwork","description":"Description:\nWe are looking for an experienced Mobile App Compliance Consultant to audit our mobile application and provide expert advice on App Store and Google Play compliance. Our goal is to ensure our app adheres to the latest platform guidelines and standards, optimizing for a successful submission and maximizing its visibility and performance on both stores.\nResponsibilities:\n- Conduct an audit of our mobile application.\n- Provide report on compliance with App Store and Google Play guidelines.\n- Offer strategic recommendations to address any compliance issues.\n-Assist with the submission process to both the App Store and Google Play, ensuring a smooth approval process.\nRequirements:\n- Proven experience in mobile app compliance consulting, particularly with App Store and Google Play.\n- Strong understanding of ASO strategies and best practices.\n- Ability to provide actionable insights and recommendations.\nProject Duration:\n- Flexible, based on the audit findings and required consultation hours.<b>Skills</b>:        iOS,                     Android,                     App Store Optimization,                     Google Play,                     App Store            ","link":"https://www.upwork.com/jobs/High-growth-tech-startup-seeking-App-Store-Google-Play-Compliance-Expert-Consultant_%7E014f0da17665d66aac?source=rss","processedDate":"2024-03-19T08:44:54.485Z","postedDate":"<b>Posted On</b>: February 12, 2024 16:47 UTC","id":"014f0da17665d66aac"},{"skillset":["Flutter","Laravel","Firebase","MySQL","Smartphone","App Store","Google Play","Mobile App Development"],"title":"Flutter and laravel developer for food delivery app - Upwork","description":"For already running food delivery app a developer with a really good knowledge at the backed using laravel and at the client (mobile application) using flutter is needed inorder to fix some bugs and improve the backend and the app ui. priority to who already created a food delivery app or something similar.<b>Skills</b>:        Flutter,                     Laravel,                     Firebase,                     MySQL,                     Smartphone,                     App Store,                     Google Play,                     Mobile App Development            ","link":"https://www.upwork.com/jobs/Flutter-and-laravel-developer-for-food-delivery-app_%7E018e00ea6895c3d7cc?source=rss","processedDate":"2024-03-19T08:44:54.485Z","postedDate":"<b>Posted On</b>: January 30, 2024 00:01 UTC","id":"018e00ea6895c3d7cc"},{"skillset":["Smartphone","iOS","Mobile App Development","iOS Development"],"title":"React-Native xcode set up in apple cloud - Upwork","description":"We need CI/CD pipeline files to add to our react-native github rep to apple cloud so we can deploy to TestFlight<b>Skills</b>:        Smartphone,                     iOS,                     Mobile App Development,                     iOS Development            ","link":"https://www.upwork.com/jobs/React-Native-xcode-set-apple-cloud_%7E018a6aa1569112d03f?source=rss","processedDate":"2024-03-19T08:45:05.820Z","postedDate":"<b>Posted On</b>: March 14, 2024 11:59 UTC","id":"018a6aa1569112d03f"},{"skillset":["Objective-C","UIKit","iOS","iOS Development","Mobile App Development"],"title":"Need serious iOS developer to manually reskin across the whole app which is in UIKit, Storyboard.  - Upwork","description":"Need serious iOS developer to manually reskin across the whole app which is in UIKit, Storyboard (while maintaining the same style).\nI&#039;m aiming to reskin the iPhone 15 Pro Model using UIKit with same aesthetic to the iPhone 5s and use Aspect Ratio Scaling to maintain the same UI consistence while scaling UI&#039;s on different iPhones without the UI be stretch. I have an old app created with UIKit, Storyboard &amp;amp; objective-c (without Auto Layout). The UI would have to be reskin across the whole app manually. The app UI mainly have TextField, buttons, screenshot are below with 4 current and the last two showing what the results are suppose to be in the attach file. Need to be a master at handling and reskinning UI/ UX (because some developers have difficult time with reskinning UI /UX).\nOverview, reskin iPhone 15 Pro Model with same UI rules as iPhone5s and then scaling it to other iPhones using Aspect Ratio Scaling (9:19.5). When reskinning, interchange old UI assets with new ones while maintaining the same style. Replace existing UI assets (buttons, backgrounds, fonts, TextField, etc.) with new ones while preserving the overall design. Update Colors and Fonts while keeping the same style. UI assets for reskinning are specifically design for the iPhone 15 Pro model. \nThe first milestone will be reskin/ updating UI/UX across the whole app manually.\nRequirement:\n-Must have high understanding.\n-Must be a master of APIs.\n-Must know APIs integration.\n-Must know iOS, must know objective-c.\n-Must be an independent freelancer (that means no teams).\n-Must have good communication skills.\n-Must know UIKit &amp;amp; Storyboard.\n-Attention to detail to UI aesthetic.\n- Must be exceptionally proficient, experienced, and comfortable with (moving, changing, implementing UI designs images.\n- Must have some concept, knowledge, know-how, and know Apple rules as it pertains to Xcode/ iPhone User Interface (UI)/ iPhone User Experience (UX), iPhone UIkit.&nbsp;&nbsp;\n-If you&#039;re impatient with reskin UI/ UX app, please give this a pass.\n-Must be only available to me.\n-Must know how to submit to TestFlight.\n-Must know how to fix bugs.<b>Skills</b>:        Objective-C,                     UIKit,                     iOS,                     iOS Development,                     Mobile App Development            ","link":"https://www.upwork.com/jobs/Need-serious-iOS-developer-manually-reskin-across-the-whole-app-which-UIKit-Storyboard_%7E0102c007e6f3e14060?source=rss","processedDate":"2024-03-19T08:45:05.820Z","postedDate":"<b>Posted On</b>: March 09, 2024 15:57 UTC","id":"0102c007e6f3e14060"},{"skillset":["TestFlight","Mathematics","Aviation","Federal Aviation Administration"],"title":"🌱Glider tutor needed - Upwork","description":"I want to start flying glider planes this season, and I would like to pre-start with flying in Condor 2 simulator. I was wondering if anyone has experience flying gliders, and would be willing to give me some tips so I can learn as fast as possible\nKeywords: pilot, airplane, aviation<b>Skills</b>:        TestFlight,                     Mathematics,                     Aviation,                     Federal Aviation Administration            ","link":"https://www.upwork.com/jobs/Glider-tutor-needed_%7E0162919232137ffffd?source=rss","processedDate":"2024-03-19T08:45:05.820Z","postedDate":"<b>Posted On</b>: March 09, 2024 09:17 UTC","id":"0162919232137ffffd"},{"skillset":["Database Testing","Bug Tracking &amp; Reports","Smartphone","iOS","Mobile App Testing","Android"],"title":"IOS Mobile App Tester - Upwork","description":"Hello,\nWe are looking for a tester of our iPhone app through TestFlight\nThe app is test preparation for an exam.\nYou would need to test MCQ ( test and quizzes) and flashcards. Report any bugs you will find, and give feedback on usability and user interface. \nPlease apply with the words &amp;quot;TestFlight Ninja&amp;quot; - the job needs to be started immediately and completed in 1-2 days. <b>Skills</b>:        Database Testing,                     Bug Tracking &amp; Reports,                     Smartphone,                     iOS,                     Mobile App Testing,                     Android            ","link":"https://www.upwork.com/jobs/IOS-Mobile-App-Tester_%7E01db3e5158cf8a7ccf?source=rss","processedDate":"2024-03-19T08:45:05.820Z","postedDate":"<b>Posted On</b>: March 08, 2024 16:18 UTC","id":"01db3e5158cf8a7ccf"},{"skillset":["Test Results &amp; Analysis","Annotated Screenshot","Bug Tracking &amp; Reports","Test Execution","QA Testing","Mobile App Testing","Android","iOS"],"title":"Mobile Testing for iOS and Android App - Upwork","description":"Hi there!\nIndie developer needing some extra hands for testing. \nYou&rsquo;ll be given a list of tasks to complete in the app. As you go through them you&rsquo;ll just need to mark them as successful or failed. \nIf successful, I&rsquo;d just like a screenshot of the completed task. \nIf failed, a standard report is necessary, with screenshots, device and platform data, and steps to reproduce. \nMost tasks will need to be done just once (like signing in), but some parts I&rsquo;d like you to complete about 3-5 times to flesh out different scenarios, as things are generated randomly. \nSome of these more vital parts to test include:\n1. Quizzes\n2. In app purchase for multiple items\n3. Subscription flow\n4. Tarot readings\nAll these will be done through either TestFlight or as an internal testing user for Android. <b>Skills</b>:        Test Results &amp; Analysis,                     Annotated Screenshot,                     Bug Tracking &amp; Reports,                     Test Execution,                     QA Testing,                     Mobile App Testing,                     Android,                     iOS            ","link":"https://www.upwork.com/jobs/Mobile-Testing-for-iOS-and-Android-App_%7E017cdf544860c35954?source=rss","processedDate":"2024-03-19T08:45:05.820Z","postedDate":"<b>Posted On</b>: March 06, 2024 14:47 UTC","id":"017cdf544860c35954"},{"skillset":["iOS Development","Native App Development","Firebase","iOS","Swift","Mobile App Development","Tablet"],"title":"Swift developer needed to build realtime location tracker that can run when app is in background - Upwork","description":"The successful candidate will need to develop Swift code for realtime location tracker that can run when app is in background. We intend to have the Swift code run as a package that will be part of an existing app that was built in React Native. The Swift code must run seamlessly with the existing React Native code. Any code that is built must be able to be submitted to TestFlight and pass the Apple review.\nSuccessful candidate must be willing to sign an NDA.<b>Skills</b>:        iOS Development,                     Native App Development,                     Firebase,                     iOS,                     Swift,                     Mobile App Development,                     Tablet            ","link":"https://www.upwork.com/jobs/Swift-developer-needed-build-realtime-location-tracker-that-can-run-when-app-background_%7E01be205e4d335d8c73?source=rss","processedDate":"2024-03-19T08:45:05.820Z","postedDate":"<b>Posted On</b>: March 06, 2024 02:30 UTC","id":"01be205e4d335d8c73"},{"skillset":["iPadOS","iOS","Mobile App Development","iOS Development","Swift","User Authentication","AR Application"],"title":"Experienced AR (LiDAR) Developer Needed for House Scanning App on iOS Mobile &amp; iPad - Upwork","description":"We&#039;re looking for a seasoned developer for our Augmented Reality (AR) application for iOS platforms, specifically targeting iPhones and iPads. We are implementing limited features similar to Poly.cam house scan. Our project aims at elevating the standards of scanning utilities for residential and commercial spaces. This application promises to be a breakthrough in capturing the dimensions of buildings and rooms and creating floor plans. The app will interact with our servers up and down to recommend certain equipment, and AR-project equipment in real-time. The end result is creating a full documentation and some proposals to share with the client.\nWhat we have now &amp;amp; Enhancements Needed:\n- Room Scanning: Our current App can now scan rooms and floor spaces, covering each room. While we&#039;ve reached this milestone, there&#039;s an opportunity to refine and enhance the overall user experience.\n- Dimension Calculations: Automatic calculation of room dimensions including length, width, and height is functional. \n- Volume &amp;amp; Object Recognition: The app automatically calculates room volume and recognizes windows, doors (with measurements and counts), and wall objects like cabinets and pictures. We&#039;re looking to recognize other objects automatically.\nNew Features to Develop:\n- Design and implement an engaging icon and splash screen, accompanied by secure login functionality.\n- Generate a detailed map and plan of the house, incorporating manual annotations or automatic recognition of wall orientations.\n- Facilitate real-time data exchange with a server, including sending and receiving scans, data, and images.\n- Enable users to superimpose 3D objects in the scanned space accurately and project equipment into the room at scale. Enable capture on-demand\n- Ensure source code delivery post each development milestone, with continuous updates made available through Testflight.\n- Conduct thorough testing, refine based on feedback, and prepare the app for a seamless deployment on the App Store.\nDevelopment Milestones:\nThis project will be segmented into 3 pivotal milestones, with payments disbursed upon the successful completion of each phase. The final milestone will encompass 40% of the total budget, reflecting its significance in finalizing the application for market release.\nDesign and User Access: Completion of app design elements including the icon, splash screen, and secure login.\nAdvanced Scanning Features: Enhancement of existing scanning features and development of new functionalities for comprehensive house mapping.\nServer Interaction and 3D Implementation: Development and integration of server communication protocols, alongside the introduction of 3D object superimposition.\nFinalization and Testing: Extensive testing, revisions as necessary, and preparation for deployment on both Android and iOS platforms.\nBudget &amp;amp; Payment:\nThe total budget for this project will be specified, reflecting the comprehensive nature of the development work. Each milestone payment is designed to incentivize progress and ensure alignment with project goals and timelines.\nTerms:\nThe project is expected to reach completion within 3 weeks. Delays might lead to contract nullification or transfer of work to another developer.<b>Skills</b>:        iPadOS,                     iOS,                     Mobile App Development,                     iOS Development,                     Swift,                     User Authentication,                     AR Application            ","link":"https://www.upwork.com/jobs/Experienced-LiDAR-Developer-Needed-for-House-Scanning-App-iOS-Mobile-amp-iPad_%7E01fbd5ce41f5cce24e?source=rss","processedDate":"2024-03-19T08:45:05.820Z","postedDate":"<b>Posted On</b>: March 05, 2024 20:59 UTC","id":"01fbd5ce41f5cce24e"},{"skillset":["Flutter"],"title":"Flutter Developer - Upwork","description":"We need a Flutter Dev for a task\nApp needs uploaded to TestFlight, its having some some of issues uploading through Xcode\nNeeds to be completed NOW<b>Skills</b>:        Flutter            ","link":"https://www.upwork.com/jobs/Flutter-Developer_%7E01ed2e175174ba6d05?source=rss","processedDate":"2024-03-19T08:45:05.821Z","postedDate":"<b>Posted On</b>: March 05, 2024 15:35 UTC","id":"01ed2e175174ba6d05"},{"skillset":["Flutter"],"title":"Flutter Developer - Upwork","description":"We need a Flutter Dev for a task\nWe need the app uploaded to TestFlight. Its having some sort of issue coming in from Xcode. \nNeeds to be completed NOW<b>Skills</b>:        Flutter            ","link":"https://www.upwork.com/jobs/Flutter-Developer_%7E01d5171c4ad023ddef?source=rss","processedDate":"2024-03-19T08:45:05.821Z","postedDate":"<b>Posted On</b>: March 05, 2024 15:34 UTC","id":"01d5171c4ad023ddef"},{"skillset":["React Native","React","JavaScript","iOS","Android","Mobile App Development","Smartphone","Node.js"],"title":"Senior React Native - to Deploy Application - Upwork","description":"We are on the hunt for a skilled React Native Developer to join our innovative tech team. Our project revolves around developing a cutting-edge mobile application designed to enhance user engagement and streamline operational processes. As we gear up to scale our solution, we require a developer who is not only proficient in React Native development but also experienced in deploying apps through CI/CD pipelines on AWS and managing app updates efficiently.\nResponsibilities:\nDevelop and maintain high-quality React Native applications.\nEnsure seamless integration with back-end services.\nCollaborate closely with the design team to understand end-user requirements and translate them into technical specifications.\nImplement automated testing platforms and unit tests as part of the development process.\nLead the deployment process of new app versions to both iOS and Android platforms without downtime or user disruption.\nUtilize AWS services for deploying and managing the application, ensuring high availability and scalability.\nWork with CI/CD tools to automate testing and deployment processes.\nDevelop strategies for app testing without pushing directly to app stores, using tools like TestFlight for iOS and internal testing tracks in Google Play.\nManage app versioning and updates efficiently, ensuring compatibility and smooth transition across app updates.\nMaintain code integrity and organization, including ensuring code compliance with industry standards and best practices.\nQualifications:\n3+ years of experience in React Native development.\nStrong understanding of the React Native framework and its core principles.\nExperience with deployments, CI/CD pipelines (e.g., Jenkins, CircleCI), and AWS services.\nProven track record of deploying apps and managing updates in a live environment.\nFamiliarity with code versioning tools, such as Git.\nKnowledge of modern authorization mechanisms, such as JSON Web Token.\nExperience with automated testing suites, like Jest or Mocha.\nExcellent problem-solving skills and the ability to work under pressure.\nStrong communication and teamwork skills.\nApplication/Bid Requirements:\nResume/CV: Highlighting relevant React Native development experience.\nPortfolio/GitHub Repo: Showcasing your contributions to mobile app projects, especially those involving React Native.\nLinkedIn Profile: To understand your professional background.\nCover Letter: Explaining why you&#039;re the perfect fit for this role, including details of your experience with CI/CD pipelines on AWS and app deployment strategies.\nReferences: Preferably from previous projects or employers in the tech industry.\nJoin us to embark on this exciting journey to revolutionize our digital offerings. If you&#039;re passionate about building scalable, high-performance applications and have a knack for solving complex problems, we&#039;d love to hear from you.<b>Skills</b>:        React Native,                     React,                     JavaScript,                     iOS,                     Android,                     Mobile App Development,                     Smartphone,                     Node.js            ","link":"https://www.upwork.com/jobs/Senior-React-Native-Deploy-Application_%7E014eb0c7bdb2ddce7c?source=rss","processedDate":"2024-03-19T08:45:05.821Z","postedDate":"<b>Posted On</b>: March 01, 2024 15:34 UTC","id":"014eb0c7bdb2ddce7c"},{"skillset":["ARKit","iOS","Swift","In-App Purchases","Apple Xcode"],"title":"(ARKit) Extend functionalities of existing, profitable iOS ARKit app - Upwork","description":"Looking for an expert ARKit iOS developer to lead the expansion of an existing, cash-positive iOS ARKit app.\nThis is a unique opportunity to work on an extremely fun 3D project and add new AI, 3D and XR-based capabilities to an existing app with a large, and established user base. You will also get the chance to learn new technologies such as CoreML, Gen AI, and the Vision Pro.\nYou will work closely with me, the original developer, and throughout the time we work together, we will define the roadmap of next features to implement. Then you&#039;ll get the chance of leading the implementation!\nYour work will include:\n* Prioritizing features against each other based on our interest and users&#039; requests &amp;amp; feedback\n* Coming up with technical solutions and implementing the features\n* Integrating on-device AI\n* Defining the UX for the new features\n* Bugfixes and code maintenance\n* Releasing new versions of the app, and beta testing with Testflight\n* Work on the Vision Pro version of the App\nSkills you should have:\n* Solid, working knowledge of ARKit, iOS, Swift\n* Experience with StoreKit 2\n* Understanding of SceneKit / RealityKit\n* Ability to reason about 3D linear algebra\n* A passion for thinking at the product level, and an eye for design\nIf you&#039;re interested, tell us how you&#039;d go about showing an animated GIF in a SceneKit app, and include the word &amp;quot;CAAnimation&amp;quot; in your reply :)<b>Skills</b>:        ARKit,                     iOS,                     Swift,                     In-App Purchases,                     Apple Xcode            ","link":"https://www.upwork.com/jobs/ARKit-Extend-functionalities-existing-profitable-iOS-ARKit-app_%7E01a6dc79ab16bb7299?source=rss","processedDate":"2024-03-19T08:45:05.821Z","postedDate":"<b>Posted On</b>: February 29, 2024 01:36 UTC","id":"01a6dc79ab16bb7299"},{"skillset":["Flutter","iOS","Dart","Firebase","Mobile App Development","Android"],"title":"Flutter App Bugs - Upwork","description":"I have a Flutter app in TestFlight with a coupleof bugs I need fixed to have back in TestFlight by tomorrow. IOS is getting a white blank screen after login on homepage. In debug mode app fully runs without blank screen crash.<b>Skills</b>:        Flutter,                     iOS,                     Dart,                     Firebase,                     Mobile App Development,                     Android            ","link":"https://www.upwork.com/jobs/Flutter-App-Bugs_%7E0129fc444bb3d8521d?source=rss","processedDate":"2024-03-19T08:45:05.821Z","postedDate":"<b>Posted On</b>: February 28, 2024 07:46 UTC","id":"0129fc444bb3d8521d"},{"skillset":["Flutter"],"title":"Deploy Flutter App to TestFlight - Upwork","description":"We need someone to take our Flutter App File and Deploy to TestFlight so we can test it on iPad<b>Skills</b>:        Flutter            ","link":"https://www.upwork.com/jobs/Deploy-Flutter-App-TestFlight_%7E012c248a6ad56b27a0?source=rss","processedDate":"2024-03-19T08:45:05.821Z","postedDate":"<b>Posted On</b>: February 24, 2024 16:17 UTC","id":"012c248a6ad56b27a0"},{"skillset":["Python","iOS","Swift","iOS Development","Apple Xcode"],"title":"Create experimental mobile app for testing AppAttest Apple technology - Upwork","description":"I need to create testing mobile app, coded on swift(client side) and python(server side). That implements technology Apple AppAttest.\nClient side with only one button &amp;quot;start&amp;quot;. And server side with Python script that interacting with client and writing logs to text file.\nThats it. No need app publishing in AppStore. \nApp testing in - TestFlight.\nMore description in technical task attached.<b>Skills</b>:        Python,                     iOS,                     Swift,                     iOS Development,                     Apple Xcode            ","link":"https://www.upwork.com/jobs/Create-experimental-mobile-app-for-testing-AppAttest-Apple-technology_%7E01809fa96333d9abea?source=rss","processedDate":"2024-03-19T08:45:05.821Z","postedDate":"<b>Posted On</b>: February 21, 2024 23:49 UTC","id":"01809fa96333d9abea"},{"skillset":["Smartphone","Smartwatch","Hybrid App Development","Mobile App Development","React","React Native","iOS","Android","iOS Development"],"title":"App Development with React Native - Upwork","description":"Existing Project needing a developer to continue on.\nApp is built with React &amp;amp; React Native, it&#039;s all functioning but we would like to make changes.\nExperience with TestFlight, good communication skills and full-time availability is essential.<b>Skills</b>:        Smartphone,                     Smartwatch,                     Hybrid App Development,                     Mobile App Development,                     React,                     React Native,                     iOS,                     Android,                     iOS Development            ","link":"https://www.upwork.com/jobs/App-Development-with-React-Native_%7E01e571030ba8670263?source=rss","processedDate":"2024-03-19T08:45:05.821Z","postedDate":"<b>Posted On</b>: February 19, 2024 03:01 UTC","id":"01e571030ba8670263"},{"skillset":["Tablet","Social Media Account Integration","User Authentication","iOS","Smartphone","Database Cataloging"],"title":"Help Publish Developed Mobile App - Upwork","description":"I have a developed .ipa and .apk.&nbsp;&nbsp;I&#039;m looking to learn how to update the app versions through Xcode so I can submit more updated Betas to TestFlight.&nbsp;&nbsp;Would you be able to update the version while I remote watch so I can learn how to upload to Testflight?\nI&#039;ve attached a screenshot of the errors in Xcode I am trying to learn about.<b>Skills</b>:        Tablet,                     Social Media Account Integration,                     User Authentication,                     iOS,                     Smartphone,                     Database Cataloging            ","link":"https://www.upwork.com/jobs/Help-Publish-Developed-Mobile-App_%7E01e99fda8c34d20735?source=rss","processedDate":"2024-03-19T08:45:05.821Z","postedDate":"<b>Posted On</b>: February 16, 2024 21:14 UTC","id":"01e99fda8c34d20735"},{"skillset":["Gaming","Testing","Computer"],"title":"Looking for iPhone users to test a mobile game - Upwork","description":"iPhone users ONLY! Please don&#039;t apply if you do not have an Apple iPhone.\nLooking for iPhone users to play a mobile game and record their session to help test a game in development.\nThe task is simple with the following steps:\n1. Download the app using the testflight link that will be provided\n2. Play the game while recording your iPhone screen and enabling your microphone\n3. You will chat with the characters in the game as part of playing the game\n4. Complete the tasks in the game (will be provided)\n5. Upload the recording to a Google Drive folder that will be provided to you\nThis will take 45-60 minutes.\nVERY IMPORTANT: The game will not run on older iPhone models, so please only apply if you have an iPhone X or older.<b>Skills</b>:        Gaming,                     Testing,                     Computer            ","link":"https://www.upwork.com/jobs/Looking-for-iPhone-users-test-mobile-game_%7E01aa33a83790bfa1ba?source=rss","processedDate":"2024-03-19T08:45:05.821Z","postedDate":"<b>Posted On</b>: February 14, 2024 21:28 UTC","id":"01aa33a83790bfa1ba"}]