[{"skillset":["Implementation","Plugin Customization","System Configuration","Configuration Management","Software Configuration Management","System Installation &amp; Upgrades","Installation Testing"],"title":"Appdynamics Consultant - Upwork","description":"Appdynamic\nLocation: Pune, Hyderabad, Bangalore, Gr Noida\nExp.: 5-10 Years\nBudget: As per Industry Standard\nJD\nExperience on Configuration and customization of AppDynamics solution\nAbility to manage and deliver complete AppDynamics deployments in complex customer environments in quick timelines\nHardcore experience of creating custom configuration and alerting in AppDynamics deployments ensuring end-to-end tool functionality\nExpertise in triage and root cause analysis (RCAs) of issues with collection and analysis of performance metrics as-required to diagnose complex system problems in a timely manner\nAbility to integrate AppDynamics with various supported ITSM, CI/CD and QA/Performance Testing tools\nAbility to create custom dashboards from the AppDynamics tool based on customer requirements\nStrong knowledge of APM KPIs and reporting\nAbility to deliver client PoC/PoV demonstrating tool benefit and capabilities\nAbility to document resolved issues in an effective manner for knowledge management\nAbility to cross-train peers with tool usage and assist in creation of best-practices\nAbility to work independently on multiple assignments, proactively prioritizing focus and effort\nCoordinate with various project stakeholders and partner support teams to ensure seamless tool deployment\n&nbsp;&nbsp;Good Experience in API Tools SoapUI, Postman, jason and XML. ➢ Good knowledge in HTML, CSS &amp;amp; web technologies. ➢ Working experience in rotational shifts 24/7 Production Support. ➢ Flexible to work in Night shifts and L1 and L2 And L3 Production support. ➢ Working as Production Support, attending production calls, troubleshooting the application. ➢ Good understanding of ITIL and ITSM operational processes like Incident Management, Change Management, Problem Management, Release Management and Service Improvements. ➢ Work with QA, Release Management and L2 Support teams to ensure Quality Rollouts ➢ Interacted with business users, collected the requirements, analyzed the requirements, designed and recommended solutions. ➢ I have been involved in all phases of the SDLC (Software Development Life Cycle). ➢ Experience in AGILE Methodologies. ➢ Participate in Scrum Meeting and Sprint Planning Meetings. <b>Skills</b>:        Implementation,                     Plugin Customization,                     System Configuration,                     Configuration Management,                     Software Configuration Management,                     System Installation &amp; Upgrades,                     Installation Testing            ","link":"https://www.upwork.com/jobs/Appdynamics-Consultant_%7E01196f71899482ced1?source=rss","processedDate":"2024-03-19T08:46:03.236Z","postedDate":"<b>Posted On</b>: February 20, 2024 14:19 UTC","id":"01196f71899482ced1"},{"skillset":["Kotlin","Software Architecture &amp; Design","Android","Mobile App Development","AppDynamics"],"title":"QA engineer experienced in AppImage or Tauri - Upwork","description":"We are opensource team ARK Builders:\nhttps://www.ark-builders.dev/\nhttps://github.com/ARK-Builders/\nWe develop cross-platform productivity apps and have several app prototypes already. We need a good QA engineer experienced in any of these:\n* Linux and AppImage\n* Windows and Tauri building\n* GitHub and Dependabot\n* Android<b>Skills</b>:        Kotlin,                     Software Architecture &amp; Design,                     Android,                     Mobile App Development,                     AppDynamics            ","link":"https://www.upwork.com/jobs/engineer-experienced-AppImage-Tauri_%7E017b6c8946962965c6?source=rss","processedDate":"2024-03-19T08:46:03.236Z","postedDate":"<b>Posted On</b>: February 17, 2024 15:55 UTC","id":"017b6c8946962965c6"},{"skillset":["Postman","Oracle APEX"],"title":"Simple project to build a quick AppDynamics Dashboard using RESTAPI endpoints for OCI Gov Cloud - Upwork","description":"Simple test project to build a quick AppDynamics Dashboard using RESTAPI endpoints for OCI Gov Cloud - This exercise needs to be completed in test workspace by end of day today so by Monday 02/19 and for now we just need to identify the endpoints and display the EBS servers details on the APEX dashboards. <b>Skills</b>:        Postman,                     Oracle APEX            ","link":"https://www.upwork.com/jobs/Simple-project-build-quick-AppDynamics-Dashboard-using-RESTAPI-endpoints-for-OCI-Gov-Cloud_%7E0155d52ad8356b03f5?source=rss","processedDate":"2024-03-19T08:46:03.236Z","postedDate":"<b>Posted On</b>: February 16, 2024 13:58 UTC","id":"0155d52ad8356b03f5"},{"skillset":["MySQL","Database","Python","API","Python Script","PostgreSQL"],"title":"Python - junior dev - Upwork","description":"\nWe are seeking a detail-oriented and creative Junior Python Developer to play a key role in an ai project. You will be working on integrating and testing multiple bots and&nbsp;&nbsp;database to provide an intuitive responses + prompt engineering and fine tuning.&nbsp;&nbsp;Your primary focus will be writing clean, efficient, and maintainable code, as well as integrating data storage solutions.\nResponsibilities:\nWrite reusable, testable, and efficient code in Python / Nodejs\nIntegrate user-facing elements with server-side logic.\nBasic front end coding Skills&nbsp;&nbsp;\nImplement data storage solutions with a focus on scalability and data integrity.\nPerform data migration, transformation, and scripting.\nCollaborate on all stages of the development lifecycle, from concept to deployment and maintenance.\nQualifications:\nBachelor&rsquo;s degree in Computer Science, Engineering, or a related field.\nProven experience as a Python Developer (1-2 years preferred).\nFamiliarity with front-end technologies (like JavaScript and HTML5) is a plus.\nStrong understanding of the Python programming language and its ecosystems.\nExperience with Python frameworks (e.g., Django, Flask).\nFamiliarity with some ORM (Object Relational Mapper) libraries.\nBasic understanding of database systems, preferably PostgreSQL.\nAbility to integrate multiple data sources into a single system.\nFamiliarity with AWS services, especially Bedrock, Lambda, and CloudWatch.\nUnderstanding of fundamental design principles behind a scalable application.\nStrong unit test and debugging skills.\nExcellent problem-solving skills and willingness to learn new technologies.<b>Skills</b>:        MySQL,                     Database,                     Python,                     API,                     Python Script,                     PostgreSQL            ","link":"https://www.upwork.com/jobs/Python-junior-dev_%7E0154c15a7342c38682?source=rss","processedDate":"2024-03-19T08:46:09.044Z","postedDate":"<b>Posted On</b>: March 18, 2024 01:19 UTC","id":"0154c15a7342c38682"},{"skillset":["MySQL","Angular",".NET Framework","C#"],"title":"Senior Fullstack Engineer - .Net/C# and Angular - Upwork","description":"We&#039;re looking for a highly skilled senior full-stack engineer (.NET/C# and Angular - bonus: Python) to join our small but mighty team. You will be responsible for developing our employer-facing web app and work alongside our existing engineering team and our founders.\n**Responsibilities**\n- Develop and maintain our web application and APIs, ensuring high performance and responsiveness\n- Manage and optimise container orchestration with Kubernetes (K8s) to streamline deployment and scaling of our applications\n- Create user-friendly, efficient, and visually appealing front-end interfaces\n- Implement best practices for code quality, security, and scalability\n- Continuously monitor and improve application performance and usability\n- Help foster a culture of technical excellence and collaborate with the team to improve software design\n# **Requirements**\n- Strong background in full-stack development, ideally in a startup\n- Deep customer empathy and passion for solving gnarly problems with tech\n- Strong proficiency in .NET/C# and Angular (bonus: Python)\n- Expertise in AWS cloud services (EKS, S3, CloudWatch) and familiarity with cloud architecture best practices\n- Solid understanding and practical experience with Kubernetes for container orchestration\n- Excellent problem-solving abilities and a detail-oriented mindset\n- Strong English communication skills and ability to work collaboratively in a team environment\n- ***Bonus:*** Experience with LLMs (OpenAI, Claude) and vector databases<b>Skills</b>:        MySQL,                     Angular,                     .NET Framework,                     C#            ","link":"https://www.upwork.com/jobs/Senior-Fullstack-Engineer-Net-and-Angular_%7E01cf91fa2d52fb825a?source=rss","processedDate":"2024-03-19T08:46:09.044Z","postedDate":"<b>Posted On</b>: March 15, 2024 04:37 UTC","id":"01cf91fa2d52fb825a"},{"skillset":["Python","Web Crawler","Web Crawling"],"title":"Web Crawler Engineer - Conversational AI startup - Upwork","description":"NinjaTech AI, a conversational AI startup in Palo Alto, California, is seeking an expert-level Web Crawler Engineer to build and maintain a scalable and professional web crawler that adheres to crawler bot requirements. \nOur team of mostly ex-Google and ex-AWS engineers has built a robust conversational AI platform (in Python, AWS environment) which is presently being tested by alpha-users. We offer collaborative, iterative, and team-oriented work environment. Our velocity, scientific rigor, and engineering excellence are exceptional.\nThe ideal candidate:\n- Has experience building web crawlers on AWS infrastructure on a large scale\n- Brings expert-level familiarity with AWS components\n- Is a self-starter who works great independently with excellent communication skills \n- Previously&nbsp;&nbsp;worked in a fast paced startup environment\n- Location: in Pacific Time zone or adjacent/aligned with PDT.\nResponsibilities:\n- Design and develop a scalable web crawler that can systematically crawl the web\n- Ensure that the web crawler adheres to crawler bot requirements\n- Implement and maintain the web crawler on AWS infrastructure\n- Build monitoring dashboards for the web-crawler for debugging and monitoring \n- Monitor the web crawler and troubleshoot any issues\n- Work with other engineers to integrate the web crawler with other systems\n- Keep up-to-date on the latest web crawling technologies.\nQualifications:\n- 5+ years of experience building web crawlers and practical knowledge of web crawling technologies\n- Strong expertise in Service Oriented Architecture (SoA) and uService design\n- Expert-level familiarity with AWS components (Lambda, Dynamo, ECS, ElasticSearch, Cloudwatch, OpenSearch, etc)\n- Familiarity with web crawling frameworks like Scrapy, Beautiful Soup, request-html puppeteer, cheerio, or similar\n- Strong programming skills in Python or Java, Javascript, Node.js\n- Comfortable with Cloud development frameworks such as CDK and/or Terraform\n- Knowledge of HTML, CSS, and JavaScript to navigate and parse web pages.\n- Experience with databases and storage solutions such as non-relational key-value stores as well as relational databases\n- Ability to design and implement robust and efficient data extraction algorithms.\n- Understanding of web technologies and protocols such as HTTP, HTTPS, cookies, and sessions as well as FastAPI frameworks\n- Knowledge of design for scale by leveraging scaling technologies within AWS (or equivalent cloud environments) \n- Knowledge of techniques to handle dynamic web content and to bypass anti-scraping measures\n- Excellent problem-solving, debugging and communication skills.<b>Skills</b>:        Python,                     Web Crawler,                     Web Crawling            ","link":"https://www.upwork.com/jobs/Web-Crawler-Engineer-Conversational-startup_%7E010dc0f1e02408c9c1?source=rss","processedDate":"2024-03-19T08:46:09.044Z","postedDate":"<b>Posted On</b>: March 13, 2024 19:16 UTC","id":"010dc0f1e02408c9c1"},{"skillset":["Amazon Web Services","Node.js","Amazon EC2"],"title":"Aws cloudwatch/nodejs - Upwork","description":"Need a person who can enable access logs of nodejs application which is running in ec2 to be pushed to cloudwatch. I need this to fix today. Will be available at 2pm cst<b>Skills</b>:        Amazon Web Services,                     Node.js,                     Amazon EC2            ","link":"https://www.upwork.com/jobs/Aws-cloudwatch-nodejs_%7E012f65bf1138d44cca?source=rss","processedDate":"2024-03-19T08:46:09.044Z","postedDate":"<b>Posted On</b>: March 13, 2024 16:49 UTC","id":"012f65bf1138d44cca"},{"skillset":["JavaScript","React","React Native","Node.js","Web Application"],"title":"Full Stack Web Developer with React JS and Native App Skills - Upwork","description":"Calling all passionate developers!\nWe&#039;re a pre-launch fitness tech startup seeking a highly skilled contractor to build our Minimum Viable Product (MVP).&nbsp;&nbsp;This is an exciting opportunity to be part of a ground-up project and make a real impact in the fitness industry.\nAbout the Project:\nWe&#039;re developing a user-friendly platform that connects fitness professionals and clients, empowering coaches on obtaining better client outcomes and retention.&nbsp;&nbsp;The MVP will include features like:\n-User profiles and management\n-Secure in-app payment processing\n-Functionality for both clients and fitness professionals\n-A basic communication system\nTech Stack:\nFront-end: React JS\nMobile App: React Native\nBack-end (open to discussion): Node JS, SQL\nCloud Platform: AWS (RDS, Lamda, s3, CloudWatch)\nYour Skills:\n-Proven experience building web and mobile applications (3+ years)\n-Proficiency in React JS and React Native development best practices\n-Solid understanding of JavaScript, HTML5, CSS3, and related technologies\n-Experience working with cloud platforms like AWS is a strong plus\n-Excellent problem-solving skills and a proactive approach\n-Clear communication and ability to collaborate effectively\n-A passion for fitness and innovative technology (a plus!)\nOur Ideal Candidate:\nYou&#039;re a self-motivated developer who thrives in a fast-paced environment. You have a strong understanding of user experience (UX) principles and can translate ideas into clean, efficient code.&nbsp;&nbsp;You&#039;re excited to be part of a passionate team and help bring our vision to life.\nProject Timeline &amp;amp; Budget:\nFlexible on timeline - Please outline your estimated timeframe in your proposal.\nCompetitive budget - Mention your budget range or hourly rate.\nReady to join us?\nIf you&#039;re a talented developer who fits the bill, we encourage you to submit your proposal!&nbsp;&nbsp;Please include your portfolio, relevant experience, and estimated timeline and budget in your application. We look forward to hearing from you!<b>Skills</b>:        JavaScript,                     React,                     React Native,                     Node.js,                     Web Application            ","link":"https://www.upwork.com/jobs/Full-Stack-Web-Developer-with-React-and-Native-App-Skills_%7E0119f7ab65a3ce8aed?source=rss","processedDate":"2024-03-19T08:46:09.044Z","postedDate":"<b>Posted On</b>: March 10, 2024 05:00 UTC","id":"0119f7ab65a3ce8aed"},{"skillset":["Functional Testing","Web Testing","PostgreSQL","Snowflake"],"title":"Quality Assurance Analyst - Upwork","description":"We are seeking a Quality Assurance professional with over 3 years of experience in formal software testing for full life cycle development of online applications.\nResponsibilities:\n- Provide hands-on manual testing on web projects.\n- Test frontend and backend components of existing web projects\n- Create and maintain test plans based on project requirements.\n- Provide task dependencies, priorities, and time estimates.\n- Coordinate work with other team members.\n- Communicate test results to project managers.\n- Identify deficiencies in current processes, technologies, and plan solutions.\n- Document software defects, using a bug tracking system, and report defects to software developers.\n- Monitor bug resolution efforts and track successes.\n- Write, revise and verify quality standards and comprehensive test procedures for software evaluation.\nRequirements:\n- Bachelor&rsquo;s degree in Computer Science or related field equivalent training and professional experience will also be considered.\n- 3+ years of experience with formal software testing in full life cycle development of online applications, with a regular release process and standard software development practice.\n- Proven experience testing client server applications (preferably with Web Clients)\n- Proven experience in testing REST clients\n- Experience with data validation using SQL in PostgreSQL, MySQL, and/or other databases or DWH&rsquo;s like SnowFlake.\n- Experience working with distributed systems and microservices infrastructure\n- Experience with testing apps hosted on AWS services: Lamda / EC2 / S3 / Fargate\n- Experience validating the logs using AWS CloudWatch and New Relic\n- Experience testing Newsletters (asset)\n- Experience with bug tracking software such as JIRA, Quality Center, Bugzilla, or equivalent.\n- Excellent verbal and written communication skills in English.\n- Detail-oriented and strong problem-solving experience. Must be able to quickly identify issues and understand when to escalate them to management.\n- Ability to quickly learn and apply new concepts, principles, and solutions.\n- Focused on quality at all stages of production.\n- Able to adapt to a constrained schedule and perform under pressure.\n- Action-oriented, detail-centric, quality-minded, with strong problem solving and critical thinking skills, and the ability to collaborate with others and handle multiple tasks.\n- Strong organization and time management skills while working in a rapid software development process.\n- ISTQB certification (asset)<b>Skills</b>:        Functional Testing,                     Web Testing,                     PostgreSQL,                     Snowflake            ","link":"https://www.upwork.com/jobs/Quality-Assurance-Analyst_%7E018393e6cfd6fb73b7?source=rss","processedDate":"2024-03-19T08:46:09.045Z","postedDate":"<b>Posted On</b>: March 08, 2024 15:57 UTC","id":"018393e6cfd6fb73b7"},{"skillset":["Amazon Web Services","Amazon EC2","DevOps","Amazon CloudWatch","AWS Lambda","Amazon DynamoDB"],"title":"AWS Monitoring solution implementation - Upwork","description":"I am looking for someone interested in providing me a monitoring solution for my AWS services using Cloudwatch. Based on this work I will be discussing the future of the scope also. <b>Skills</b>:        Amazon Web Services,                     Amazon EC2,                     DevOps,                     Amazon CloudWatch,                     AWS Lambda,                     Amazon DynamoDB            ","link":"https://www.upwork.com/jobs/AWS-Monitoring-solution-implementation_%7E015f3247bb4e1ad92d?source=rss","processedDate":"2024-03-19T08:46:09.045Z","postedDate":"<b>Posted On</b>: March 08, 2024 17:37 UTC","id":"015f3247bb4e1ad92d"},{"skillset":["MongoDB","Amazon Web Services","CI/CD","DevOps","Amazon CloudWatch"],"title":"Devops Needed - Upwork","description":"Novateva es una empresa centrada en el desarrollo de plataformas tecnol&oacute;gicas innovadoras. Con el tiempo, hemos incursionado en el mundo de la programaci&oacute;n web y m&oacute;vil, data science, blockchain e inteligencia artificial. Nos proyectamos como un equipo capaz de afrontar cualquier reto que se presente, siempre comprometidos con cada uno de nuestros clientes. Valoramos el trabajo en equipo, respetamos el talento individual y apoyamos el crecimiento profesional.\nBuscamos un Senior AWS DevOps a tiempo parcial con experiencia en NPM/Yarn para unirse a nuestro equipo durante aproximadamente 15 horas a la semana. El candidato ideal debe hablar y escribir ingl&eacute;s con fluidez y estar disponible para coincidir parcialmente con la zona horaria PST para reuniones y gesti&oacute;n.\nResponsabilidades:\nConfigurar procesos de despliegue y CI/CD.\nConfigurar entornos y servicios de AWS.\nEstablecer monitorizaci&oacute;n y alertas utilizando CloudWatch.\nImplementar reglas de seguridad y gestionar claves privadas de usuario.\nImplementar en puntos finales y configurar desencadenadores para cambios de bucket de S3.\nConfigurar puntos finales lambda, Route53 y VPC.\nProporcionar sugerencias de optimizaci&oacute;n de costes y revisar el gasto.\nHabilidades requeridas:\nAWS CloudFormation, CloudFront, EC2, ElasticBean Stalk, ELB, Lambda, Route53.\nImplementaci&oacute;n de CI/CD.\nMongoDB.\nAWS Kinesis.\nCertificaci&oacute;n AWS.\nHabilidades deseadas:\nCertificaciones AWS<b>Skills</b>:        MongoDB,                     Amazon Web Services,                     CI/CD,                     DevOps,                     Amazon CloudWatch            ","link":"https://www.upwork.com/jobs/Devops-Needed_%7E014cd26e9b0b889543?source=rss","processedDate":"2024-03-19T08:46:09.045Z","postedDate":"<b>Posted On</b>: March 05, 2024 17:06 UTC","id":"014cd26e9b0b889543"},{"skillset":["DevOps","Terraform","AWS Server Migration","Amazon EC2","Docker","AWS CloudFormation","Amazon ECS","Linux System Administration","Amazon Web Services","CI/CD","Kubernetes","Amazon ECS for Kubernetes","DevOps Engineering","AWS CodePipeline","Amazon CloudWatch"],"title":"AWS expert to install DATADOG and DATADOG AGENT  - Upwork","description":"I need urgent support to help a customer to setup Datadog on AWS (the infrastructure is quite elaborated, there are different machines and services) then install the agent.\nIt will be done in videocall, no access will be given,\nfee 400&euro;&nbsp;&nbsp;3/4 hours - tomorrow (9- 12 pm European time)<b>Skills</b>:        DevOps,                     Terraform,                     AWS Server Migration,                     Amazon EC2,                     Docker,                     AWS CloudFormation,                     Amazon ECS,                     Linux System Administration,                     Amazon Web Services,                     CI/CD,                     Kubernetes,                     Amazon ECS for Kubernetes,                     DevOps Engineering,                     AWS CodePipeline,                     Amazon CloudWatch            ","link":"https://www.upwork.com/jobs/AWS-expert-install-DATADOG-and-DATADOG-AGENT_%7E0115a76a5e26ba0911?source=rss","processedDate":"2024-03-19T08:46:09.045Z","postedDate":"<b>Posted On</b>: February 29, 2024 19:10 UTC","id":"0115a76a5e26ba0911"},{"skillset":["DevOps","Amazon Web Services","Kubernetes","Amazon EC2","Amazon ECS","AWS CloudFormation"],"title":"AWS Solution Architect  - ECS-EKS and Spot expert - Upwork","description":"We are seeking a highly skilled AWS Solutions Architect with specialized expertise in Amazon EKS (Elastic Kubernetes Service) and AWS Spot Instances. As a Solutions Architect, you will play a critical role in designing and implementing scalable, reliable, and cost-effective cloud solutions for our clients, with a particular emphasis on Kubernetes orchestration and Spot Instance utilization.\nResponsibilities:\n- Collaborate with customers to understand their business requirements and technical challenges, and design solutions that leverage AWS services, particularly Amazon EKS and Spot Instances.\n- Develop strategies for optimizing cost and performance by leveraging Spot Instances, auto-scaling, and other AWS services for workload orchestration.\n- Provide guidance and best practices for deploying, managing, and scaling containerized applications on AWS, with a focus on reliability, availability, and security.\n- Work closely with development teams to ensure alignment between architecture design and implementation, and provide technical leadership and mentorship as needed.\n- Collaborate with customer account teams, solution architects, and partners to drive the adoption of automation services and help customers achieve their business objectives.\n- Stay current with AWS services, industry trends, and best practices, and continuously identify opportunities to enhance and improve our solutions and offerings\nRequirements:\n- Bachelor&#039;s degree in Computer Science, Engineering, or related field; or equivalent work experience.\n- Extensive experience architecting, designing, and implementing cloud solutions on AWS, with a strong focus on Kubernetes orchestration and containerization.\n- In-depth knowledge of Amazon EKS, including cluster management, and monitoring.\n- Hands-on experience with AWS Spot Instances and expertise in optimizing cost and performance for workloads running on Spot Instances.\n- Proficiency in AWS services such as EC2, IAM, CloudFormation, and CloudWatch.\n- Strong understanding of containerization technologies (Docker, Kubernetes) and microservices architecture.\n- Excellent communication and interpersonal skills, with the ability to effectively engage with technical and non-technical stakeholders at all levels.\n- AWS Certified Solutions Architect - Associate or Professional certification preferred.\n- Experience with DevOps practices, CI/CD pipelines, and infrastructure as code (e.g., Terraform) is a plus.\n- Proven track record of delivering high-quality solutions in a fast-paced, dynamic environment.<b>Skills</b>:        DevOps,                     Amazon Web Services,                     Kubernetes,                     Amazon EC2,                     Amazon ECS,                     AWS CloudFormation            ","link":"https://www.upwork.com/jobs/AWS-Solution-Architect-ECS-EKS-and-Spot-expert_%7E01f7be47c761724b3e?source=rss","processedDate":"2024-03-19T08:46:09.045Z","postedDate":"<b>Posted On</b>: February 28, 2024 12:35 UTC","id":"01f7be47c761724b3e"},{"skillset":["Web Application","Git","Node.js","React","JavaScript","Amazon Web Services"],"title":"Implement changes on the Next.js app with SUI blockchain and deploy to AWS - Upwork","description":"We are seeking a highly skilled Full-Stack Developer with expertise in blockchain technology, specifically the SUI blockchain.\nResponsibilities:\nAnalyze the existing smart contracts on the SUI Blockchain and implement necessary optimizations or feature enhancements.\nWork on the Next.js application to introduce new functionalities.\nEnhance API integrations for better performance and security, focusing on serverless architecture using AWS Lambda.\nUpdate authentication and authorization flows in AWS Cognito.\nImplement data visualization enhancements for more intuitive insights into energy consumption and certificate details.\nCollaborate closely with the team to ensure high code quality and adherence to best practices.\nRequirements:\nProven experience with blockchain development, preferably on the SUI platform.\nExpertise in Next.js, AWS services (Lambda, RedShift, Cognito, EC2, S3, CloudWatch), and serverless architecture.\nStrong knowledge of smart contract development and security.\nExperience with responsive web design and development.\nFamiliarity with AWS SAM or CloudFormation templates.\nProficient in automated testing and CI/CD pipelines.\nExcellent problem-solving skills and attention to detail.<b>Skills</b>:        Web Application,                     Git,                     Node.js,                     React,                     JavaScript,                     Amazon Web Services            ","link":"https://www.upwork.com/jobs/Implement-changes-the-Next-app-with-SUI-blockchain-and-deploy-AWS_%7E01850f1096900eb14b?source=rss","processedDate":"2024-03-19T08:46:09.045Z","postedDate":"<b>Posted On</b>: February 23, 2024 15:42 UTC","id":"01850f1096900eb14b"},{"skillset":["MySQL","Database","Python","API","Python Script","PostgreSQL"],"title":"Python - junior dev - Upwork","description":"\nWe are seeking a detail-oriented and creative Junior Python Developer to play a key role in an ai project. You will be working on integrating and testing multiple bots and&nbsp;&nbsp;database to provide an intuitive responses + prompt engineering and fine tuning.&nbsp;&nbsp;Your primary focus will be writing clean, efficient, and maintainable code, as well as integrating data storage solutions.\nResponsibilities:\nWrite reusable, testable, and efficient code in Python / Nodejs\nIntegrate user-facing elements with server-side logic.\nImplement data storage solutions with a focus on scalability and data integrity.\nElasticsearch install \nPerform data migration, transformation, and scripting.\nCollaborate on all stages of the development lifecycle, from concept to deployment and maintenance.\nQualifications:\nBachelor&rsquo;s degree in Computer Science, Engineering, or a related field.\nProven experience as a Python Developer (1-2 years preferred).\nFamiliarity with front-end technologies (like JavaScript and HTML5) is a plus.\nStrong understanding of the Python programming language and its ecosystems.\nExperience with Python frameworks (e.g., Django, Flask).\nFamiliarity with some ORM (Object Relational Mapper) libraries.\nBasic understanding of database systems, preferably PostgreSQL.\nElasticsearch \nAbility to integrate multiple data sources into a single system.\nFamiliarity with AWS services, especially RDS, Lambda, and CloudWatch.\nUnderstanding of fundamental design principles behind a scalable application.\nStrong unit test and debugging skills.\nExcellent problem-solving skills and willingness to learn new technologies.<b>Skills</b>:        MySQL,                     Database,                     Python,                     API,                     Python Script,                     PostgreSQL            ","link":"https://www.upwork.com/jobs/Python-junior-dev_%7E010bb03480d968bfe9?source=rss","processedDate":"2024-03-19T08:46:09.045Z","postedDate":"<b>Posted On</b>: February 23, 2024 02:42 UTC","id":"010bb03480d968bfe9"},{"skillset":["Amazon Web Services","Kubernetes","Terraform","DevOps","CI/CD Platform","Docker"],"title":"Build AWS infra with Kubernetes and  Terraform - Upwork","description":"We are a chat app using Open AI API \nWe are currently on a VPS\nWe use NodeJS/nextJS - Mongo DB - Elastic Search\nWe need to move to a AWS infra ASAP \n1: Infrastructure Setup\nUtilizing Terraform, I will architect the foundational infrastructure, encompassing essential services such as Amazon EKS, Amazon ECR, VPC configurations, Subnets, Load Balancers, CloudWatch for monitoring, CI/CD pipelines, Kubernetes scripts, configurations, and Elasticsearch setup.\nFollowing the setup, I will seamlessly deploy a basic application onto Kubernetes.\n2) Deployment and Automation\nTransitioning our actual project onto the established infrastructure.\nDeveloping Kubernetes scripts integrated with Lambda functions to automate deployments, ensuring efficient management and seamless updates.<b>Skills</b>:        Amazon Web Services,                     Kubernetes,                     Terraform,                     DevOps,                     CI/CD Platform,                     Docker            ","link":"https://www.upwork.com/jobs/Build-AWS-infra-with-Kubernetes-and-Terraform_%7E01cfbdb7bd3e028003?source=rss","processedDate":"2024-03-19T08:46:09.045Z","postedDate":"<b>Posted On</b>: February 22, 2024 17:46 UTC","id":"01cfbdb7bd3e028003"},{"skillset":["Web Application","AI Agent Development","AI Bot","AI Development","AI Model Integration","JavaScript","Java","HTML","PHP","WordPress"],"title":"Senior Developer Wanted in Argentina - Upwork","description":"Are you located in Argentina? Are you so good at coding that even your bugs are feature requests? If you dream in HTML, speak fluent JavaScript, and consider Node.js your best friend, we&#039;ve got a tech adventure waiting for you!\nSkills We Love:\n- Frontend: HTML, CSS, JavaScript, and the magic of React.\n- Backend: Whisper sweet nothings to Node.js.\n- APIs: Play cupid with Twilio and OpenAI GPT.\n- Database &amp;amp; Cloud: Date nights with AWS (DynamoDB, RDS, Lambda, you name it).\n- DevOps &amp;amp; Monitoring: Docker, GitLab, AWS CloudWatch - the more, the merrier.\nYour Mission, Should You Choose to Accept:\n- Scale our project from cool to &amp;quot;whoa!&amp;quot; using the above tech stack.\n- Collaborate, innovate, and iterate faster than a spinning SSD.\n- Be the tech wizard who turns coffee into code and ideas into reality.\nApply If:\n- You&#039;ve got the skills and can&#039;t wait to show off.\n- You think a good day includes solving problems others haven&#039;t even thought of yet.\n- You&#039;re in Argentina and can tell a good empanada from a great one.<b>Skills</b>:        Web Application,                     AI Agent Development,                     AI Bot,                     AI Development,                     AI Model Integration,                     JavaScript,                     Java,                     HTML,                     PHP,                     WordPress            ","link":"https://www.upwork.com/jobs/Senior-Developer-Wanted-Argentina_%7E012ae8adef0728c45b?source=rss","processedDate":"2024-03-19T08:46:09.045Z","postedDate":"<b>Posted On</b>: February 21, 2024 17:18 UTC","id":"012ae8adef0728c45b"},{"skillset":["Angular","Amazon Web Services","TypeScript","PostgreSQL","JavaScript","Node.js","API","Java","CSS"],"title":"Looking for a senior full-stack developer/engineer that can handle features/stories/bugs  - Upwork","description":"Hello,\nI need senior developer to help me on project that includes both front end and back-end with features/stories/bugs, etc. \nMust be able to start ASAP and provide at least 3 hours daily of job support (may be more or less but to start off). \n2 week agile sprint, this sprint just started today ends next friday. \nAlready have a few stories and bugs to complete. \nMust know front-end and back-end. \nfront-end: HTML, CSS, JS, TS, angular\nback-end: JS, TS, api, microservice\ncloud: AWS, cloudwatch, etc. \nMUST be able to work in my timezone (I am in US, CST timezone) .. its currently around 5:35pm CST here evening time on a Tuesday .. \nIf you are ready and able to help, let me know. This is long-term project, no end in sight, if you perform well we continue for months and/or years on end. \nRegards,\nPranit <b>Skills</b>:        Angular,                     Amazon Web Services,                     TypeScript,                     PostgreSQL,                     JavaScript,                     Node.js,                     API,                     Java,                     CSS            ","link":"https://www.upwork.com/jobs/Looking-for-senior-full-stack-developer-engineer-that-can-handle-features-stories-bugs_%7E01317439e78a263aaa?source=rss","processedDate":"2024-03-19T08:46:09.045Z","postedDate":"<b>Posted On</b>: February 20, 2024 23:28 UTC","id":"01317439e78a263aaa"},{"skillset":["Python","Cloud Architecture","Cloud Engineering","Cloud Implementation","Amazon Web Services","Computer Network","Terraform","Amazon EC2","AWS Lambda"],"title":"AWS VPC Test Environment Setup and Realistic Data Generation  - Upwork","description":"Description:\nWe are seeking an adept professional with a focus on setting up AWS VPC test environments and expertise in generating realistic data. The project involves creating a genuine VPC environment, simulating network components, and implementing tools for meaningful data generation.\nResponsibilities:\nDesign and implement a realistic AWS VPC, configuring subnets, route tables, and security groups.\nLaunch and configure EC2 instances to simulate various components within the network.\nEnable VPC Flow Logs and direct them to a CloudWatch Logs group for centralized storage.\nDevelop scripts or use tools to generate realistic data within the VPC environment.\nEnsure seamless connectivity between the test environment and a MongoDB instance for log storage and analysis.\nRequirements:\nProven experience in setting up AWS VPCs, including configuring subnets, route tables, and security groups.\nStrong background in launching and configuring EC2 instances for simulating realistic network components.\nExpertise in enabling and configuring VPC Flow Logs and directing them to CloudWatch Logs.\nDemonstrated ability to generate realistic data within a simulated environment.\nFamiliarity with MongoDB and the ability to forward and analyze logs within this database.\nScripting skills or experience using tools for data generation and processing.\nPreferred Qualifications:\nPrevious experience in simulating realistic network traffic and generating meaningful data within AWS environments.\nKnowledge of AWS security configurations, IAM roles, and best practices.\nCapability to troubleshoot and optimize data generation scenarios for accurate analysis.<b>Skills</b>:        Python,                     Cloud Architecture,                     Cloud Engineering,                     Cloud Implementation,                     Amazon Web Services,                     Computer Network,                     Terraform,                     Amazon EC2,                     AWS Lambda            ","link":"https://www.upwork.com/jobs/AWS-VPC-Test-Environment-Setup-and-Realistic-Data-Generation_%7E017972b5d9f1aa4022?source=rss","processedDate":"2024-03-19T08:46:09.045Z","postedDate":"<b>Posted On</b>: February 03, 2024 07:06 UTC","id":"017972b5d9f1aa4022"},{"skillset":["Technical Project Management","Project Management","SQL","PostgreSQL","Linux"],"title":"Technical Project Manager - Upwork","description":"Looking for a project manager with experience in managing the weekly sprint for a team of 5 developers. The main tasks include:\n- Create notion cards for reported bugs\n- Basic investigation(debug) of the issue to provide a comprehensive bug report to the team\n- Query Data as required from database to get more information on requests.\n- View Cloudwatch logs for any additional logging needed\n- Assign cards based on ability \n- Notion Board Management\n- Followup with team&nbsp;&nbsp;on critical tasks to ensure they are done in a timely fashion \n- Verify the resolved issue is no longer happening or reopen the card to the dev\n- Report to tech lead on the project to discuss any blocker , issues or way to improve the process <b>Skills</b>:        Technical Project Management,                     Project Management,                     SQL,                     PostgreSQL,                     Linux            ","link":"https://www.upwork.com/jobs/Technical-Project-Manager_%7E019b132a03d976961a?source=rss","processedDate":"2024-03-19T08:46:09.045Z","postedDate":"<b>Posted On</b>: January 26, 2024 14:42 UTC","id":"019b132a03d976961a"},{"skillset":["Amazon Web Services","Configuration Management","Automated Monitoring","DevOps Engineering","Infrastructure Management","System Automation","Ansible","Kubernetes","OpenStack","DevOps","GitLab","Mobile App","WordPress","Deployment Automation","CI/CD"],"title":"Few more DevOps or Platform Engineers: MVP T&amp;M Request Working Agreement - Upwork","description":"Preparing to hire a few more DevOps | Platform | Site Reliability Engineers*\nAvailable Capacity; Spring | Fall?\nScope of Work (DevOps Performance and Platform Engineers SoW): \nAWS + PagerDuty, Gitlab (DevOps &amp;amp; PM tools), Hostbill All Inclusive + OpenStack/StarlingX, and Mobile App (Ie. WordPress plugins) configuration with LLM, or no LLM acceleration?\nSpecify questions: may SME WRITE, rather than request sales calls or &amp;quot;meetings that could have been emails&amp;quot;?\nTwo ec2 instances (cPanel; Gitlab)\nHow many more instances may depend on the minimum acceptable requirement options SMEs suggest based on a minimum viable product (MVP) or scalable configuration?\nLooking forward to SME&#039;s minimum, likely, and maximum MVP estimates:\nHow much to configure AWS + PagerDuty Integrations? [Capability Capacity Objective (Capability Delivery) row 30]\nhttps://www.pagerduty.com/integrations/#Integrations-library\nhttps://support.pagerduty.com/docs/amazon-cloudwatch-integration-guide\nhttps://support.pagerduty.com/docs/amazon-eventbridge-integration-guide\nhttps://support.pagerduty.com/docs/aws-guardduty-integration-guide\nhttps://support.pagerduty.com/docs/aws-cloudtrail-integration-guide\nhttps://support.pagerduty.com/docs/aws-health-dashboard\nhttps://support.pagerduty.com/docs/aws-security-hub-integration-guide-pagerduty\nHow much to configure and install Hostbill All Inclusive + OpenStack/StarlingX? [Capability Capacity Objective (Capability Delivery) row 18]\nhttps://mirror.starlingx.cengn.ca/mirror/starlingx/master/debian/\nhttps://docs.starlingx.io/deploy_install_guides/release/virtual/automated_install.html\nLooking forward to acknowledging receipt of a proposal, and project alignment to refine a possibly acceptable proposal by agreeing on project scope, deliverables, timelines, and other expectations before sending a contract offer.&nbsp;&nbsp;Ie. DevOps or Platform Engineer MVP SoW; if T&amp;amp;M is required, request an hourly working agreement:\nAgreement acceptability/proposal prep budget limitations?\n[ACTION] *PM a request (working agreement prep spreadsheet) to update capability and capacity alignment, as well as refine any open questions to deliberate Acceptable Preferences (8 agreements, 30 potential objectives, and ~40 indicators) prior to onboarding.&nbsp;&nbsp;Update capability/capacity working agreement prep without demanding a sales pitch call (ask questions via chat). Ensure these questions are updated and highlighted (request spreadsheet via PM):\nDelivery cadence: Does your team measure MTTR in minutes (preferable metric, secs?), rather than hours, days, weeks, months, or years?\n [Capability Capacity Agreement (Billing) row four and Indicator (Deliverable Measure) row 38]\nMin, likely, and maximum estimates: Do you require coaching regarding Issue MTTR (Mean Time To Resolution) of 1, 2, or 3-point stories (DoR to DoD per week)? If an issue/story may be too big for 1 pt delivery within measurable minutes (issues resolved per hour metric), may request resizing more points (2 pts: less than an hour, 3 pts: greater than an hour and less than a day, 5 pts: greater than a day, or 8 pts: less than a week) or breaking an issue/story too large (13, 21, 34 or larger size issues delivered per month over a week) to smaller relatively sized story points? [Capability Capacity Agreement (Billing) row four and Indicator (Deliverable Measure) row 38]\nPM: How many relevant engineering delivery capacity hours do you have this and next year? Inform of preferences, like term capacity less than or over six months.\nSoon: STX 9.0 Release Branch (WIP Regression Testing + Release Candidate)\nhttps://docs.starlingx.io/\nhttps://wiki.openstack.org/wiki/StarlingX/Releases\nhttps://review.opendev.org/q/topic:%22r.stx.9.0%22\nhttps://opendev.org/starlingx/openstack-armada-app\nhttps://bugs.launchpad.net/starlingx/+bugs?field.tag=stx.9.0\nhttps://mirror.starlingx.cengn.ca/mirror/starlingx/master/debian/\nhttps://mirror.starlingx.cengn.ca/mirror/starlingx/rc/9.0/ (documentation coming soon)\nhttps://docs.google.com/spreadsheets/d/1aTjYzUkExodfayt-rjTv466jE-DP8b_YjrTHhXW6G9w/\nhttps://docs.google.com/spreadsheets/d/1NjYk9N0whK91nHViB5HFG2C1-XdJ09StVuLMxsz0KAY/\nhttps://docs.google.com/spreadsheets/d/1FMNIfVSRSsdDuWizZzWhZvvcSfYCoiXgW-a3ZxK4-8g/\nApplicant prep enough for hour eval + hour review; two unpaid interview prep hours okay? Request three paid interview hours (budget approval)<b>Skills</b>:        Amazon Web Services,                     Configuration Management,                     Automated Monitoring,                     DevOps Engineering,                     Infrastructure Management,                     System Automation,                     Ansible,                     Kubernetes,                     OpenStack,                     DevOps,                     GitLab,                     Mobile App,                     WordPress,                     Deployment Automation,                     CI/CD            ","link":"https://www.upwork.com/jobs/Few-more-DevOps-Platform-Engineers-MVP-amp-Request-Working-Agreement_%7E01849f3faa7ea1fe34?source=rss","processedDate":"2024-03-19T08:46:09.045Z","postedDate":"<b>Posted On</b>: September 09, 2023 20:49 UTC","id":"01849f3faa7ea1fe34"},{"skillset":["Apache JMeter","Performance Testing","Load Testing"],"title":"Performance Testing Expert in JMeter - Upwork","description":"Required skills:\n● Strong hands-on experience with Jmeter is required.\n● Experience with performance measurement, profiling, and optimization tools and techniques.\n● Excellent knowledge of Java and web technology, including HTTP headers and HTTP verbs (post, get, etc).\n● Very good at designing test frameworks, load simulation models, and load statistics calculations.\n● Very strong in script design/development using Jmeter (Web Protocol) and webServices (over HTTP), with reporting as a plus.\n● Performance engineer should ensure system reliability; capacity and scalability. Analyze test results and coordinate with development teams for bug fixes. \n● Generate test summary reports for management review.\n● Develop automated test scenarios and environments for performance testing. \n● Publish and perform the Load/Stress tests and certify the release for various performance levels. \n● Work closely with Principals and SQE to define performance requirements. \n● Develop a test plan and strategy to test our applications at scale and ensure that our systems perform under SLAs under stress.\n●&nbsp;&nbsp;Innovate and create performance validation engines that can keep up with fast moving code bases and cater to millions of educators and learners. \n● Research and analyze issues in the Application /Services/DB layer and identify performance bottlenecks. \n● Design and implement scalable performance tests that can guarantee application scalability, longevity and performance under stress. \n● Review and analyze application, logs and usage data from Kibana, Datadog, Google Analytics etc. \n● Work with your development counterparts to review ongoing production usage and growth and incorporate findings to test scripts. Coordinate with Senior Developers,<b>Skills</b>:        Apache JMeter,                     Performance Testing,                     Load Testing            ","link":"https://www.upwork.com/jobs/Performance-Testing-Expert-JMeter_%7E01b3baf43c15ece9fe?source=rss","processedDate":"2024-03-19T08:46:14.724Z","postedDate":"<b>Posted On</b>: March 15, 2024 07:07 UTC","id":"01b3baf43c15ece9fe"},{"skillset":["Golang","Kubernetes","DevOps","Docker","Google Protocol Buffers"],"title":"Golang Expert with extensive knowledge of GoLang, Kubernetes - Upwork","description":"Looking for a GoLang Engineer with expertise to support me in a project. \n- Need help with issues related to gRPC connection buffers, memories, Microservices and Kubernetes&nbsp;&nbsp;<b>Skills</b>:        Golang,                     Kubernetes,                     DevOps,                     Docker,                     Google Protocol Buffers            ","link":"https://www.upwork.com/jobs/Golang-Expert-with-extensive-knowledge-GoLang-Kubernetes_%7E01b4bf6394ec9ccf96?source=rss","processedDate":"2024-03-19T08:46:14.724Z","postedDate":"<b>Posted On</b>: March 11, 2024 23:09 UTC","id":"01b4bf6394ec9ccf96"},{"skillset":["Database Security","AI Security","Artificial Intelligence","Machine Learning","AWS Cloud9"],"title":"Looking to combat AI threats - Cybersecurity  - Upwork","description":"Hello,\nWe are looking for an expert in AI and machine learning where the knowledge of the personnel will be top-notch in combating AI security threats. \nWe are open to open-source or another software suggestion and need help from start to finish o implementation and how this will work. \nMost important things to consider are the existing functionality we already have in place which are as follows: \n1. We are using datadog\n2. Bitbucket is being used \n3. AWS cloud 9 \n4. JIRA\nSo the suggestion should be easily integrated&nbsp;&nbsp;with what I&#039;ve outlind above. \nThis is a long-term opportunity for at least a year or more. <b>Skills</b>:        Database Security,                     AI Security,                     Artificial Intelligence,                     Machine Learning,                     AWS Cloud9            ","link":"https://www.upwork.com/jobs/Looking-combat-threats-Cybersecurity_%7E012e209498d79c53ed?source=rss","processedDate":"2024-03-19T08:46:14.724Z","postedDate":"<b>Posted On</b>: March 06, 2024 14:07 UTC","id":"012e209498d79c53ed"},{"skillset":["Rust","Web Application","Software","JavaScript","Django Stack","Google APIs"],"title":"Requirements for Exam Preparation Platform - Upwork","description":"Requirements Document for Exam Preparation Platform\nIntroduction:\nThe purpose of this document is to outline the functional and non-functional requirements for the development of an exam preparation platform. The platform aims to provide users with a comprehensive resource for studying, practicing, and discussing various exam topics, including vendor certifications, study materials, practice questions, and community engagement features.\nFunctional Requirements:\nUser Management:\nRegistration and login with email/password or OAuth (e.g., Google).\nUser profile management with options to edit personal details and preferences.\nSecure authentication and authorization mechanisms, including JWT.\nContent Management:\nVendor management for adding, editing, and categorizing vendors offering certifications and study materials.\nStudy course management for organizing study materials by vendor, course type, and difficulty level.\nUploading and categorizing study materials such as videos, PDFs, and reference guides.\nPractice question management with options to add, edit, and categorize questions by topic and difficulty.\nAssociating practice questions with predefined answers and references for further study.\nUser Interaction and Engagement:\nVoting system for users to vote on answers to practice questions, with percentages indicating popular choices.\nCommenting system for users to discuss study materials, practice questions, and exam topics.\nReal-time chat or discussion forums for community interaction and support.\nIntegration with third-party commenting platforms like Disqus or Commento.\nSubscription Management:\nFree and paid subscription options for accessing study materials and practice questions.\nSubscription plans with different durations and access levels (e.g., basic, premium).\nIntegration with payment gateways like Stripe or PayPal for secure subscription payments.\nAnti-Piracy Measures:\nDigital Rights Management (DRM) for protecting downloadable study materials like PDFs and videos.\nTracking and prevention of unauthorized sharing of login credentials through techniques like Canvas Fingerprinting.\nUser Experience:\nUser-friendly and responsive interface for seamless navigation and interaction across devices.\nRestricting right-click, Ctrl+C, and screenshot functionalities to prevent unauthorized copying of content.\nImplementing Google reCAPTCHA to prevent spam and bot submissions.\nUpselling and Recommendations:\nUpselling additional study materials, courses, or premium features based on user behavior and preferences.\nDisplaying relevant products or courses based on user&#039;s current study materials or exam topics.\nNon-Functional Requirements:\nPerformance:\nFast loading times and responsiveness, even under high traffic conditions.\nEfficient database queries and optimized backend processing for smooth user experience.\nSecurity:\nImplementation of best practices for securing user data, including encryption of sensitive information.\nRegular security audits and updates to patch vulnerabilities and ensure compliance with data protection regulations.\nScalability:\nDesigning the platform to scale horizontally and vertically to accommodate growing user base and content.\nReliability:\nHigh availability and reliability with minimal downtime and robust error handling mechanisms.\nMonitoring and Analytics:\nMonitoring application performance, server metrics, and user interactions using tools like Google Analytics, New Relic, or Datadog.\nLogging and tracking user activities for audit trails and analysis.\nConstraints:\nBudget: The development should adhere to the allocated budget constraints.\nTimeline: The project should be completed within the specified timeline for deployment.\nCompliance: Compliance with legal regulations such as GDPR and copyright laws must be ensured throughout development and operation.\nAssumptions:\nUsers will have access to a stable internet connection for accessing the platform.\nUsers will be responsible for ensuring compatibility of their devices with the platform&#039;s technical requirements.\nUser engagement features like voting and commenting will require moderation to ensure adherence to community guidelines.<b>Skills</b>:        Rust,                     Web Application,                     Software,                     JavaScript,                     Django Stack,                     Google APIs            ","link":"https://www.upwork.com/jobs/Requirements-for-Exam-Preparation-Platform_%7E014c5bc9832dc4d97c?source=rss","processedDate":"2024-03-19T08:46:14.725Z","postedDate":"<b>Posted On</b>: March 04, 2024 02:12 UTC","id":"014c5bc9832dc4d97c"},{"skillset":["Heroku","Google Cloud Platform","DevOps","CI/CD"],"title":"Cloud Migration Specialist - GCP - Upwork","description":"We&#039;re looking for a Cloud Migration Specialist with expertise in Google Cloud Platform (GCP) to lead the migration of our Heroku-based APIs and applications to GCP. This role involves preparing our staging and testing environments on GCP, with the opportunity to set up the production instance for final migration by our team.\nResponsibilities:\nPlan and execute the migration of staging, testing, and production environments from Heroku to GCP.\nEmulate Heroku Private Spaces security features and secure Postgres database requirements on GCP.\nEnsure compatibility of all packages in our mono-repo applications/apis on GCP.\nIntegrate DataDog for logging and ensure PDFKit functionality within the GCP environment.\nSet up auto-deployment from GitHub to GCP, streamlining our development workflow.\nRequirements:\nStrong background in cloud architecture, specifically with GCP and Heroku.\nExperience with security features and database management on cloud platforms.\nKnowledge of mono-repo configurations and their deployment on cloud environments.\nProficiency in using DataDog and PDFKit.\nFamiliarity with CI/CD practices and auto-deployment from GitHub.<b>Skills</b>:        Heroku,                     Google Cloud Platform,                     DevOps,                     CI/CD            ","link":"https://www.upwork.com/jobs/Cloud-Migration-Specialist-GCP_%7E016d3e9ad542c8e409?source=rss","processedDate":"2024-03-19T08:46:14.725Z","postedDate":"<b>Posted On</b>: March 02, 2024 17:07 UTC","id":"016d3e9ad542c8e409"},{"skillset":["Bash","CI/CD","Kubernetes","Python","Amazon Web Services","DevOps","Golang"],"title":"Site Reliability Engineer - Upwork","description":"Are you an experienced SRE professional looking for an exciting opportunity to work with cutting-edge technologies and contribute to the success of influential global brands? We have the perfect role for you! We are recruiting for a U.S. healthcare project. Sound good? \nResponsibilities:\n- Service Management: Manage SLA/SLO, ensuring continuous improvements in reliability and quality.\n- Technology Stack: Work with React/NodeJS, Python, Golang, AWS Cloud, and Datadog for observability.\n- Collaboration: Define requirements, standards, and technical roadmaps in collaboration with cross-functional teams.\n- Monitoring and Support: Implement security/reliability monitoring, provide technical support, and maintain documentation.\n- Compliance: Ensure compliance with regulations, audits, and data protection laws.\nSkills &amp;amp; Requirements:\n- Location: you have to live in the USA or nearshore! 📍\n- Experience: 5+ years of scripting (Python/Bash/Perl/Golang) and automation tool expertise.\n- AWS Cloud: In-depth knowledge.\n- CI/CD: Deploy applications from source control, understanding CI/CD concepts.\n- Problem Solving: Reverse engineer solutions, and troubleshoot errors.\n- Agile and Kubernetes: Understanding of Agile, Jira, and expertise with Kubernetes.\n- Database Experience: Familiarity with relational and non-relational databases.<b>Skills</b>:        Bash,                     CI/CD,                     Kubernetes,                     Python,                     Amazon Web Services,                     DevOps,                     Golang            ","link":"https://www.upwork.com/jobs/Site-Reliability-Engineer_%7E01809f34f7a1058a05?source=rss","processedDate":"2024-03-19T08:46:14.725Z","postedDate":"<b>Posted On</b>: February 29, 2024 12:27 UTC","id":"01809f34f7a1058a05"},{"skillset":["AWS Lambda","Amazon API Gateway","Amazon Aurora","Amazon DynamoDB","Amazon S3","AWS CloudFormation","AWS Development","Mulesoft"],"title":"AWS Developer and Salesforce Mulesoft Need - Upwork","description":"We are looking to hire a AWS developer with JD as below. Experience range around 8-10 years. Along with AWS skills mentioned below, emphasis is on strong communication &amp;amp; customer interfacing skills. This is for an AWS Implementations.\nAWS Developer JD:-\nProvide design, development and support services for serverless applications using AWS Lambda and Amazon EventBridge.\nExperience from working in a support role, working with incidents, change and implementing fixes in time-critical PROD-environment\nWrite clean, efficient, and maintainable code in TypeScript.\nMonitor, troubleshoot, and optimize serverless applications for performance and scalability.\nDocument technical specifications, system workflows, and deployment processes.\nCollaborate with architects and other developers to define system architecture and integration points.\nEnsure security best practices are followed in all AWS services and applications.\nStay updated on AWS services, trends, and best practices to recommend improvements and optimizations.\nProven experience as an AWS Developer or similar role\nStrong proficiency in AWS Lambda and Amazon EventBridge.\nProficiency in TypeScript and hands-on experience with serverless application development.\nFamiliarity with AWS services such as API Gateway, Aurora DBm DynamoDB, S3, and CloudFormation.\nExperience with AWS Serverless framework\nStrong communication &amp;amp; customer interfacing skills\nMuleSoft JD:-\nExperience working with RAML, Async API, DataWeave (scripting &amp;amp; custom modules) and MuleSoft Anypoint Platform\nExperience working with functional programming in Java or XML SDK or Scala or Haskell etc for creating custom connectors\nExperience working with XML Coding for building interfaces instead of drag&amp;amp;drop\nExperience working with event-driven architecture using AWS SNS, SQS and EventBridge\nExperience working with AWS services such as Lambda, S3, IAM and IaC (Infrastructure as Code).\nExperience working with real-time data streams using, AWS MSK for Kafka, AWS Kinesis and AWS Kinesis Firehose\nExperience with development deployment tools such as Maven, GitHub and GitHub actions\nExperience with exposing logs from MuleSoft interfaces to Datadog via Kinesis Firehose and working with OAuth 2.0 for better security\nExperience with Munit (mocking &amp;amp; spying) as well as Dataweave testing framework (transformation tests)\nCandidate should be comfortable with various patterns in our integrations listening from IBM MQ, Snowflake, Kafka etc.<b>Skills</b>:        AWS Lambda,                     Amazon API Gateway,                     Amazon Aurora,                     Amazon DynamoDB,                     Amazon S3,                     AWS CloudFormation,                     AWS Development,                     Mulesoft            ","link":"https://www.upwork.com/jobs/AWS-Developer-and-Salesforce-Mulesoft-Need_%7E0131762e4bae1652b9?source=rss","processedDate":"2024-03-19T08:46:14.726Z","postedDate":"<b>Posted On</b>: February 27, 2024 13:45 UTC","id":"0131762e4bae1652b9"},{"skillset":[],"title":"Create Datadog Synthetics tests  - Upwork","description":"We need someone to write end-to-end tests using Datadog Synthetics.&nbsp;&nbsp;&nbsp;These Synthetics scripts will implement &amp;quot;smoke&amp;quot; tests for our app.\nOur website is https://discuss.link","link":"https://www.upwork.com/jobs/Create-Datadog-Synthetics-tests_%7E01a1885245073c63d8?source=rss","processedDate":"2024-03-19T08:46:14.726Z","postedDate":"<b>Posted On</b>: February 23, 2024 19:10 UTC","id":"01a1885245073c63d8"},{"skillset":["AWS Lambda","RESTful API","Java","API","API Development","SOAP API"],"title":"Java API Integrations engineer - Europe only - Upwork","description":"You are an experienced Software Engineer who is passionate about engineering practices like Agile, CI / CD, test-driven development, OOP concepts and solid principles. A SaaS class-leader is looking for talented individuals to help integrate their platform into 3rd party vendors and data suppliers.\nYou should have solid experience as an engineer designing, developing and maintaining API driven solutions, and have a strong understanding of how a microservice architecture works, as well as implementing and designing RESTful and SOAP APIs with data transformation.\nYou have strong communication skills, high integrity and great attention to detail who is happy working in a remote team, alone, or together in a group.\nYou will have the opportunity to learn and work primarily with the following technologies:\n● Java with Spring Boot\n● AWS Gateway Services, Lamba serverless, AWS Fargate\n● PostgreSQL\n● EKS, Kubernetes, Docker\n● JSON, VTL, XML\n● Fluency in English\nYou will also interact with the rest of our stack, which includes\n● C# with .net and .net core\n● MSSQL\n● Looker via Redshift\n● AWS PaaS offerings\n● Terraform\n● Datadog Monitoring and Observability<b>Skills</b>:        AWS Lambda,                     RESTful API,                     Java,                     API,                     API Development,                     SOAP API            ","link":"https://www.upwork.com/jobs/Java-API-Integrations-engineer-Europe-only_%7E01dd670f20d7c1a9be?source=rss","processedDate":"2024-03-19T08:46:14.726Z","postedDate":"<b>Posted On</b>: February 05, 2024 15:43 UTC","id":"01dd670f20d7c1a9be"},{"skillset":["Amazon ECS","Bash","Amazon Web Services","Docker","CI/CD","Deployment Automation","AWS CloudFormation"],"title":"Full-Time Contractor DevOps Engineer - Upwork","description":"Overview:\nCenTrak is on the lookout for a skilled Full-Time Contractor DevOps Engineer. This role is integral to our mission of improving healthcare through innovative technology solutions, focusing on cloud services, automation, and IoT in healthcare settings.\nProject Description:\nThe project involves a dual focus: supporting existing deployments and developing new deployment and infrastructure pipelines. The role is critical in implementing automated management for multiple instances of our large multi-tenant system deployments in a healthcare application. This includes ensuring system reliability, scalability, and efficiency in a dynamic healthcare environment.\nKey Responsibilities:\n- Develop and maintain sophisticated deployment and infrastructure for RTLS solutions.\n- Manage and optimize AWS services, focusing on specific resources for high availability and disaster recovery.\n- Collaborate on projects that elevate patient care and hospital operations.\nRequired Skills:\n- Expertise in infrastructure-as-code, CloudFormation.\n- Experience with AWS services (ECS, EC2, RDS, VPC, Route 53, Lambda, S3, Load Balancer, IoT Core), with emphasis on redundancy, high availability, and disaster recovery.\n- Strong Bash scripting knowledge.\n- Strong skills in automation, resource management.\n- Proficiency in Git / experience with Bitbucket Pipelines.\n- Ability to work independently and readiness for multitasking based on priorities.\nDesirable Skills:\n- Cybersecurity best practices in healthcare, and network security.\n- Proficiency with Octopus Deploy and monitoring tools like Datadog.\n- Experience with RabbitMQ cluster management.\n- Basic programming and framework knowledge of NodeJS, C#, Angular, Python is a plus.\nQualifications:\nBachelor&#039;s/Master&#039;s in Computer Science/Engineering or related field, or significant experience.\n3-5 years in DevOps, healthcare industry experience preferred.\nAt a minimum, the candidate should be available online for meetings and interactions with teams from 8 AM to 12 PM EST.<b>Skills</b>:        Amazon ECS,                     Bash,                     Amazon Web Services,                     Docker,                     CI/CD,                     Deployment Automation,                     AWS CloudFormation            ","link":"https://www.upwork.com/jobs/Full-Time-Contractor-DevOps-Engineer_%7E013ee13b017b6aac96?source=rss","processedDate":"2024-03-19T08:46:14.726Z","postedDate":"<b>Posted On</b>: January 08, 2024 23:05 UTC","id":"013ee13b017b6aac96"},{"skillset":["Incident Management","DevOps"],"title":"DevOps Service Engineer, Problem Management Specialist - Upwork","description":"Upwork ($UPWK) is the world&rsquo;s work marketplace. We serve everyone from one-person startups to large, Fortune 100 enterprises with a powerful, trust-driven platform that enables companies and talent to work together in new ways that unlock their potential.\nLast year, more than $3.8 billion of work was done through Upwork by skilled professionals who are gaining more control by finding work they are passionate about and innovating their careers.\nThis is an engagement through Upwork&rsquo;s Hybrid Workforce Solutions (HWS) Team. Our Hybrid Workforce Solutions Team is a global group of professionals that support Upwork&rsquo;s business. Our HWS team members are located all over the world.\nWe are seeking a highly motivated and experienced Service Engineer specializing in Problem Management to join our dynamic team. As a key player in our technology-driven environment, you will take charge of identifying areas for improvement through comprehensive analysis of data, including bugs, incidents, post mortems, and more. The ideal candidate will have a keen eye for identifying trends and systemic issues, ultimately contributing to the enhancement of our platform&#039;s performance and reliability.\nWork/Project Scope:\n- Conduct in-depth analysis of data from various sources, such as Jira, Bitbucket, Dynatrace, Big Panda, AWS, incidents, and post-mortems.\n- Utilize data analytics techniques to identify trends, patterns, and potential problem areas within the platform.\n- Own and drive the problem management process from initiation to resolution.\n- Collaborate with cross-functional teams to address identified issues and implement effective solutions.\n- Work independently with limited direction to proactively identify and resolve problems.\n- Drive a culture of continuous improvement by actively seeking opportunities to enhance platform performance.\n- Establish and implement best practices for problem management, incorporating lessons learned from incidents and post-mortems.\n- Work closely with Operational Intelligence, Service Management, and Site Reliability Engineering teams to ensure seamless collaboration and communication.\n- Identify and engage the right parties to address and resolve identified problems.\n- Integrate DevOps practices into the problem management process.\n- Collaborate on automating processes and optimizing operations, enhancing platform reliability.\n- Implement DevOps tools for seamless integration with Jira, Bitbucket, Dynatrace, Big Panda, and AWS.\nMust Haves (Required Skills):\n- Proven Problem Management experience with a focus on DevOps practices.\n- Strong analytical skills and the ability to derive meaningful insights from data.\n- Familiarity with DevOps tools and platforms, including Jira, Bitbucket, Dynatrace, Big Panda, and AWS.\n- Experience collaborating with cross-functional teams, especially in Operational Intelligence, Service Management, and Site Reliability Engineering.\n- Ability to work independently, taking ownership of the problem management process with an emphasis on DevOps principles.\n- Excellent communication and interpersonal skills.\nUpwork is proudly committed to fostering a diverse and inclusive workforce. We never discriminate based on race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical condition), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. &nbsp;&nbsp;<b>Skills</b>:        Incident Management,                     DevOps            ","link":"https://www.upwork.com/jobs/DevOps-Service-Engineer-Problem-Management-Specialist_%7E01279781091c7beba2?source=rss","processedDate":"2024-03-19T08:46:20.407Z","postedDate":"<b>Posted On</b>: March 12, 2024 08:40 UTC","id":"01279781091c7beba2"},{"skillset":["JavaScript","AngularJS","Solution Architecture","Dashboard","Business Management","HTML","Pre-Sales","Technical Support","Dynatrace"],"title":"Dynatrace Integration with SolarWinds - Upwork","description":"Integration between Dynatrace and SolarWinds.\nIntegrate the SolarWinds Alerts to Dynatrace\nIntegrate the SolarWinds NPM nodes status into SolarWinds<b>Skills</b>:        JavaScript,                     AngularJS,                     Solution Architecture,                     Dashboard,                     Business Management,                     HTML,                     Pre-Sales,                     Technical Support,                     Dynatrace            ","link":"https://www.upwork.com/jobs/Dynatrace-Integration-with-SolarWinds_%7E01a31d07d9d3bfeb71?source=rss","processedDate":"2024-03-19T08:46:20.407Z","postedDate":"<b>Posted On</b>: March 07, 2024 14:21 UTC","id":"01a31d07d9d3bfeb71"},{"skillset":["Dynatrace"],"title":"SRE Dynatrace Engineer - Upwork","description":"We are looking for candidate with more 5yrs of experience in below tec stacks.\nTech stacks - React JS, Dynatrace, Graphana, Github, StatusIO, Python and SRE \nTime - 7.30 PM to 11.30 PM IST(Mon and Fri)\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;After 7AM IST (Tue to Thu)\nDuration - 3hrs/day (Mon - Fri)\nBudget - 28K INR/Month\nWork type - Remote work&nbsp;over&nbsp;zoom&nbsp;call<b>Skills</b>:        Dynatrace            ","link":"https://www.upwork.com/jobs/SRE-Dynatrace-Engineer_%7E019bebeb670e9db302?source=rss","processedDate":"2024-03-19T08:46:20.408Z","postedDate":"<b>Posted On</b>: February 29, 2024 07:17 UTC","id":"019bebeb670e9db302"},{"skillset":["GitHub","Python","Dynatrace","Grafana"],"title":"Python &amp; SRE Experienced Developer - Upwork","description":"We are looking for a candidate having more than 7 years of experience in below technologies, Fixed in the project for long term\nSkills: React JS, Dyntrace,Grafana, Github, StatusIO,Python, SRE\nTiming:07:30 PM IST to 11:30 PM IST\nDuration: 3hrs/day(Monday to Friday)\nBudget: 28k/Monthly<b>Skills</b>:        GitHub,                     Python,                     Dynatrace,                     Grafana            ","link":"https://www.upwork.com/jobs/Python-amp-SRE-Experienced-Developer_%7E0186f6fe63bdeb2fc8?source=rss","processedDate":"2024-03-19T08:46:20.408Z","postedDate":"<b>Posted On</b>: February 28, 2024 10:50 UTC","id":"0186f6fe63bdeb2fc8"},{"skillset":["ServiceNow","Service Cloud Development","Jira","AWS Cloud9","Dynatrace"],"title":"Service Now developer - Upwork","description":"Hi Everyone\nI am looking for a &amp;quot;ServiceNow&amp;quot; Developer for a full-time remote contractual job for 12 months. \nJob type - Full-time, Contractual\nLocation - Remote\nTechnology - ServiceNow ( ITSM &amp;amp; CSM )\nSalary - 120k INR per month ( No deductions)\nOffice visit - You may be required to visit Hyderabadh to our office a few times in a year, all expenses will be paid by company &amp;amp; visit will be of 3-4 days.\nJob Responsibilities &amp;amp; Skills required as below :-\n1) Creation of CR in SNOW and approval process.\n2) Creation of Application ID.\n3) Creation of eHLCCD.\n4) Setting up service catalogue.\nInterview Process- Resume screening + 1 HR screening + 2 Client Interview Rounds<b>Skills</b>:        ServiceNow,                     Service Cloud Development,                     Jira,                     AWS Cloud9,                     Dynatrace            ","link":"https://www.upwork.com/jobs/Service-Now-developer_%7E010ae5e6b66f1fa613?source=rss","processedDate":"2024-03-19T08:46:20.408Z","postedDate":"<b>Posted On</b>: February 17, 2024 09:45 UTC","id":"010ae5e6b66f1fa613"},{"skillset":[],"title":"Urgent Requirement for Dynatrace Expert - Upwork","description":"We are currently in need of a Dynatrace expert who possesses the skills and expertise to configure and implement Dynatrace for Oracle and IBM products. The successful candidate will be responsible for setting up Dynatrace to monitor and optimize the performance of our Oracle and IBM solutions.\nGiven the urgency of this requirement, we are seeking individuals who have prior experience with Dynatrace implementation in similar environments. The ideal candidate should have a strong understanding of Oracle and IBM products and be capable of configuring Dynatrace to effectively monitor their performance.\nWe believe that a comprehensive overview of your expertise and relevant success stories will help us better understand how your capabilities align with our project requirements. Once we have received this information, we can proceed to schedule a call to discuss potential collaboration opportunities in more detail.","link":"https://www.upwork.com/jobs/Urgent-Requirement-for-Dynatrace-Expert_%7E01ffabd0377cc1a82d?source=rss","processedDate":"2024-03-19T08:46:20.408Z","postedDate":"<b>Posted On</b>: February 14, 2024 12:43 UTC","id":"01ffabd0377cc1a82d"},{"skillset":["Oracle WebLogic Server","Linux System Administration","Linux","Apache HTTP Server","System Administration","SQL","Apache Tomcat","Network Security","LDAP","DNS","Apache Solr","IBM WebSphere","JBoss EAP","Dynatrace"],"title":"Middleware/WebSphere Admin - Upwork","description":"Hi There,\nI am looking for an experienced Middleware/WebSphere Administrator who worked on Installation, configuration and maintainance of application server like Weblogic Server, JBoss and WebShere Application Server. Must have experience working with operationg systems like Linux, Solaris, Unix and Windows. Must have experience working with Apache tomcat, Oracle HTTP server and IBM IIS server.\nExperience with Monitoring tools like Dynatrace, Nagios etc.<b>Skills</b>:        Oracle WebLogic Server,                     Linux System Administration,                     Linux,                     Apache HTTP Server,                     System Administration,                     SQL,                     Apache Tomcat,                     Network Security,                     LDAP,                     DNS,                     Apache Solr,                     IBM WebSphere,                     JBoss EAP,                     Dynatrace            ","link":"https://www.upwork.com/jobs/Middleware-WebSphere-Admin_%7E01f43a8e092e883191?source=rss","processedDate":"2024-03-19T08:46:20.408Z","postedDate":"<b>Posted On</b>: January 25, 2024 17:11 UTC","id":"01f43a8e092e883191"},{"skillset":["Load Testing","Web Testing","Automated Testing","JavaScript"],"title":"Load Test a Web Application - Upwork","description":"An expert is required to load test an existing web application. Web app is for farm management. It is written in angular. It has a sign in page, a list of items and an interactive map. \n- We will be testing the staging environment\n- We need to log in and interact with the application\n- Test 100 concurrent users\n- Each bot needs to log in and interact with the application.\n- Data needs to be recorded (we are not just seeing if it breaks) such as load speed and cpu usage for both front end and back end. We can probably just see the usage on AWS ECS but if you know how to do this.\n- Page load speed must be less than 3 seconds for all users.\nWe recommend using Grafana K6 but are open to other options that you are proficient in and will allow us to retrieve the above criteria.<b>Skills</b>:        Load Testing,                     Web Testing,                     Automated Testing,                     JavaScript            ","link":"https://www.upwork.com/jobs/Load-Test-Web-Application_%7E01abe0575740abc090?source=rss","processedDate":"2024-03-19T08:46:26.392Z","postedDate":"<b>Posted On</b>: March 18, 2024 08:18 UTC","id":"01abe0575740abc090"},{"skillset":["Elasticsearch","PHP","Jira","BigQuery","Miro"],"title":"PHP Software Engineers - Upwork","description":"PHP Software Engineers - 15 Month Daily Rate Contract\nAbout the Company\nMy client is a leading eCommerce company with offices in Dublin. Their payments team plays a crucial role in the company, which is recognised globally for its dynamic marketplace. This team is at the forefront of managing the flow of funds from buyers to sellers, ensuring transactions are processed rapidly and efficiently. \nAbout the Position\nAre you passionate about building new, innovative payments infrastructure?\nIn this role, you will have the opportunity to engage with various aspects of the company web stack, predominantly using PHP, work with high quality tools and dig into data analysis with MySQL. Your responsibilities will include strategic thinking about the payments ecosystem, payments processors, database sharing, replication, performance optimization, system stability, metric tracking, integration resiliency, and more. Embrace the opportunity to continuously learn and adapt in an environment marked by significant and impactful changes to the payments platform on a global scale.\nKey Responsibilities\n&bull;&nbsp;&nbsp;&nbsp;You will be involved in the early scoping of intricate, new Pay-in and Pay-out platforms. This involves adding nuance to complex product requirements to ensure issues are found early and often in the planning process.\n&bull;&nbsp;&nbsp;You will work collaboratively with multiple engineers at a range of levels to support you in gaining critical onboarding about how designs and writes software.\n&bull;&nbsp;&nbsp;Continuously learn from your teammates and share your own insights with them.\n&bull; Push code to production early and often using our continuous deployment systems.\n&bull; Empathy, ownership, communication, and technical skill are valued equally.\n&bull; Participate in code and design reviews and maintain high standards of code quality.\n&bull; Of course, this is just a sample of the kinds of work this role will require!\nExperience/Requirements\nRequired Qualifications:\n&bull; Candidates should have at least 2 years PHP experience in Payments and Ecommerce\n&bull;&nbsp;&nbsp;You will be expected to be fully autonomous, be able to guide junior team members, and lead &amp;amp; contribute high quality solutions. \n&bull;&nbsp;&nbsp;Strong experience in Jira, BigQuery, Any PHP IDE, Miro,&nbsp;&nbsp;Grafana, Elastic Search, Looker, Slack/Google Suite\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nRemuneration Package\nA generous daily rate in line with experience will be on offer to the right candidate.<b>Skills</b>:        Elasticsearch,                     PHP,                     Jira,                     BigQuery,                     Miro            ","link":"https://www.upwork.com/jobs/PHP-Software-Engineers_%7E015afd7cf60ba28e37?source=rss","processedDate":"2024-03-19T08:46:26.392Z","postedDate":"<b>Posted On</b>: March 14, 2024 16:14 UTC","id":"015afd7cf60ba28e37"},{"skillset":["Linux","Ubuntu","Git","Docker","PHP","WordPress"],"title":"Docker compose Caddy reverse / Wordpress / Frankenphp - Upwork","description":"Create 2 docker compose files for deploying 2 stacks:\n1. Caddy reverse proxy with Portainer and Authentik\nincluding prometheus + grafana for logging\nincluding Sablier for scale down on activity - https://github.com/acouvreur/sablier\n2. Wordpress application with Frankenphp and caching and mysql database\nincluding logs going to above prometheus and grafana\nGeneral: \n* secure best practices with Autentik\n* best performance\n* use Sablier for optimizing resources\n* deploying from private git repo<b>Skills</b>:        Linux,                     Ubuntu,                     Git,                     Docker,                     PHP,                     WordPress            ","link":"https://www.upwork.com/jobs/Docker-compose-Caddy-reverse-Wordpress-Frankenphp_%7E01c6115c7b7fbe28fa?source=rss","processedDate":"2024-03-19T08:46:26.392Z","postedDate":"<b>Posted On</b>: March 14, 2024 12:22 UTC","id":"01c6115c7b7fbe28fa"},{"skillset":["Bash","Automated Monitoring","Linux System Administration","Docker","DevOps","Deployment Automation","Linux","NGINX","Ubuntu"],"title":"Sentry, Prometheus and Loki - Selfhost Setup - Upwork","description":"We require the following. Selfhosting of Sentry, Prometheus and Loki.\nExperience:\n- You must have self-hosted Sentry previously AND intergrated GitHub auth and commit sync\n- You must have self-hosted and setup Prometheus and Loki.\nDescription:\n1. Security\n- Add UFW (firewall) settings\n- Add Fail2Ban\n2. Sentry:\n- SSH to the server (only)\n- Change root name\n- Install Sentry\n- Have DB on mounted volume\n- Setup Sentry Github integration (the self hosted version!)\n- Setup a reverse proxy nginx or caddy\n- Add Geolocation API\n- Add SendGrid intergration\n- Setup boot script on server to load Sentry on startup and reboots.\n2. Prometheus and Loki (and Grafana)\n- Install Prometheus, Grafana and Loki\n- Configure storage for data retention on another mounted volume\n- Set up data sources in Prometheus for Loki\n- Configure alert rules in Prometheus\n- Install and configure Grafana for visualization\n- Secure Grafana with SSL and authentication\n- Enable Loki in Grafana as a data source\n- Setup SendGrid in Grafana.\n- Setup monitoring of the server that&#039;s hosting all these tools.\n- Write a script that launches Grafana, Loki and Prometheus on the server on reboot<b>Skills</b>:        Bash,                     Automated Monitoring,                     Linux System Administration,                     Docker,                     DevOps,                     Deployment Automation,                     Linux,                     NGINX,                     Ubuntu            ","link":"https://www.upwork.com/jobs/Sentry-Prometheus-and-Loki-Selfhost-Setup_%7E01811e179f229a855c?source=rss","processedDate":"2024-03-19T08:46:26.392Z","postedDate":"<b>Posted On</b>: March 14, 2024 10:30 UTC","id":"01811e179f229a855c"},{"skillset":["C#","Java","Android","Unity","iOS","Swift","Objective-C",".NET Core"],"title":"SDK Developer - Upwork","description":"Our company geonode.com is currently looking for an SDK Developer\nSkills Needed:\n- experience making plugins or SDKs\n- experience in android native (java/kotlin)\n- experience in unity &amp;amp; c#\nmaking &amp;amp; publishing a package in android, and unity\n- experience with code obfuscation to hide package code\n- experience with remote logging to send logs to Grafana Loki server\n- good problem-solving, and debugging skills\n- experience in socket &amp;amp; network programming\nintegrating and running native android code in unity\n- experience with running an android app in background even when app is closed\n- experience working with teams\ngood communication &amp;amp; english skills\nBonus Skills:\nexperience in IOS (swift/ objective-c)\nexperience in .Net / C#\nexperience in React Native\nexperience in Unreal Engine<b>Skills</b>:        C#,                     Java,                     Android,                     Unity,                     iOS,                     Swift,                     Objective-C,                     .NET Core            ","link":"https://www.upwork.com/jobs/SDK-Developer_%7E0127a78e5192068b90?source=rss","processedDate":"2024-03-19T08:46:26.392Z","postedDate":"<b>Posted On</b>: March 12, 2024 08:35 UTC","id":"0127a78e5192068b90"},{"skillset":["Linux","Kubernetes"],"title":"Realtime monitoring number of requests in k8 pod - Upwork","description":"We have a k8 cluster on scaleway and we want to be able to measure the number of requests per pod.\nWe have subscription plans which have a max request limit and thus we need to be able to stop the container of send an email/notification when max requests has been reached.\nAlso we need to able to change this max limit per pod in runtime.\nMaybe we can also use a tool like grafana for this<b>Skills</b>:        Linux,                     Kubernetes            ","link":"https://www.upwork.com/jobs/Realtime-monitoring-number-requests-pod_%7E0146402285e5cebd21?source=rss","processedDate":"2024-03-19T08:46:26.392Z","postedDate":"<b>Posted On</b>: March 11, 2024 15:47 UTC","id":"0146402285e5cebd21"},{"skillset":["Ubuntu","Automated Monitoring","Raspberry Pi","Grafana","Linux","Docker Compose"],"title":"Grafana dashboards for Dockerized Raspberry Pi - Upwork","description":"My current homelab environment is the following:\n- Ubuntu 23.10 on Raspberry Pi 5\n- EcoFlow Delta Mini\n- Starlink internet going into a USG-3P with a backup internet\nBasically I want to have a single dashboard for monitoring the uptime of my internet (and history) and the backup battery I have installed. \nSo I&#039;d like a consolidated docker compose of the following dashboards:\nhttps://github.com/berezhinskiy/ecoflow_exporter\nhttps://github.com/danopstech/starlink\nhttps://github.com/fmdlc/ISP-Checker (only reason I want this in combo to the starlink one is that I want to be able to see when it fails over)\nInstead of having to run all of these independently, I want a single repo that sets this up in case I want to deploy elsewhere. \nDeliverables:\n- Single repository (using git) for the configuration files\n- Customized Grafana dashboard (will send over an example) that combines all three data sources\nFor the ISP Checker, I&#039;d like to ping the following \nhttps://www.google.com\nhttps://us06www3.zoom.us\nhttps://1.1.1.1/<b>Skills</b>:        Ubuntu,                     Automated Monitoring,                     Raspberry Pi,                     Grafana,                     Linux,                     Docker Compose            ","link":"https://www.upwork.com/jobs/Grafana-dashboards-for-Dockerized-Raspberry_%7E0135f4e442f9fc8df5?source=rss","processedDate":"2024-03-19T08:46:26.392Z","postedDate":"<b>Posted On</b>: March 11, 2024 15:30 UTC","id":"0135f4e442f9fc8df5"},{"skillset":["Splunk","Network Security","DevOps"],"title":"Splunk Architecture Expert - Upwork","description":"Review the architecture of three indexers and a search head at each site. The VM&#039;s will probably be kept on separate hardware. Be able to fine tune splunk indexer, core, memory settings to optimize resource utilization once system is running. <b>Skills</b>:        Splunk,                     Network Security,                     DevOps            ","link":"https://www.upwork.com/jobs/Splunk-Architecture-Expert_%7E016e4d61189ee93ddd?source=rss","processedDate":"2024-03-19T08:46:26.392Z","postedDate":"<b>Posted On</b>: March 10, 2024 20:03 UTC","id":"016e4d61189ee93ddd"},{"skillset":["Internet of Things","Electrical Engineering","Arduino","Electronic Design","Embedded System","Python","Raspberry Pi","C++"],"title":"Platform LoRa Based, low cost IoT platform for Renewable Energy Generation Unit Monitoring  - Upwork","description":"Utilizing ChirpStack, InfluxDB, Grafana, and Node-RED can significantly streamline the development of your IoT platform for renewable energy monitoring and supervisory control. Here&#039;s how you can integrate these technologies:\nComponents:\nChirpStack (LoRaWAN Network Server):\nSet up ChirpStack as your LoRaWAN network server to manage communication between LoRaWAN devices (sensor nodes) and your application.\nConfigure ChirpStack to forward data to your application server.\nInfluxDB:\nUse InfluxDB as your time-series database to store sensor data collected from renewable energy generation units.\nDefine appropriate schemas to organize and efficiently store your data.\nGrafana:\nIntegrate Grafana with InfluxDB to visualize and analyze the data collected from the renewable energy generation units.\nCreate dashboards to display real-time and historical data, including power output, temperature, voltage, and current.\nNode-RED:\nUtilize Node-RED for data processing, automation, and integration tasks.\nImplement flows to handle incoming data from ChirpStack, process it if necessary, and store it in InfluxDB.\nSet up additional flows for supervisory control tasks, such as load management or predictive maintenance.\nIntegration Steps:\nChirpStack Integration:\nConfigure ChirpStack to forward data to your Node-RED instance using MQTT or HTTP integration.\nSet up MQTT or HTTP endpoints in Node-RED to receive data from ChirpStack.\nNode-RED Data Processing:\nDevelop Node-RED flows to parse incoming data from ChirpStack, extract relevant information, and transform it if needed.\nStore the processed data into InfluxDB for long-term storage and analysis.\nInfluxDB and Grafana Integration:\nConfigure Grafana to connect to InfluxDB as a data source.\nCreate Grafana dashboards to visualize the data stored in InfluxDB, allowing users to monitor renewable energy generation units&#039; performance.\nSupervisory Control with Node-RED:\nImplement Node-RED flows to perform supervisory control tasks based on the data collected.\nUse decision-making algorithms to optimize energy generation, manage loads, or trigger maintenance actions.\nDeployment:\nDeployment Architecture:\nDeploy ChirpStack, InfluxDB, Grafana, and Node-RED on appropriate infrastructure, considering scalability, reliability, and security requirements.\nUtilize containerization (e.g., Docker) and orchestration tools (e.g., Kubernetes) for efficient management and scaling of the components.\nConfiguration and Testing:\nConfigure each component according to your specific requirements and test the end-to-end functionality thoroughly.\nEnsure proper communication between ChirpStack, Node-RED, InfluxDB, and Grafana.\nMonitoring and Maintenance:\nSet up monitoring and alerting mechanisms to detect and respond to issues promptly.\nRegularly update and maintain the system to incorporate new features, security patches, and improvements.\nCommunity and Documentation:\nCommunity Engagement:\nEngage with the ChirpStack, InfluxDB, Grafana, and Node-RED communities for support, collaboration, and knowledge sharing.\nContribute back to the open-source projects by sharing your experiences, reporting bugs, and contributing code improvements.\nDocumentation:\nDocument your integration process, configuration settings, and best practices for deploying and maintaining the IoT platform.\nProvide tutorials and guides to help others replicate and customize your setup for their renewable energy monitoring projects.<b>Skills</b>:        Internet of Things,                     Electrical Engineering,                     Arduino,                     Electronic Design,                     Embedded System,                     Python,                     Raspberry Pi,                     C++            ","link":"https://www.upwork.com/jobs/Platform-LoRa-Based-low-cost-IoT-platform-for-Renewable-Energy-Generation-Unit-Monitoring_%7E01849c19506b596f74?source=rss","processedDate":"2024-03-19T08:46:26.392Z","postedDate":"<b>Posted On</b>: March 09, 2024 13:31 UTC","id":"01849c19506b596f74"},{"skillset":["Amazon Web Services","Microsoft Azure","Terraform","Kubernetes","Grafana","Automation","Automated Monitoring","Bash Programming","Linux System Administration","Docker"],"title":"Sr DevOps Engineer - AWS  - Upwork","description":"Senior Devops Engineer - AWS , full time, 12 months contract, remote work, \nKey Responsibilities\n● Design and implement secure, scalable software architectures for diverse user demographics\nand connectivity scenarios.\n● Architect a next-gen platform infrastructure emphasizing automation, security, scalability,\nobservability, and cost-efficiency.\n● Enhance software development lifecycle tools, including CI/CD pipelines and environment\nsetups, to accelerate application delivery.\n● Manage and optimize a variety of systems, including Linux VMs and AWS services, and maintain\ninfrastructure-as-code solutions.\n● Drive DevOps best practices in the Engineering team, ensuring compliance with standards like\nSOC-2 and PCI, and automating development processes.\n● Support software enhancements by collaborating with cross-functional teams, ensuring robust\nsecurity measures, and keeping updated with cloud and programming advancements.\nREQUIREMENTS:\nBachelor&rsquo;s degree in Computer Science, Engineering, Math or comparable area of study.\n● 5+ years of demonstrated experience in a DevOps Engineer, Cloud Engineer or similar role\n● Administration of cloud-based applications (preferably AWS) and Linux-based systems.\n● Expertise in one or more infrastructure-as-code solutions (e.g. Terraform, AWS CDK,\nCloudFormation, etc.)\n● Experience with maintaining Docker-based applications with a preference towards Kubernetes\nexperience.\n● Experience with Amazon S3, RDS, DynamoDB, API Gateway, IAM, CloudFormation, SageMaker,\nEC2, ECS, EKS and/or OpenSearch\nPrior experience working with AI-based products and/or Machine Learning teams a major plus.\n● Thorough understanding of React.js and its core principles.\n● Experience with React.js and Node.js (nice-to-have)\n● Experience with writing Lambda Function backend using Python or NodeJs.\n● Experience with common front-end development tools such as NPM, Webpack, etc.<b>Skills</b>:        Amazon Web Services,                     Microsoft Azure,                     Terraform,                     Kubernetes,                     Grafana,                     Automation,                     Automated Monitoring,                     Bash Programming,                     Linux System Administration,                     Docker            ","link":"https://www.upwork.com/jobs/DevOps-Engineer-AWS_%7E0142a0826742228735?source=rss","processedDate":"2024-03-19T08:46:26.393Z","postedDate":"<b>Posted On</b>: March 07, 2024 21:35 UTC","id":"0142a0826742228735"},{"skillset":["Grafana"],"title":"Grafana Expert - Upwork","description":"Looking for a Grafana expert who can build a few dashboards for us.\nRelatively urgent project please.\nThanks<b>Skills</b>:        Grafana            ","link":"https://www.upwork.com/jobs/Grafana-Expert_%7E01edbfab17dcd2998a?source=rss","processedDate":"2024-03-19T08:46:26.393Z","postedDate":"<b>Posted On</b>: March 07, 2024 19:20 UTC","id":"01edbfab17dcd2998a"},{"skillset":["DevOps","Software","Cloud Computing","Azure DevOps","Docker","Kubernetes","Zabbix","Grafana","Prometheus","Jenkins","SonarQube","Git","ELK Stack","Terraform","NGINX"],"title":"Employee portal for background checks - Upwork","description":"I am thinking of starting an education company and I need someone to build a portal or website to do the background checks on potential candidates and myself. <b>Skills</b>:        DevOps,                     Software,                     Cloud Computing,                     Azure DevOps,                     Docker,                     Kubernetes,                     Zabbix,                     Grafana,                     Prometheus,                     Jenkins,                     SonarQube,                     Git,                     ELK Stack,                     Terraform,                     NGINX            ","link":"https://www.upwork.com/jobs/Employee-portal-for-background-checks_%7E01d9629f75c41137fd?source=rss","processedDate":"2024-03-19T08:46:26.393Z","postedDate":"<b>Posted On</b>: March 07, 2024 14:10 UTC","id":"01d9629f75c41137fd"},{"skillset":["Kubernetes","CI/CD","Deployment Automation","Amazon Web Services","DevOps","Docker","Application Release Automation","Git"],"title":"DevOps Lead - Upwork","description":"* 7+ years as a Senior DevOps Engineer\n* Understanding customer requirements and project KPIs\n* Implementing various development, testing, automation tools, and IT infrastructure\n* Defining and setting development, test, release, update, and support processes for DevOps operation\n* Identifying and deploying cybersecurity measures by continuously performing vulnerability assessment and risk management\n* Strive for continuous improvement and build continuous integration, continuous development, and constant deployment pipeline\n* MS SQL\n* GitLab\n* Kubernetes and Docker\n* Grafana, Prometheus, ArgoCD\n* Microservices Architecture\n* AWS and Azure (ideally)\n* Must have experience with deploying into customer cloud environments<b>Skills</b>:        Kubernetes,                     CI/CD,                     Deployment Automation,                     Amazon Web Services,                     DevOps,                     Docker,                     Application Release Automation,                     Git            ","link":"https://www.upwork.com/jobs/DevOps-Lead_%7E01070eaa6497ff7cd7?source=rss","processedDate":"2024-03-19T08:46:26.393Z","postedDate":"<b>Posted On</b>: March 07, 2024 01:42 UTC","id":"01070eaa6497ff7cd7"},{"skillset":["Business with 10-99 Employees","Linux System Administration","System Automation","Jenkins","Grafana","PostgreSQL"],"title":"Core Linux Administrator - Upwork","description":"About Us.\nPST.AG is a growing medium-sized business with headquarters in Germany.&nbsp;&nbsp;PST.AG is the leading provider of customs/global trade data, helping companies from a diverse range of\nindustries. \nYou are exceptionally talented, bright, and driven people. Does this sound like you? Then you must consider a career as our next&nbsp;team member.\nWhat to expect in this fascinating role?\n-Support ANs, WANs, network segments, Internet, and intranet systems\n-Ensure the design of the system allows all components to work properly together\n-Make recommendations for future upgrades\n-Maintain network and system security\n- Troubleshoot problems reported by users and analyze and isolate issues\n-Monitor networks to ensure security\n-Evaluate and modify the system&rsquo;s performance\n-Maintain network facilities in individual machines\n-Maintain the integrity of the network, server deployment, and security\n-Ensure network connectivity throughout a company&rsquo;s LAN/WAN infrastructure is on par with technical considerations\n-Design and deploy networks; Maintain network servers such as file servers, and VPN gateways\n-Perform network address assignment\n-Assign routing protocols and routing table configuration\n-Assign configuration of authentication and authorization of directory services\n-Administer servers, laptop and desktop computers, printers, routers, switches, firewalls, phones, company mobile phones, smartphones, software deployment, security updates and patches\nWho you are?\n&bull;\tA Bachelor&acute;s or Master&rsquo;s in Computer Science or any other related field.\n&bull;\tCandidates working for this position must possess at least 3 years of work experience managing core Linux system\n&bull;\tCandidates must have experience in the software development process\n&bull;\tCandidates must possess ample knowledge and experience in system automation, deployment, networking, and implementation.\n&bull;\tCandidates must have very good Troubleshooting skills on Linux system for applications, services, networking, hardware, etc.\n&bull;\tCandidates must have experience in tools and languages like SaaS(or PaaS), Gitlab (or Github), Prometheus, Grafana, and&nbsp;&nbsp;Python\n&bull;\tCandidates must have experience in at least one of these tools/languages: PostgreSQL, MySQL, ArangoDB\n&bull;\tCandidates must have experience in at least one of these tools/languages: Firewall (iptables/nftables) fail2ban, Apache Nifi, Apache Webserver\n&bull;\tThe candidates should also possess experience in HAProxy, Tomcat, keycloak, GlusterFS, Btrfs, ZFS, LVM, RAID, Mediawiki and Wikibase, DNS, Redis and SSL-Keymanagement, sftp/ftps, and virtualization on bare metal servers\n&bull;\tCandidates should also demonstrate experience in Scrappy, self-hosted proxies, and Java applications\n&bull;\tCandidates should demonstrate knowledge in handling distributed data systems.\nWhat we offer:\n- Competitive&nbsp;&nbsp;salary structure \n-Entry into a collegial, modern, and supportive working atmosphere at a market leader\n-A&nbsp;&nbsp;dedicated, global, and multicultural team\n-Preferably comfortable with working during CET hours but with a flexible schedule (40 hours a week)\n-Fully remote working opportunity\n-Flat hierarchies\n-A wide range of training opportunities\n-Applications from all over the world welcome<b>Skills</b>:        Business with 10-99 Employees,                     Linux System Administration,                     System Automation,                     Jenkins,                     Grafana,                     PostgreSQL            ","link":"https://www.upwork.com/jobs/Core-Linux-Administrator_%7E01791c27dc636c1a8b?source=rss","processedDate":"2024-03-19T08:46:26.393Z","postedDate":"<b>Posted On</b>: March 05, 2024 17:01 UTC","id":"01791c27dc636c1a8b"},{"skillset":["Jenkins","FastAPI","Swagger","Grafana"],"title":"Develop REST APIs in FastAPI for Grafana UI Integration - Upwork","description":"1) REST API specification and documentation using Swagger-UI \n2) Develop REST APIs in FastAPI for Grafana UI integration\n3) Implement best practices in Gitea/Jenkins CI/CD. \n4) Interact with the Grafana UI developer to fine-tune the APIs\nPre-requisites\nFastAPI, Swagger, Grafana, Gitea/Jenkins K8s installation will be provided for the Developer to Connect using OpenVPNConnect.<b>Skills</b>:        Jenkins,                     FastAPI,                     Swagger,                     Grafana            ","link":"https://www.upwork.com/jobs/Develop-REST-APIs-FastAPI-for-Grafana-Integration_%7E01534324fa6f31d264?source=rss","processedDate":"2024-03-19T08:46:26.393Z","postedDate":"<b>Posted On</b>: March 04, 2024 17:53 UTC","id":"01534324fa6f31d264"},{"skillset":["Grafana","Kubernetes","TypeScript"],"title":"Grafana &amp; Prometheus stack - Performance metrics - Upwork","description":"We&#039;re currently using grafana cloud&#039;s graphite API to push metrics. We&#039;re now hitting rate limits so it&#039;s time for us to scale our metrics stack up. \nWe need: \n* Scalable time-based metrics \n* Connect to existing dashboards Grafana \nTo apply answer these question: \n* What is 1 important detail when using Prometheus\n* Where would you host Prometheus and why\n* Show me a screenshot of one of the grafana dashboards you created<b>Skills</b>:        Grafana,                     Kubernetes,                     TypeScript            ","link":"https://www.upwork.com/jobs/Grafana-amp-Prometheus-stack-Performance-metrics_%7E01070cceebd0a14075?source=rss","processedDate":"2024-03-19T08:46:26.393Z","postedDate":"<b>Posted On</b>: March 01, 2024 09:43 UTC","id":"01070cceebd0a14075"},{"skillset":["Microsoft Windows","Ubuntu","Grafana","CI/CD","DevOps","Network Administration","System Administration"],"title":"Grafana/Prometheus setup/config - Upwork","description":"Wanting to setup Grafana and Prometheus as a data source. Possibly Zabbix to create monitoring dashboards. Tasks would include installation of the applications in Azure (recommend a platform) setting up the data sources and help configure dashboards.<b>Skills</b>:        Microsoft Windows,                     Ubuntu,                     Grafana,                     CI/CD,                     DevOps,                     Network Administration,                     System Administration            ","link":"https://www.upwork.com/jobs/Grafana-Prometheus-setup-config_%7E016009d659eacfd62e?source=rss","processedDate":"2024-03-19T08:46:26.393Z","postedDate":"<b>Posted On</b>: March 01, 2024 03:55 UTC","id":"016009d659eacfd62e"},{"skillset":["Grafana"],"title":"Grafana dashboard with drill down data links needed - Upwork","description":"We need to build a Prometheus/Grafana server that collects information from a custom probe.<b>Skills</b>:        Grafana            ","link":"https://www.upwork.com/jobs/Grafana-dashboard-with-drill-down-data-links-needed_%7E0158712bff55704335?source=rss","processedDate":"2024-03-19T08:46:26.393Z","postedDate":"<b>Posted On</b>: March 01, 2024 02:41 UTC","id":"0158712bff55704335"},{"skillset":["Forex Trading","MetaTrader 4","Python","Artificial Intelligence","Cryptocurrency","Grafana","Algorithm Development","Bot Development"],"title":"Binance Futures Trading Bot - Upwork","description":"Currently I am working with existing&nbsp;&nbsp;Binance Trading Future Grids Bots.\nI am looking for an experience developer to develop my specific tailor-made bot to implement with Binance Exchange.\nIf you believe that you are capable for undertaking successfully such a project, let me know to give you more information<b>Skills</b>:        Forex Trading,                     MetaTrader 4,                     Python,                     Artificial Intelligence,                     Cryptocurrency,                     Grafana,                     Algorithm Development,                     Bot Development            ","link":"https://www.upwork.com/jobs/Binance-Futures-Trading-Bot_%7E01e07180fb3994e0a0?source=rss","processedDate":"2024-03-19T08:46:26.393Z","postedDate":"<b>Posted On</b>: February 29, 2024 23:27 UTC","id":"01e07180fb3994e0a0"},{"skillset":["WordPress","PHP","Web Development","Landing Page","MySQL"],"title":"WordPress Expert needed - Upwork","description":"codesynclabs a leading US-based software house specializing in US Healthcare Software Products, is seeking to hire a Junior DevOps Engineer for its Lahore office. The Junior DevOps Engineer will have the opportunity to learn and gain hands-on experience in the following technical areas:\nResponsibilities:\nUtilizing CI/CD tools like Jenkins, Bamboo, etc.\nManaging various SQL and NoSQL databases.\nImplementing various configuration management and automation tools.\nScripting on native Linux and Windows Servers using shell, bash, batch, PowerShell.\nDeploying Java, Node, Angular &amp;amp; .NET applications on various web servers.\nUtilizing monitoring tools such as Grafana/Prometheus.\nImplementing containerization and orchestration with tools like Docker, Kubernetes, etc.\nPossessing basic coding skills in Groovy, Python, and Java.\nHaving technical knowledge of infrastructure components such as Networks &amp;amp; Systems.\nExpertise in the above areas will be considered a plus and may be compensated accordingly.<b>Skills</b>:        WordPress,                     PHP,                     Web Development,                     Landing Page,                     MySQL            ","link":"https://www.upwork.com/jobs/WordPress-Expert-needed_%7E011afbac7f8cea262d?source=rss","processedDate":"2024-03-19T08:46:26.393Z","postedDate":"<b>Posted On</b>: February 28, 2024 19:28 UTC","id":"011afbac7f8cea262d"},{"skillset":["Amazon ECS","Amazon Web Services","Terraform","Deployment Automation","DevOps","Amazon EC2","CircleCI","Microservice","Grafana","Prometheus","Kubernetes","Amazon ECS for Kubernetes"],"title":"AWS Infrastructure Deployment with Terraform - Upwork","description":"We are currently in search of a highly skilled and experienced AWS infrastructure expert to join our team. This individual will play a crucial role in deploying infrastructure using Terraform scripts. As an AWS infrastructure expert, you will have the opportunity to showcase your deep understanding of AWS services and apply best practices to ensure a smooth deployment process. The main objective of this project is to create infrastructure that is scalable, reliable, and cost-effective.\nResponsibilities:\n- As an integral member of our team, you will be responsible for utilizing Terraform to provision and manage infrastructure on AWS.\n- Following industry best practices, you will ensure optimal performance and security in all infrastructure deployments.\n- Collaborating closely with the development and operations teams, you will have the opportunity to gain insights into the infrastructure requirements and effectively address them.\n- Implementing and maintaining infrastructure as code using Terraform scripts will be a key responsibility in this role.\n- Troubleshooting and resolving any issues related to infrastructure deployment will be an ongoing task.\nRequired Skills:\n- The ideal candidate will have a strong background and experience working with AWS services, with a particular emphasis on EC2, S3, VPC, and IAM.\n- Proficiency in Terraform and a solid understanding of infrastructure as code concepts are essential for success in this role.\n- Knowledge of networking principles and best practices is highly desirable.\n- Familiarity with DevOps and CI/CD pipelines will be considered advantageous.\n- Excellent problem-solving and communication skills are a must.\nThis project is of medium size and is estimated to be completed within a timeframe of 1 to 3 months. We are specifically seeking an intermediate-level AWS infrastructure expert who can work independently and deliver high-quality results.\nInfrastructure to be deployed:\n - VPC\n - EKS\n - ASG\n - KMS encrypted Volume\n - ELK Stack\n - Grafana\n - Application Deployment\nIf you are truly passionate about AWS infrastructure deployment and possess a proven track record of successfully implementing Terraform scripts, we would be thrilled to hear from you. To help us evaluate your application, please include examples of your previous work and any relevant certifications that you hold. We truly believe that the right candidate will thrive in this role and make a significant impact on our team and organization.<b>Skills</b>:        Amazon ECS,                     Amazon Web Services,                     Terraform,                     Deployment Automation,                     DevOps,                     Amazon EC2,                     CircleCI,                     Microservice,                     Grafana,                     Prometheus,                     Kubernetes,                     Amazon ECS for Kubernetes            ","link":"https://www.upwork.com/jobs/AWS-Infrastructure-Deployment-with-Terraform_%7E016d34013991e57f6a?source=rss","processedDate":"2024-03-19T08:46:26.394Z","postedDate":"<b>Posted On</b>: February 28, 2024 11:22 UTC","id":"016d34013991e57f6a"},{"skillset":["Symfony","PHP","Symfony 4","MySQL"],"title":"Senior PHP dev with Symfony (romanian speaking only) - Upwork","description":"Romanian project with big existing team is looking for a Romanian-speaking senior php developer with experience in Symfony4 and above.\nPlease only apply if: full-time (8h/day) is possible from may and you can start with at least 6h/day on 15march. \nPHP Requirements&nbsp;&nbsp;-Senior Level:\n&bull; Experience in developing web applications (at least 4-5 years);\n&bull; Extensive experience with PHP and SQL (MySQL, PostgreSQL, or SQL Server);\n&bull; Good understanding of MVC frameworks (Symfony 4 or newer) and application architecture patterns;\n&bull; Knowledge of front-end concepts (HTML, CSS, JavaScript);\n&bull; Experience with caching systems of any sort but preferable: Redis;\n&bull; Familiar with monitoring tools such as Kibana, New Relic, PMM or Grafana;\n&bull; Familiar with queueing systems such as RabbitMQ;\n&bull; Knowledge of web services (RESTful / SOAP), JSON, XML, web servers (Apache / Nginx), containers (Docker, Kubernetes), Linux, and communication protocols;\n&bull; Good interpersonal and teamwork skills;\n&bull; Interest in continuous career development;\nAbility to express your thoughts in English (written or spoken).<b>Skills</b>:        Symfony,                     PHP,                     Symfony 4,                     MySQL            ","link":"https://www.upwork.com/jobs/Senior-PHP-dev-with-Symfony-romanian-speaking-only_%7E019e913e4e039758aa?source=rss","processedDate":"2024-03-19T08:46:26.394Z","postedDate":"<b>Posted On</b>: February 28, 2024 07:21 UTC","id":"019e913e4e039758aa"},{"skillset":["Linux","New Relic","MongoDB","Automated Monitoring","Microsoft Windows","AWS Lambda","Grafana"],"title":"Grafana Monitoring for AWS Lambda and Servers - Upwork","description":"We need a good and stable monitoring system. Grafana and or New Relic looks good for us.\nThe monitoring system should:\n- monitor Server (Windows, Linux)\n- (optional) monitor Clients (Windows, Linux, Mac)\n- monitor AWS Lambda&nbsp;&nbsp;X-Ray\n- vue applications without get blocked by adblocker\n- report issues into our slack channel<b>Skills</b>:        Linux,                     New Relic,                     MongoDB,                     Automated Monitoring,                     Microsoft Windows,                     AWS Lambda,                     Grafana            ","link":"https://www.upwork.com/jobs/Grafana-Monitoring-for-AWS-Lambda-and-Servers_%7E016cdb7d96b10c9ff9?source=rss","processedDate":"2024-03-19T08:46:26.394Z","postedDate":"<b>Posted On</b>: February 27, 2024 07:54 UTC","id":"016cdb7d96b10c9ff9"},{"skillset":["DevOps","Docker","CI/CD","Kubernetes"],"title":"DevOps Engineer - Upwork","description":"We&#039;re looking for an experienced DevOps Engineer to work with us remotely. Your job will be to help us build and take care of our cloud setup and how we release software, mainly using Microsoft Azure.\nWhat you&#039;ll do:\n- Set up and manage our cloud infrastructure on Azure.\n- Use DevOps and Agile methods to improve how we build and deploy software.\n- Talk to team members to figure out what we need and come up with solutions.\n- Work with Azure Functions and keep them running smoothly.\n- Handle the whole software life cycle with tools like Git.\n- Use Kubernetes for managing containers.\n- Make sure our infrastructure and apps are monitored well and secure.\n- Use Docker to containerize apps and Terraform for infrastructure code.\n- Manage databases like PostgreSQL, MS SQL Server, and Redis.\n- Create pipelines with Azure Pipelines.\n- Be good at using Linux, command lines, and scripting with Python or Bash.\n- Set up and oversee Prometheus and Grafana for monitoring and logging.\n- Know your way around networks.\n- Be fluent in English, both in writing and speaking.\nWho we&#039;re looking for:\nSomeone skilled in Azure, Terraform, Python, and more. If you&#039;ve got the experience and the skills, we&#039;d love to see your resume and any certifications you have.\nLocation: Europe<b>Skills</b>:        DevOps,                     Docker,                     CI/CD,                     Kubernetes            ","link":"https://www.upwork.com/jobs/DevOps-Engineer_%7E013badd70525355d69?source=rss","processedDate":"2024-03-19T08:46:26.394Z","postedDate":"<b>Posted On</b>: February 26, 2024 20:10 UTC","id":"013badd70525355d69"},{"skillset":["Software Development","Product Management","Quality Assurance","Market Research","Email Support"],"title":"Product Support / Marketing Manager in Uzbekistan - Upwork","description":"ATTENTION\nThis project/position is only for freelancers from Uzbekistan and involves working with a team of Uzbek developers. Please submit your weekly/monthly rate when you apply for the project.\n===============================\nWe are inviting ambitious professionals who are ready to participate in the creation of AI (ChatGPT) add-ins for Microsoft Excel and PowerPoint&nbsp;&nbsp;and help to support our customers. \nOur Excel add-in is #1 Most Viewed add-in on the Microsoft AppSource Marketplace:\n1. Excel https://appsource.microsoft.com/en-us/product/office/WA200005271?tab=Overview\n2. PowerPoint https://appsource.microsoft.com/en-us/product/office/WA200005566?tab=Overview\nBoth add-ins have thousands of people using them on a daily basis.\nWHAT WILL YOU WORK ON?\n==Customer Support==\n- Respond to customer emails\n- Help troubleshoot issues\n- Help customers with product adoption\n- Create training videos\n- Create help articles\n- Product Development\n==Provide product requirements==\n- Help with product testing and product releases\n- Product usage analysis and dashboards (grafana, google - analytics)\n- Conduct research &amp;amp; data gathering\n==Marketing==\n- Keep website up to date\n- Create articles/blog pages on website\nWHAT SKILLS AND EXPERIENCE ARE WE LOOKING FOR?\n- Solid knowledge of Excel and PowerPoint\n- Proficiency in English from Upper-Intermediate and higher: you will have to communicate with English-speaking clients via email\n- Familiarity with SaaS products<b>Skills</b>:        Software Development,                     Product Management,                     Quality Assurance,                     Market Research,                     Email Support            ","link":"https://www.upwork.com/jobs/Product-Support-Marketing-Manager-Uzbekistan_%7E01bc6f343344b17f4e?source=rss","processedDate":"2024-03-19T08:46:26.394Z","postedDate":"<b>Posted On</b>: February 26, 2024 17:34 UTC","id":"01bc6f343344b17f4e"},{"skillset":["Zabbix","VMWare","Grafana","System Monitoring"],"title":"Implement a Opensource monitoring Solution wth nice dashboards - Upwork","description":"Responsibilities:\nImplement and customize monitoring solutions using Zabbix or checkmk.\nDevelop visually appealing and informative dashboards tailored to specific client needs.\nEnsure seamless deployment across diverse client environments, including Windows, VMware, and Citrix.\nCollaborate with clients to understand their monitoring requirements and provide effective solutions.\nTroubleshoot and resolve any issues during the implementation phase.\nRequirements:\nProven experience in implementing monitoring solutions, particularly with Zabbix or checkmk.\nStrong proficiency in creating customized dashboards for effective data visualization.\nAbility to adapt solutions to various client environments, including Windows, VMware, and Citrix.\nExcellent communication skills to engage with clients and gather requirements.\nProblem-solving skills to address challenges during the implementation process.<b>Skills</b>:        Zabbix,                     VMWare,                     Grafana,                     System Monitoring            ","link":"https://www.upwork.com/jobs/Implement-Opensource-monitoring-Solution-wth-nice-dashboards_%7E01d478881b53075f74?source=rss","processedDate":"2024-03-19T08:46:26.394Z","postedDate":"<b>Posted On</b>: February 25, 2024 19:20 UTC","id":"01d478881b53075f74"},{"skillset":["Back-End Development","Front-End Development"],"title":"Head of tech - Upwork","description":"Your Responsibilities\nManage the technical and operational side of the platform. This includes the responsibility of overseeing and coordinating all technology-related activities. This encompasses planning and executing technical strategies, managing technological workflows, solving technical issues, and ensuring that technological solutions meet both business and customer needs.\nRequirements:\nFor the position of Head of Tech at Ri-Hub, we are looking for a professional with solid technical skills in both back-end and front-end development, as well as the ability to work with specific services and manage server infrastructure.\n- The ideal candidate should have back-end experience with: FastAPI, SQLAlchemy for database ORM, Alembic for database migrations, and a strong command of Python.\n- On the front-end side, we are looking for skills in Vue.js and Quasar framework, with experience in using Pinia as state manager and Axios for HTTP requests.\n- Familiarity with Agora for video calls, Stripe for payments, and Mailtrap for email services is essential.\n- Experience in server management using Docker, Prometheus, Grafana, Portainer, and skills in push/pull operations on GitHub are appreciated.\n- We also value the ability to develop mirror applications for publication on iOS and Google app stores.<b>Skills</b>:        Back-End Development,                     Front-End Development            ","link":"https://www.upwork.com/jobs/Head-tech_%7E014ac252dca3c7184b?source=rss","processedDate":"2024-03-19T08:46:26.394Z","postedDate":"<b>Posted On</b>: February 25, 2024 09:01 UTC","id":"014ac252dca3c7184b"},{"skillset":["Software Development","Product Management","Quality Assurance","Market Research","Email Support"],"title":"Product Owner / Marketing Manager in Uzbekistan - Upwork","description":"ATTENTION\nThis project/position is only for freelancers from Uzbekistan and involves working with a team of Uzbek developers. Please submit your weekly/monthly rate when you apply for the project.\n===============================\nWe are inviting ambitious professionals who are ready to participate in the creation of AI (ChatGPT) add-ins for Microsoft Excel and PowerPoint&nbsp;&nbsp;and help to support our customers. \nOur Excel add-in is #1 Most Viewed add-in on the Microsoft AppSource Marketplace:\n1. Excel https://appsource.microsoft.com/en-us/product/office/WA200005271?tab=Overview\n2. PowerPoint https://appsource.microsoft.com/en-us/product/office/WA200005566?tab=Overview\nBoth add-ins have thousands of people using them on a daily basis.\nWHAT WILL YOU WORK ON?\n==Customer Support==\n- Respond to customer emails\n- Help troubleshoot issues\n- Help customers with product adoption\n- Create training videos\n- Create help articles\n- Product Development\n==Provide product requirements==\n- Help with product testing and product releases\n- Product usage analysis and dashboards (grafana, google - analytics)\n- Conduct research &amp;amp; data gathering\n==Marketing==\n- Keep website up to date\n- Create articles/blog pages on website\nWHAT SKILLS AND EXPERIENCE ARE WE LOOKING FOR?\n- Solid knowledge of Excel and PowerPoint\n- Proficiency in English from Upper-Intermediate and higher: you will have to communicate with English-speaking clients via email\n- Familiarity with SaaS products<b>Skills</b>:        Software Development,                     Product Management,                     Quality Assurance,                     Market Research,                     Email Support            ","link":"https://www.upwork.com/jobs/Product-Owner-Marketing-Manager-Uzbekistan_%7E0121902437397b86a1?source=rss","processedDate":"2024-03-19T08:46:26.394Z","postedDate":"<b>Posted On</b>: February 24, 2024 00:22 UTC","id":"0121902437397b86a1"},{"skillset":["Business with 10-99 Employees","Linux System Administration","System Automation","Jenkins","Grafana","PostgreSQL"],"title":"Linux System Administrator - Upwork","description":"About Us.\nPST.AG is a growing medium-sized business with headquarters in Germany.&nbsp;&nbsp;PST.AG is the leading provider of customs/global trade data, helping companies from a diverse range of\nindustries. \nYou are exceptionally talented, bright, and driven people. Does this sound like you? Then you must consider a career as our next&nbsp;team member.\nWhat to expect in this fascinating role?\n-Support ANs, WANs, network segments, Internet, and intranet systems\n-Ensure the design of the system allows all components to work properly together\n-Make recommendations for future upgrades\n-Maintain network and system security\n- Troubleshoot problems reported by users and analyze and isolate issues\n-Monitor networks to ensure security\n-Evaluate and modify the system&rsquo;s performance\n-Maintain network facilities in individual machines\n-Maintain the integrity of the network, server deployment, and security\n-Ensure network connectivity throughout a company&rsquo;s LAN/WAN infrastructure is on par with technical considerations\n-Design and deploy networks; Maintain network servers such as file servers, and VPN gateways\n-Perform network address assignment\n-Assign routing protocols and routing table configuration\n-Assign configuration of authentication and authorization of directory services\n-Administer servers, laptop and desktop computers, printers, routers, switches, firewalls, phones, company mobile phones, smartphones, software deployment, security updates and patches\nWho you are?\n-A Bachelor&acute;s or&nbsp;&nbsp;Master&rsquo;s in Computer Science or any other field.\n- At least 5 years of work experience as a Linux Administrator.\n- Ample knowledge and experience in system automation, deployment, networking, and implementation.\n-Experience in using Linux, Jenkins, and ample\nexperience in configuring and automating the monitoring tools.\n-Desirable experience in the software development process and tools and languages like SaaS, Prometheus, Grafana, Python, PostgreSQL, MySQL, ArangoDB, and Gitlab.&nbsp;\n-Desirable knowledge in handling distributed data systems. \n-Desirable hands-on knowledge in the following tech areas: Firewall iptables/nftables, fail2ban, Apache Nifi, Apache Webserver,HAProxy, Tomcat, keycloak, GlusterFS, Btrfs, ZFS, LVM, md, Mediawiki and Wikibase, DNS, Redis and SSL-Keymanagement\nWhat we offer:\n- Competitive&nbsp;&nbsp;salary structure \n-Entry into a collegial, modern, and supportive working atmosphere at a market leader\n-A&nbsp;&nbsp;dedicated, global, and multicultural team\n-Preferably comfortable with working during CET hours but with a flexible schedule (40 hours a week)\n-Fully remote working opportunity\n-Flat hierarchies\n-A wide range of training opportunities\n-Applications from all over the world welcome<b>Skills</b>:        Business with 10-99 Employees,                     Linux System Administration,                     System Automation,                     Jenkins,                     Grafana,                     PostgreSQL            ","link":"https://www.upwork.com/jobs/Linux-System-Administrator_%7E010da0e549d0fb5872?source=rss","processedDate":"2024-03-19T08:46:26.394Z","postedDate":"<b>Posted On</b>: February 23, 2024 18:32 UTC","id":"010da0e549d0fb5872"},{"skillset":["DevOps","Grafana","Linux","Python"],"title":"Log Monitoring Solution Setup with Grafana Dashboard for WebLogic Servers - Upwork","description":"We are seeking an experienced IT professional to implement a log monitoring solution for our on-premises WebLogic servers. We have five WebLogic servers generating logs within the applog folder at specific paths. We aim to set up a robust monitoring system using Grafana dashboard to visualize logs and monitor server performance metrics such as CPU, hard disk, and memory usage.\nResponsibilities:\nConfigure log monitoring for five WebLogic servers, capturing logs from the applog folder at specified paths.\nSet up Grafana dashboard to visualize log data and server performance metrics in real-time.\nImplement alerting mechanisms in Grafana to notify the team of any critical issues or anomalies.\nEnsure seamless integration between Grafana and WebLogic servers for data retrieval and monitoring.\nProvide documentation and training to our team for managing and utilizing the monitoring solution effectively.<b>Skills</b>:        DevOps,                     Grafana,                     Linux,                     Python            ","link":"https://www.upwork.com/jobs/Log-Monitoring-Solution-Setup-with-Grafana-Dashboard-for-WebLogic-Servers_%7E01ab46d3c168b8a80d?source=rss","processedDate":"2024-03-19T08:46:26.394Z","postedDate":"<b>Posted On</b>: February 23, 2024 14:32 UTC","id":"01ab46d3c168b8a80d"},{"skillset":["Linux","Amazon Web Services","Web Hosting","Kibana","Logstash","Docker Compose","Elasticsearch","Prometheus","Grafana","Kubernetes"],"title":"Using elk for reporting ,querying billing - Upwork","description":"Problem to solve - I have a index in elk where requests will be logged ...there are details in requests like response code,username , organization etc ...let&#039;s say org 1 having 3 users ..I want to query data like org 1 including all three users or individuallly which all api they consumed success count failure count with the help of query ..there are other two use cases will discuss if you are in sync with this <b>Skills</b>:        Linux,                     Amazon Web Services,                     Web Hosting,                     Kibana,                     Logstash,                     Docker Compose,                     Elasticsearch,                     Prometheus,                     Grafana,                     Kubernetes            ","link":"https://www.upwork.com/jobs/Using-elk-for-reporting-querying-billing_%7E014f8050a126766d97?source=rss","processedDate":"2024-03-19T08:46:26.394Z","postedDate":"<b>Posted On</b>: February 22, 2024 03:42 UTC","id":"014f8050a126766d97"},{"skillset":["Automated Monitoring","Ubuntu","Ansible","DevOps","Linux System Administration","Linux","Grafana"],"title":"Grafana tutorial - Set up dashboards for multiple linux servers and web apps - Upwork","description":"I am looking for a Grafana expert to assist me in setting up dashboards for my systems. I need to set up a monitoring system to monitor servers, web apps and other metrics.\nThis will be done over a call and through screen sharing, the format will be similar to an interactive tutorial where you guide me through the grafana UI and explain features.\nCost: FIXED (20$)\nFormat: Online call with screen sharing. This will take 1 to 3 hours (maximum) and can be split over the course of 2 days.<b>Skills</b>:        Automated Monitoring,                     Ubuntu,                     Ansible,                     DevOps,                     Linux System Administration,                     Linux,                     Grafana            ","link":"https://www.upwork.com/jobs/Grafana-tutorial-Set-dashboards-for-multiple-linux-servers-and-web-apps_%7E01b346555fdf60c9fa?source=rss","processedDate":"2024-03-19T08:46:26.394Z","postedDate":"<b>Posted On</b>: February 21, 2024 12:43 UTC","id":"01b346555fdf60c9fa"},{"skillset":["Configuration Management","Cybersecurity Management","Incident Response Plan","Information Security","Information Security Consultation","Malware Removal","Penetration Testing","Security Policies &amp; Procedures Documentation","OpenVAS","Digital Forensics"],"title":"Wazuh integration into SOC setup .  - Upwork","description":"Objectives.\nAble to work to a task list.\nBuild a complete opensource security operations backend and frontend.\nMust be able to be easily configurable for our clients. \nTenanting is a must.\nBe able to connect to remote clients with endpoint tools.\nManage those endpoints\nSet alert levels for security for alerting via email, sms, push notifications\nCompletely integrated into a SOC operations centre for easy management.\nIntegrating other components and apps into Wazuh\nsetting up security on the VPS systems connected together\nTools to use as an example.\nWazuh\nMisp\nELK\nGrafana\nPrometheus\nVelociraptor\nDFIR-IRIS\nNetbox\nShuffle\nAnsible\nMitre Attack\nand more.<b>Skills</b>:        Configuration Management,                     Cybersecurity Management,                     Incident Response Plan,                     Information Security,                     Information Security Consultation,                     Malware Removal,                     Penetration Testing,                     Security Policies &amp; Procedures Documentation,                     OpenVAS,                     Digital Forensics            ","link":"https://www.upwork.com/jobs/Wazuh-integration-into-SOC-setup_%7E01bb64eee60bcc4a66?source=rss","processedDate":"2024-03-19T08:46:26.394Z","postedDate":"<b>Posted On</b>: February 21, 2024 03:38 UTC","id":"01bb64eee60bcc4a66"},{"skillset":["API","Kubernetes","Docker","DevOps","Deployment Automation","CI/CD","Amazon Web Services","CI/CD Platform","Containerization"],"title":"deploy a microservice app to EKS - Upwork","description":"We are seeking an experienced Microservices Architect &amp;amp; Developer to join our dynamic team. The ideal candidate will be responsible for designing, implementing, and deploying microservice-based applications to Amazon EKS. This role requires a deep understanding of microservice architecture, containerization, Kubernetes, and AWS cloud services.\nKey Responsibilities:\nMicroservice Architecture Design: Design and architect microservice-based applications considering scalability, maintainability, and security.\nDevelopment: Implement microservices in a preferred programming language (e.g., Java, Python, Node.js) adhering to best coding practices.\nContainerization: Containerize microservices using Docker, ensuring optimal configuration and efficiency.\nKubernetes Deployment: Deploy and manage microservices on Amazon EKS, including setting up clusters, pods, and managing service discovery.\nCI/CD Pipeline Integration: Develop and maintain CI/CD pipelines for automated testing and deployment using tools like Jenkins, GitLab CI, or AWS CodePipeline.\nMonitoring and Logging: Implement monitoring and logging solutions for microservices in EKS using tools like Prometheus, Grafana, and ELK stack.\nPerformance Tuning: Optimize application for maximum speed and scalability.\nDocumentation: Create detailed documentation for the microservices architecture and deployment procedures.<b>Skills</b>:        API,                     Kubernetes,                     Docker,                     DevOps,                     Deployment Automation,                     CI/CD,                     Amazon Web Services,                     CI/CD Platform,                     Containerization            ","link":"https://www.upwork.com/jobs/deploy-microservice-app-EKS_%7E018af92ba74e015d6a?source=rss","processedDate":"2024-03-19T08:46:26.394Z","postedDate":"<b>Posted On</b>: February 20, 2024 18:05 UTC","id":"018af92ba74e015d6a"},{"skillset":["Django","PostgreSQL","Python","JavaScript","API Integration"],"title":"Django Backend/Full Stack Developer - Upwork","description":"Position Overview: We are seeking a talented Django Backend/Full Stack Developer to join our dynamic team. The ideal candidate should have solid experience working with Django and its ORM, PostgreSQL, Jinja, HTML, CSS, and JavaScript. The primary focus of this role will be backend development, but a good understanding of frontend technologies is essential.\nKey Responsibilities:\nDevelop and maintain robust backend solutions using Django and Django ORM.\nDesign, implement, and optimize PostgreSQL database schemas and queries within Django applications.\nImplement frontend components using HTML, CSS, and JavaScript.\nWrite efficient, reusable, and testable code.\nParticipate in code reviews and provide constructive feedback.\nTroubleshoot and debug issues across the stack.\nDocument code and solutions thoroughly.\nContinuously learn and stay updated with the latest technologies and best practices in web development.\nRequirements:\nProficiency in Django framework and Django ORM.\nStrong understanding of PostgreSQL database management with Django.\nSolid grasp of frontend technologies including HTML, CSS, and JavaScript.\nExperience with Jinja templating language.\nDemonstrated experience in version control systems, preferably Git, and maintaining GitHub repositories or relevant work with Django projects.\nKnowledge of Docker containers is a plus.\nFamiliarity with cloud platforms such as AWS and Azure is advantageous.\nExtra points for experience with Grafana, Nginx, and GitLab CI.\nExcellent problem-solving skills and attention to detail.\nStrong communication and collaboration skills.\nAbility to work independently as well as part of a team.\nExtra Plus:\nKnowledge of Grafana for monitoring and analytics.\nExperience configuring and maintaining Nginx for web server needs.\nFamiliarity with GitLab CI for continuous integration and deployment pipelines.\nPlease attach your GitHub profile or any similar link to your pervious projects. <b>Skills</b>:        Django,                     PostgreSQL,                     Python,                     JavaScript,                     API Integration            ","link":"https://www.upwork.com/jobs/Django-Backend-Full-Stack-Developer_%7E0179cbd9a3f6aaa852?source=rss","processedDate":"2024-03-19T08:46:26.394Z","postedDate":"<b>Posted On</b>: February 20, 2024 16:14 UTC","id":"0179cbd9a3f6aaa852"},{"skillset":["Kubernetes","Google Cloud Platform","Elasticsearch","DevOps"],"title":"Opentelemtry jaeger prometheus and elasticsearch expert needed - Upwork","description":"I need help setting up OTEL on GKE, with Jaeger+Elasticsearch for span, and prometheus for metrics. I already have all the parts setup and running, but not able to view any data on the Jaeger UI. \nI need help with production grade setup. Please apply if you have worked with it before. <b>Skills</b>:        Kubernetes,                     Google Cloud Platform,                     Elasticsearch,                     DevOps            ","link":"https://www.upwork.com/jobs/Opentelemtry-jaeger-prometheus-and-elasticsearch-expert-needed_%7E01b8ee98fe18c5af8d?source=rss","processedDate":"2024-03-19T08:46:26.394Z","postedDate":"<b>Posted On</b>: February 19, 2024 12:55 UTC","id":"01b8ee98fe18c5af8d"},{"skillset":["Ubuntu","Prometheus","Grafana","Python","Raspberry Pi","Linux System Administration","Network Security"],"title":"Deploy NetProbify (Github Project) probe network WAN/LAN - Upwork","description":"We found a NETPROBIFY project on GitHub allowing us to analyze network performance with probes. We want to deploy this to our customers to test the quality of the internet link as well as the quality of our internal inter-switch infrastructure. We would like to deploy this project on machines with Ubuntu. I attach a diagram of the project<b>Skills</b>:        Ubuntu,                     Prometheus,                     Grafana,                     Python,                     Raspberry Pi,                     Linux System Administration,                     Network Security            ","link":"https://www.upwork.com/jobs/Deploy-NetProbify-Github-Project-probe-network-WAN-LAN_%7E010a167af2dd83f923?source=rss","processedDate":"2024-03-19T08:46:26.394Z","postedDate":"<b>Posted On</b>: February 14, 2024 14:13 UTC","id":"010a167af2dd83f923"},{"skillset":["Google Cloud Platform"],"title":"Looking for Google Cloud Expert  - Upwork","description":"We need a Google Cloud Expert to set up our solution on the Google Cloud.\nWe are using the following stacks on Google Cloud \nKubernetes\nCloud Functions\nCompute Engine\nCloud SQL\nLogger\nCloud Storage<b>Skills</b>:        Google Cloud Platform            ","link":"https://www.upwork.com/jobs/Looking-for-Google-Cloud-Expert_%7E0118ebb2b12b3b7e53?source=rss","processedDate":"2024-03-19T08:46:26.394Z","postedDate":"<b>Posted On</b>: February 14, 2024 10:36 UTC","id":"0118ebb2b12b3b7e53"},{"skillset":["React","Next.js","Material UI","ExpressJS"],"title":"Full Stack Development Work - Upwork","description":"Add a self serve signup flow with stripe paywall for nextjs/joyui/expressjs app.\nIf this goes well, we&#039;ll have projects for the next 12 months that involve making additional updates to the app.\nOur stack:\n Code\n- Typescript for Backend (Express) and Frontend (React, Next, &amp;amp; Material)\n- Rust for the pipeline agent (specifically, [vector](https://vector.dev/))\n- Python for ML and Analytics Engine\nInfra\n- AWS\n- Kubernetes (EKS)\n- Grafana &amp;amp; Prometheus for monitoring\n- CDK and Kubectl for IaC\nTools\n- VSCode\n- Github\n- Linux based dev environment (Mac or Linux)<b>Skills</b>:        React,                     Next.js,                     Material UI,                     ExpressJS            ","link":"https://www.upwork.com/jobs/Full-Stack-Development-Work_%7E0162c1bcdd6cae1744?source=rss","processedDate":"2024-03-19T08:46:26.394Z","postedDate":"<b>Posted On</b>: February 06, 2024 19:36 UTC","id":"0162c1bcdd6cae1744"},{"skillset":["PostgreSQL","Symfony","React","PHP","JavaScript"],"title":"Looking for agency with extensive PHP tech stack experience to maintain/upgrade SaaS application - Upwork","description":"Hello!\nI am looking for an agency to help maintain &amp;amp; develop features for a SaaS/cloud application, including server maintenance/monitoring. The agency will be fully responsible for the application as the IT experts, including access to production for deployments, troubleshooting, server patching, and so on.\nI will need roughly a 60 hour monthly retainer, including 24/7 automated server monitoring (e.g. Pingdom, etc.) and support in case of any outages. This can be a multi-year engagement if your agency can provide these types of services and has the necessary skills.\nThese are the primary technologies you need experience with:\nReact\nVite.js\nSymfony\nUbuntu\nNode.js\nRedis \nPostgreSQL\nDigitalOcean\nCloudflare Workers\nGrafana\nPrometheus\nSentry\nIf you have experts with SaaS/cloud application experience and can assign 1-2 people to my account, please apply and provide as much information as possible to illustrate your experience. <b>Skills</b>:        PostgreSQL,                     Symfony,                     React,                     PHP,                     JavaScript            ","link":"https://www.upwork.com/jobs/Looking-for-agency-with-extensive-PHP-tech-stack-experience-maintain-upgrade-SaaS-application_%7E01a1dcc1894aebac7d?source=rss","processedDate":"2024-03-19T08:46:26.394Z","postedDate":"<b>Posted On</b>: January 31, 2024 21:38 UTC","id":"01a1dcc1894aebac7d"},{"skillset":["Django","Python","Cryptocurrency","Blockchain Development","DApps","Ethereum","Smart Contract Development","NFT Marketplace","Solidity","Blockchain","Blockchain","NFT &amp; Cryptocurrency","Web3","Ethers.js","web3.js","Smart Contract"],"title":"Node Deployment  - Upwork","description":"Project Overview:\nOur project involves creating a One-Click Node Operator service, enabling clients to easily deploy nodes on our hosted Virtual Private Servers (VPS). The user interface will be a web application where clients can select from various node options, complete their purchase using cryptocurrency, and subsequently receive details for accessing a dashboard (similar to Grafana) to monitor their deployed node.\nKey Features:\n&nbsp;&nbsp;&nbsp;&nbsp;A variety of node options for deployment\n&nbsp;&nbsp;&nbsp;&nbsp;Cryptocurrency-based payment system\n&nbsp;&nbsp;&nbsp;&nbsp;User-friendly dashboard for monitoring node performance\n&nbsp;&nbsp;&nbsp;&nbsp;Flexible hosting terms ranging from 1 to 12 months, based on customer preference\nCurrent Status and Goals:\nWe are in the initial stages of website development and aim to begin testing node deployment within the next few weeks. Our ambition is to scale this operation significantly, reaching a total node count in the thousands in a relatively short timeframe. Additionally, we plan to host our own nodes within the VPS infrastructure.\nYour Role:\nAs a vital member of our team, you will be instrumental in developing and refining these services, ensuring scalability, security, and user-friendliness.\nIf this project aligns with your interests and expertise, we would be thrilled to discuss it further with you. Your contribution could be crucial in bringing this innovative service to fruition.\nThank you for considering this opportunity. I look forward to potentially collaborating with you and welcome any questions or discussions about the project.<b>Skills</b>:        Django,                     Python,                     Cryptocurrency,                     Blockchain Development,                     DApps,                     Ethereum,                     Smart Contract Development,                     NFT Marketplace,                     Solidity,                     Blockchain,                     Blockchain, NFT &amp; Cryptocurrency,                     Web3,                     Ethers.js,                     web3.js,                     Smart Contract            ","link":"https://www.upwork.com/jobs/Node-Deployment_%7E01146f654189481959?source=rss","processedDate":"2024-03-19T08:46:26.394Z","postedDate":"<b>Posted On</b>: January 28, 2024 21:35 UTC","id":"01146f654189481959"},{"skillset":["Ubuntu","Linux","Configuration Management","Deployment Automation","Ansible","DevOps","Linux System Administration"],"title":"Finish Ansible playbook configuration with Podman containers - Upwork","description":"Hello,\nI&#039;m looking for someone who will complete an Ansible script.\nYou can find the current state here: https://gitlab.com/vade.io/nsblupwrk\nIn the end, the Ansible playbook should fulfil the conditions in this issue: https://gitlab.com/vade.io/nsblupwrk/-/issues/1 .\nI tried to describe everything as detailed as possible and I even included examples or links to examples (i.e. Ansible roles and compose files). So most of the things probably won&#039;t need much investigation but it needs someone who will actually finish it and has some experience with Podman.\nThe basic idea is to have an Ansible script to provision an Ubuntu 22.04 machine with rootless Podman ( https://podman.io/ ) services like these examples:\n- KanIDM for LDAP and OpenID Connect / OAuth / SSO\n- Bunkerweb ( https://github.com/bunkerity/bunkerweb#bunkerweb )\n- Stalwart Mailserver ( https://stalw.art/ )\n- the following apps: Grafana, VictoriaMetrics, Loki, GitLab, Healthchecks, Glitchtip, Mattermost, Vaultwarden, Nextcloud, AdGuardHome, Wireguard, OpenProject\n- the apps should use KanIDM as the backend for authentication\n- all of their dependencies (i.e. databases)\nThis Ansible playbook should NOT use Kubernetes or Docker.\nThe whole setup should have automated Letsencrypt configuration for all exposed ports.\nPrivileged ports should be setup with port forwarding of the firewall so that the firewall forwards privileged ports to the unprivileged containers.\nIf you are interested let me know what would be your offer and what your estimation for a delivery date would be.\nSome of the current issues:\n- Bunkerweb seem to have a permission issue ( `Wrong permissions on /data/cache (RWX needed for user nginx with uid 101 and gid 101)` )\n- activating secrets is giving a permission issue (`Failed to set permissions on the temporary files Ansible needs to create when becoming an unprivileged user (rc: 1, err: chmod: invalid mode: &#039;+a&#039;`)\n- GitLab seems to fail with `Mixlib::ShellOut::ShellCommandFailed: rails_migration[gitlab-rails] (gitlab::database_migrations line 51) ha\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;│ d an error: Mixlib::ShellOut::ShellCommandFailed: bash_hide_env[migrate gitlab-rails database] (gitlab::database_migrations line 18) had an error: Mixlib::ShellOut::ShellCommandFa\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;│ iled: Expected process to exit with [0], but received &#039;137&#039;`\nPlease tell my how much time you would need and on which date you would be able to finish the playbook.<b>Skills</b>:        Ubuntu,                     Linux,                     Configuration Management,                     Deployment Automation,                     Ansible,                     DevOps,                     Linux System Administration            ","link":"https://www.upwork.com/jobs/Finish-Ansible-playbook-configuration-with-Podman-containers_%7E015bd76ed936af68ba?source=rss","processedDate":"2024-03-19T08:46:26.394Z","postedDate":"<b>Posted On</b>: January 22, 2024 22:28 UTC","id":"015bd76ed936af68ba"},{"skillset":["Kubernetes","Docker","Jenkins","Web Application","Cloud Computing","GPU","Google Cloud Platform","Amazon Web Services","Database Architecture"],"title":"Cloud Platform - Upwork","description":"Senior Cloud Platform Engineer\nLocation: Remote\nCompany Overview:\nNeural Internet has built a subnetwork that integrates various cloud platforms (e.g., Runpod, Lambda, AWS) into a cohesive unit. Its purpose is to enable higher-level cloud platforms to offer seamless compute composability across different underlying platforms. With the proliferation of cloud platforms, there&#039;s a growing need for a subnetwork that can seamlessly integrate these platforms, allowing efficient resource sharing and allocation. This compute-composable subnet empowers nodes to contribute computational power, with validators ensuring the integrity and efficiency of the shared resources. Our goal with this project is to showcase the capabilities of the subnetwork by building the first cloud platform on top.\nJob Description:\nAs a Senior Cloud Platform Engineer, you will be instrumental in both the design and development of our cloud platform, focusing particularly on integrating GPU and CPU resources from the Bittensor subnet. This role requires a unique blend of skills in cloud computing, decentralized networks, and blockchain technologies. Your expertise will be pivotal in building a cloud infrastructure that utilizes external GPU and CPU resources for enhanced computational power, ensuring high availability, performance, and security.\nKey Responsibilities:\n- Design and implement scalable cloud infrastructure solutions, incorporating GPU and CPU resources from Bittensor miners on the platform.\n- Lead the development of automation scripts and frameworks to efficiently deploy and manage cloud resources.\n- Develop and optimize allocation and performance management mechanisms for integrated GPU and CPU resources on the application.\n- Ensure secure and reliable data transfer between our cloud platform and the Bittensor subnet using advanced cryptographic protocols.\n- Conduct comprehensive analyses of cloud architecture to identify and resolve performance bottlenecks, particularly focusing on the integration points with decentralized resources.\n- Collaborate with cross-functional teams to integrate cloud services with blockchain technologies and existing systems.\n- Maintain and monitor cloud environments, implementing robust security measures in compliance with industry standards.\n- Engage in performance benchmarking and implement optimization strategies for resource utilization.\n- Provide technical leadership and mentorship, staying abreast of emerging cloud and decentralized computing technologies to drive continuous innovation.\nQualifications:\n- Bachelor&rsquo;s or Master&rsquo;s degree in Computer Science, Engineering, or related field, with a minimum of 7 years in cloud platform development.\n- Strong experience in integrating decentralized or blockchain-based resources, particularly GPU and CPU architectures as well as Proof of work consensus mechanisms.\n- Knowledge of Validation and reward mechanisms related to network protocols. \n- Proficient in cloud computing technologies and best practices (AWS, Azure, Google Cloud Platform) with a focus on decentralized integration.\n- Expertise in infrastructure as code (IaC) tools (Terraform, Ansible, CloudFormation) and containerization technologies (Docker, Kubernetes).\n- Skilled in scripting and automation (Python, Bash, PowerShell) with experience in cryptographic techniques.\n- Deep understanding of network and security protocols, CI/CD pipelines (Jenkins, GitLab CI/CD), and monitoring tools (Prometheus, Grafana, ELK Stack).\n- Exceptional problem-solving skills and the ability to work effectively in a fast-paced, innovative environment.\n- Excellent communication and collaboration skills with a track record of technical leadership and mentorship.\nCompute repository :\nhttps://github.com/neuralinternet/compute-subnet<b>Skills</b>:        Kubernetes,                     Docker,                     Jenkins,                     Web Application,                     Cloud Computing,                     GPU,                     Google Cloud Platform,                     Amazon Web Services,                     Database Architecture            ","link":"https://www.upwork.com/jobs/Cloud-Platform_%7E0179e19059b4a8608c?source=rss","processedDate":"2024-03-19T08:46:26.394Z","postedDate":"<b>Posted On</b>: January 18, 2024 17:43 UTC","id":"0179e19059b4a8608c"},{"skillset":["Node.js","Java","JavaScript","Spring Framework","AngularJS","React"],"title":"Java Full Stack Developer - Upwork","description":"Relevant Experience\t\t3.5 - 6 years\t\t\t\t\t\nEducation Qualification\t\tBE/B.Tech/MCA/M.Tech/MSc.\t\t\t\t\nSkills &amp;amp; Abilities:\n1. Language: Java, J2EE, springboot, angular, react, node, (CSS: Tailwind CSS + angular Material) etc.\n2. OS: Linux, windows\n3. Database: Oracle, postgres, PL/SQL\n4. Able to write test cases&nbsp;&nbsp;and execute test plans\n5. Able to mentor and guide juniors\n6. Able to resolve customer queries independently \t\t\t\t\t\t\t\t\t\t\t\t\t\n7. Desirable: API integration, CI/CD, automation, working experience in the mobile financial domain\n8. Added advantage (Good to have): application security, RabbitMQ, Apache Kafka, Grafana, Prometheus, MongoDB, shell scripting basics\nJob Purpose: At the Mobiquity project engineering team, our core job is to customize, install, configure and support the customer during the entire project lifecycle.\nPrincipal Accountabilities\t\tDevelopment\t\t\t\t\t\t\t\t\t\t\t\n\t\t1. Write code in Java and java based technologies as well as web GUI development using latest technologies like, angular, react, conforming to company guidelines against written requirements &amp;amp; high-level design documents, particularly for complex modules that cannot be handled by junior developers. Work in an IDE while developing code ( especially in Java) and use GIT, SVN or any other CM tool being used in the company, for checking in and checking out the code being developed.\t\t\t\t\t\t\t\t\t\t\t\n\t\t2. Submit developed code for review, incorporate required changes and conduct Unit testing, after preparing Unit Test Plans and necessary stubs.\t\t\t\t\t\t\t\t\t\t\t\n\t\t3. Review code offered by others and document response in assigned format.\t\t\t\t\t\t\t\t\t\t\t\n\t\t4. Participate in (a) the integration of the developed code with code developed by other team members (this could happen on customer premises if appropriate environment is not available in-house) (b) preparation of the environment for integration testing (c) execution of integration testing (d) fixing the problems relating to the offered code as discovered in the integration testing.\t\t\t\t\t\t\t\t\t\t\t\n\t\t5. Participate in load testing conducted on the final product and fix problems encountered.\t\t\t\t\t\t\t\t\t\t\t\n\t\t6. Assist Product Validation Group in setting up the test environment, writing test cases, generating stubs and executing tests.\t\t\t\t\t\t\t\t\t\t\t\n\t\t7. Review test cases written by the Product Validation Group.\t\t\t\t\t\t\t\t\t\t\t\n\t\t8. Install product in customer location, train the customer reps on product features and operation &amp;amp; maintenance procedures, and complete user acceptance testing, making any changes in the final deliverable as required.\t\t\t\t\t\t\t\t\t\t\t\n\t\t9. Handle customer queries and complaints received directly or through the company support organization.\t\t\t\t\t\t\t\t\t\t\t\n\t\t10. Change code to fix reported customer problems after trouble shooting, get the fix reviewed and complete selective regression testing.\t\t\t\t\t\t\t\t\t\t\t\n\t\t11. Draft user documentation for consolidation by the technical documentation team. This could include GUI, API, O&amp;amp;M and technical documentation relating to COTS. Review drafts prepared by junior developers.\t\t\t\t\t\t\t\t\t\t\t\n\t\t12. Help maintain design requirement documents as directed.\t\t\t\t\t\t\t\t\t\t\t\n\t\t13. Participate in the development, release, support &amp;amp; enhancement activity through multiple release cycles and multiple products\t\t\t\t\t\t\t\t\t\t\t\n\t\t14. Proactively seek feedback/reviews on self development, learning, developed code. Responsible for completing the assigned task in all aspects by proactively seeking reviews, updating status to supervisors. \t\t\t\t\t\t\t\t\t\t\t\n\t\t15. Ensure the task assigned is understood in all respects and communicate effectively and raise necessary alarms to reporting leads if anything is not understood or no progress is possible. \t\t\t\t\t\t\t\t\t\t\t\n\t\tCapability Building\t\t\t\t\t\t\t\t\t\t\t\n\t\t1. Assist junior developers in coding, testing and troubleshooting.\t\t\t\t\t\t\t\t\t\t\t\n\t\t2. Train and support a new member joining the team with little or no experience of the development environment, technology domain and the specific work underway. Focus on scope of work familiarization<b>Skills</b>:        Node.js,                     Java,                     JavaScript,                     Spring Framework,                     AngularJS,                     React            ","link":"https://www.upwork.com/jobs/Java-Full-Stack-Developer_%7E01364898971a8bc047?source=rss","processedDate":"2024-03-19T08:46:26.395Z","postedDate":"<b>Posted On</b>: September 12, 2022 13:08 UTC","id":"01364898971a8bc047"},{"skillset":["PostgreSQL","AWS Application"],"title":"Database Migration &amp; Suggestion - Upwork","description":"Hi there,\nI have a database in RDS PostgreSQL.\nI&#039;m looking for it to be migrated to an appropriate Database for an IOT timestamp database or whatever you (as an expert) recommend. From what I see online, possibly InfluxDB sounds like the best type. \nI appreciate your feedback and I&#039;m looking forward to working with you. <b>Skills</b>:        PostgreSQL,                     AWS Application            ","link":"https://www.upwork.com/jobs/Database-Migration-amp-Suggestion_%7E012c799d515fa89d52?source=rss","processedDate":"2024-03-19T08:46:37.490Z","postedDate":"<b>Posted On</b>: March 06, 2024 13:05 UTC","id":"012c799d515fa89d52"},{"skillset":["Embedded System","AWS IoT Core","Amazon Web Services","Python"],"title":"aws | Iot | Embedded Expert with experience in Automotive  - Upwork","description":" Experience in designing and implementing applications for native &amp;amp; cloud platforms like AWS, Azure &amp;amp; \nGoogle Cloud and VM Orchestration frameworks like Kubernetes.&nbsp;&nbsp;\n Knowledge of software design concepts in Cloud based backend development &amp;amp; Data management with \nOOPS, Event driven, Microservices, SOA, MVVM, DevOps, and more. \n Solid know-how of IOT technology stack and backend/ Cloud application development. \n Proficient in one or more of programming languages Python, JAVA, C#, NodeJS or C++. \n Experience with NoSQL &amp;amp; SQL databases like MongoDB, InfluxDB, SQL, Postgres etc. \n Hands-on knowledge of communication protocols:&nbsp;&nbsp;\no Ethernet (TCP/UDP), MQTT, SOME/IP, HTTP + RESTful, DDS, and so on. \n Know-how of Automotive Domain with experience in development of either of Telematics, OTA/FOTA, \nFleet Management and Vehicle Analytics Features. <b>Skills</b>:        Embedded System,                     AWS IoT Core,                     Amazon Web Services,                     Python            ","link":"https://www.upwork.com/jobs/aws-Iot-Embedded-Expert-with-experience-Automotive_%7E01981301dab2ed2b06?source=rss","processedDate":"2024-03-19T08:46:37.490Z","postedDate":"<b>Posted On</b>: February 29, 2024 07:42 UTC","id":"01981301dab2ed2b06"},{"skillset":["System Administration","Linux System Administration","NoSQL Database"],"title":"InfluxDB Administrator Expert - Upwork","description":"Hi, I want to start by saying that I will only respond to people who answer the questions and give me answers that don&#039;t look prescripted or like chatGPT \nOur problem is simple, we are working on an influxDB database and have inserted data but the data is not showing up properly on our machine. \nQuestions:\nFavorite color (Be creative with it) \nYears experience with Influx?\nWhy I should hire you? <b>Skills</b>:        System Administration,                     Linux System Administration,                     NoSQL Database            ","link":"https://www.upwork.com/jobs/InfluxDB-Administrator-Expert_%7E01b847eebbde91eaa0?source=rss","processedDate":"2024-03-19T08:46:37.490Z","postedDate":"<b>Posted On</b>: February 22, 2024 19:44 UTC","id":"01b847eebbde91eaa0"},{"skillset":["HTML","CSS","HTML5","Web Application","Git","JavaScript","Landing Page","API","PHP"],"title":"Front-End Developer for Monitoring Platform - Upwork","description":"Freelance Front-End Developer for EMS Startup\nLocation: Amsterdam, Rotterdam/Remote\nJob Type: Contract (Project-Based)\nAbout Us:\nVEMS is a pioneering tech startup aiming to revolutionize the energy management sector with a software-based, multi-platform solution. We&#039;re seeking a Freelance Front-End Developer to realize our platform&#039;s user interface, focusing on energy efficiency and savings monitoring.\nProject Scope:\nDevelop a user-friendly front-end for real-time monitoring and control over energy assets.\nCollaborate with our design and back-end teams to ensure a seamless user experience.\nProject duration: 3-6 months, with potential for ongoing projects.\nSkills Needed:\nExpertise in HTML5, CSS3, and JavaScript frameworks (React, Angular, Vue.js).\nExperience with responsive design and cross-browser compatibility.\nFamiliarity with Git and modern front-end build pipelines.\nWhy VEMS?\nCompetitive project-based compensation.\nFlexible working hours, fully remote.\nOpportunity to contribute to a sustainable future and potential for long-term collaboration.\nHow to Apply:\nSend your resume and a portfolio showcasing relevant projects. Please include your availability and project rates.\nVEMS is committed to diversity and inclusion. We welcome applications from all qualified individuals.<b>Skills</b>:        HTML,                     CSS,                     HTML5,                     Web Application,                     Git,                     JavaScript,                     Landing Page,                     API,                     PHP            ","link":"https://www.upwork.com/jobs/Front-End-Developer-for-Monitoring-Platform_%7E01b0c68d2111ea98b3?source=rss","processedDate":"2024-03-19T08:46:37.490Z","postedDate":"<b>Posted On</b>: February 22, 2024 09:09 UTC","id":"01b0c68d2111ea98b3"},{"skillset":["Android","Smartphone","iOS","Mobile App Development","React Native","Android App Development","User Profile Creation","User Authentication","iOS Development"],"title":"App Developer needed for React Native App on IOS/Android - Upwork","description":"We are in search of a highly skilled and experienced freelancer to manage all aspects of our existing mobile application. The application is fully functional with an active user base, but it requires ongoing updates, enhancements, bug fixes, and feature additions to ensure optimal performance and user experience.\nKey responsibilities include:\nHosting management\nCoding and development\nGraphic design (optional, but a plus)\nImplementing UI/UX principles for optimal user experience\nThorough testing and quality assurance procedures\nTroubleshooting technical issues efficiently\nProficiency with the following tools and technologies is required:\nReact Native\nRuby on Rails\nPostgreSQL\nSidekiq\nRpush\nFirebase\nNewRelic\nAWS<b>Skills</b>:        Android,                     Smartphone,                     iOS,                     Mobile App Development,                     React Native,                     Android App Development,                     User Profile Creation,                     User Authentication,                     iOS Development            ","link":"https://www.upwork.com/jobs/App-Developer-needed-for-React-Native-App-IOS-Android_%7E01648110a34aa76762?source=rss","processedDate":"2024-03-19T08:46:54.433Z","postedDate":"<b>Posted On</b>: March 08, 2024 08:59 UTC","id":"01648110a34aa76762"},{"skillset":["Android","Smartphone","iOS","Mobile App Development","React Native","Android App Development","User Profile Creation","User Authentication","iOS Development"],"title":"App Developer needed for React Native App on IOS/Android - Upwork","description":"We are in search of a highly skilled and experienced freelancer to manage all aspects of our existing mobile application. The application is fully functional with an active user base, but it requires ongoing updates, enhancements, bug fixes, and feature additions to ensure optimal performance and user experience.\nKey responsibilities include:\nHosting management\nCoding and development\nGraphic design (optional, but a plus)\nImplementing UI/UX principles for optimal user experience\nThorough testing and quality assurance procedures\nTroubleshooting technical issues efficiently\nProficiency with the following tools and technologies is required:\nReact Native\nRuby on Rails\nPostgreSQL\nSidekiq\nRpush\nFirebase\nNewRelic\nAWS<b>Skills</b>:        Android,                     Smartphone,                     iOS,                     Mobile App Development,                     React Native,                     Android App Development,                     User Profile Creation,                     User Authentication,                     iOS Development            ","link":"https://www.upwork.com/jobs/App-Developer-needed-for-React-Native-App-IOS-Android_%7E011e6d49b7ef6c648e?source=rss","processedDate":"2024-03-19T08:46:54.433Z","postedDate":"<b>Posted On</b>: March 08, 2024 05:07 UTC","id":"011e6d49b7ef6c648e"},{"skillset":["In-App Purchases","Review or Feedback Collection","In-App Advertising","Push Notifications","Android","iOS","Mobile App Development","React Native"],"title":"App Developer needed for React Native App on IOS/Android - Upwork","description":"We are in search of a highly skilled and experienced freelancer to manage all aspects of our existing mobile application. The application is fully functional with an active user base, but it requires ongoing updates, enhancements, bug fixes, and feature additions to ensure optimal performance and user experience.\nKey responsibilities include:\nHosting management\nCoding and development\nGraphic design (optional, but a plus)\nImplementing UI/UX principles for optimal user experience\nThorough testing and quality assurance procedures\nTroubleshooting technical issues efficiently\nProficiency with the following tools and technologies is required:\nReact Native\nRuby on Rails\nPostgreSQL\nSidekiq\nRpush\nFirebase\nNewRelic\nAWS\nExperience with graphic design is advantageous, but we are open to hiring a separate individual for this aspect. Alternatively, if you have a team capable of handling all aspects of the app, including hosting, coding, development, and graphics, that could be considered.\nThe application has already been published and boasts an active user base, so familiarity with the current code base is essential. App documentation will be provided to aid in this process, and our current development team is available to offer assistance. However, our intention is to transition entirely from the previous development team.\nIn addition to technical proficiency, we encourage the use of AI tools such as GitHub Copilot to assist in coding tasks, enhancing efficiency and enabling adaptability to new technologies. \nFluency in English and excellent communication skills are crucial. As I lack a technical background, clear explanations regarding the rationale and methodology behind tasks are expected.\nIf you are confident in your ability to take on all responsibilities or can clearly outline any additional hires needed to ensure the project&#039;s success, we encourage you to apply.\nFor any further details or inquiries, please do not hesitate to reach out.<b>Skills</b>:        In-App Purchases,                     Review or Feedback Collection,                     In-App Advertising,                     Push Notifications,                     Android,                     iOS,                     Mobile App Development,                     React Native            ","link":"https://www.upwork.com/jobs/App-Developer-needed-for-React-Native-App-IOS-Android_%7E0192ed41272d222e7b?source=rss","processedDate":"2024-03-19T08:46:54.434Z","postedDate":"<b>Posted On</b>: March 06, 2024 18:37 UTC","id":"0192ed41272d222e7b"},{"skillset":["Theme Customization","Shopify","Shopify Templates","Shopify Theme","Ecommerce Website Development","Shopify Apps"],"title":"Looking for a Shopify Expert - Upwork","description":"We&#039;re currently running a Shopify site for Beauty and Wellness products.\nWe&rsquo;ve suspected poor site performance (slow page loads, errors, and unnecessary &amp;amp; abundant requests).\nWe&rsquo;d like to begin with an analysis of core performance problems and RCA, and then quickly prioritize &amp;amp; execute the fixes based on the largest business impact, and go on from there.\nWe&rsquo;ve recently implemented New Relic and would be happy to provide access for the site performance quality analysis. \nWe are on the Shopify Plus platform with multiple custom react modules.\nWe&rsquo;d ask that all development be functionally and load-tested.\nIf you do this project well, there is another opportunity for other projects.<b>Skills</b>:        Theme Customization,                     Shopify,                     Shopify Templates,                     Shopify Theme,                     Ecommerce Website Development,                     Shopify Apps            ","link":"https://www.upwork.com/jobs/Looking-for-Shopify-Expert_%7E01598aa197612cc5f1?source=rss","processedDate":"2024-03-19T08:46:54.434Z","postedDate":"<b>Posted On</b>: March 06, 2024 07:32 UTC","id":"01598aa197612cc5f1"},{"skillset":["Amazon Web Services","New Relic","Mail Server Implementation","Linux System Administration","MySQL","DevOps","Postfix SMTP Server","Amazon EC2","HTML5","Virtual Private Server","PHP"],"title":"Hello, i need to setup postfix  - Upwork","description":"Hello, i need to setup postfix to send and receive mail. Properly setting up hostname, related to my MX IP.<b>Skills</b>:        Amazon Web Services,                     New Relic,                     Mail Server Implementation,                     Linux System Administration,                     MySQL,                     DevOps,                     Postfix SMTP Server,                     Amazon EC2,                     HTML5,                     Virtual Private Server,                     PHP            ","link":"https://www.upwork.com/jobs/Hello-need-setup-postfix_%7E01f2fda050f75dd32a?source=rss","processedDate":"2024-03-19T08:46:54.435Z","postedDate":"<b>Posted On</b>: March 02, 2024 11:16 UTC","id":"01f2fda050f75dd32a"},{"skillset":["New Relic"],"title":"Especialista New Relic - Capacitación - Upwork","description":"Descripci&oacute;n del Puesto\nEstamos en b&uacute;squeda de un capacitador especializado en New Relic para unirse a nuestro equipo. El candidato ideal ser&aacute; un experto en la implementaci&oacute;n y el soporte de esta plataforma, capaz de proporcionar formaci&oacute;n integral durante 8 horas.\nResponsabilidades:\n&bull;\tCapacitaci&oacute;n Integral: Dise&ntilde;ar y ofrecer programas de capacitaci&oacute;n que abarquen desde la implementaci&oacute;n hasta el soporte continuo de New Relic.\n&bull;\tExperiencia Pr&aacute;ctica: Proporcionar ejercicios pr&aacute;cticos y estudios de caso para garantizar la comprensi&oacute;n y aplicaci&oacute;n efectiva de los conceptos de New Relic.\n&bull;\tSoporte T&eacute;cnico: Brindar asistencia t&eacute;cnica y resolver consultas relacionadas con la implementaci&oacute;n y uso de New Relic.\nRequisitos:\n&bull;\tExperiencia comprobada en la implementaci&oacute;n exitosa de New Relic en entornos empresariales.\n&bull;\tConocimiento profundo de las funcionalidades y capacidades de New Relic, desde la configuraci&oacute;n hasta el monitoreo avanzado.\n&bull;\tHabilidades excepcionales de comunicaci&oacute;n y presentaci&oacute;n.\n&bull;\tCapacidad para ofrecer formaci&oacute;n virtual de manera efectiva.<b>Skills</b>:        New Relic            ","link":"https://www.upwork.com/jobs/Especialista-New-Relic-Capacitaci_%7E014500639d76f3ef6e?source=rss","processedDate":"2024-03-19T08:46:54.435Z","postedDate":"<b>Posted On</b>: March 01, 2024 15:54 UTC","id":"014500639d76f3ef6e"},{"skillset":["JavaScript","Node.js"],"title":"Remote Magento Node Typescript with PHP - Upwork","description":"Magento with Typescript and Nodejs\nPosition Summary: The Senior Software Engineer will build high-quality RESTful microservice APIs, while collaborating with team members, and across teams to apply engineering best practices from requirements through design, development, and deployment, ensuring scalable, extensible, secure, and easily supportable customer focused products.\nEssential Duties and Responsibilities: \n&bull;\tBuild high-quality RESTful microservice APIs\n&bull;\tWorks directly on complex application/technical problem identification and resolution\n&bull;\tCollaborate with experienced software developers in the design, development, and deployment of code and maintain solutions\n&bull;\tMaintains high standards of software quality within the team by establishing good practices and habits\nEducation, Experience and Technical Skills:\n&bull;\t4+ years Magento Developer\n&bull;\t5+ years building, deploying, and supporting enterprise RESTful service APIs\n&bull;\tUnderstanding of event-driven programming design patterns and practices\n&bull;\tUnderstanding of functional programming design patterns and practices\n&bull;\tUnderstanding of OOP design patterns and practices\n&bull;\tUnderstanding of software development best practices, e.g., YAGNI, etc. \n&bull;\tUnderstanding of microservices architecture\n&bull;\tUnderstanding of HTTP protocol principles, e.g., headers, status code, etc. \n&bull;\tUnderstanding of application security best practices\n&bull;\tUnderstanding of structured logging techniques\n&bull;\tWith MongoDB and MySQL\n&bull;\tWith TypeScript\n&bull;\tDeveloping CRUD/RESTful service APIs\n&bull;\tUsing Node.js frameworks, e.g., Loopback, HAPI, Express, Koa, etc. \n&bull;\tDeploying high-traffic enterprise applications using Node.js and MongoDB\n&bull;\tUsing Docker, and/or other containerization technologies\n&bull;\tDeploying and managing applications on the Kubernetes platform\n&bull;\tWorking with CI/CD pipelines, such as Jenkins\n&bull;\tWriting unit tests, and integration test suites\n&bull;\tWith git workflow fundamentals, i.e., merge, rebase, reset, cherry-pick, etc. \n&bull;\tWorking in Agile Development Methodologies, e.g., Scum\n&bull;\tUsing APMs, and analytics tools, such as New Relic, Google Analytics, etc. \n&bull;\tBachelor&rsquo;s Degree in computer science preferred\n&bull;\tExperience in eCommerce and/or FinTech preferred\nCore Competencies for Success:\nTo perform this job successfully, an individual should demonstrate the following competencies:\n&bull;\tExperience designing well-defined Restful APIs\n&bull;\tStrong understanding of data structures and algorithms\n&bull;\tExperience with design and implementation of high-availability and reliable solutions<b>Skills</b>:        JavaScript,                     Node.js            ","link":"https://www.upwork.com/jobs/Remote-Magento-Node-Typescript-with-PHP_%7E017f5eee302bbc2d1d?source=rss","processedDate":"2024-03-19T08:46:54.435Z","postedDate":"<b>Posted On</b>: February 28, 2024 18:55 UTC","id":"017f5eee302bbc2d1d"},{"skillset":["Node.js","JavaScript","React","ExpressJS","API","TypeScript","API Development","API Integration","MongoDB"],"title":"Remote - Work from Home React.js Developer with Typescript Express.js Script Node.js MERN Developer - Upwork","description":"Remote Heavy React with Typescript and Nodejs MERN Stack Developer&nbsp;&nbsp;-&nbsp;&nbsp;Senior Software Engineer&nbsp;&nbsp;\nHeavy Reactjs Development\nHeavy Nodejs Development\nHeavy Typescript Development\nHeavy MongoDB exp\nPosition Summary: The Senior Software Engineer will build high-quality RESTful microservice APIs, while collaborating with team members, and across teams to apply engineering best practices from requirements through design, development, and deployment, ensuring scalable, extensible, secure, and easily supportable customer focused products.\nEssential Duties and Responsibilities: \n&bull;\tBuild high-quality RESTful microservice APIs\n&bull;\tWorks directly on complex application/technical problem identification and resolution\n&bull;\tCollaborate with experienced software developers in the design, development, and deployment of code and maintain solutions\n&bull;\tMaintains high standards of software quality within the team by establishing good practices and habits\nEducation, Experience and Technical Skills:\n&bull;\t4+ years MERN Developer\n&bull;\t5+ years building, deploying, and supporting enterprise RESTful service APIs\n&bull;\tUnderstanding of event-driven programming design patterns and practices\n&bull;\tUnderstanding of functional programming design patterns and practices\n&bull;\tUnderstanding of OOP design patterns and practices\n&bull;\tUnderstanding of software development best practices, e.g., YAGNI, etc. \n&bull;\tUnderstanding of microservices architecture\n&bull;\tUnderstanding of HTTP protocol principles, e.g., headers, status code, etc. \n&bull;\tUnderstanding of application security best practices\n&bull;\tUnderstanding of structured logging techniques\n&bull;\tWith MongoDB and MySQL\n&bull;\tWith TypeScript\n&bull;\tDeveloping CRUD/RESTful service APIs\n&bull;\tUsing Node.js frameworks, e.g., Loopback, HAPI, Express, Koa, etc. \n&bull;\tDeploying high-traffic enterprise applications using Node.js and MongoDB\n&bull;\tUsing Docker, and/or other containerization technologies\n&bull;\tDeploying and managing applications on the Kubernetes platform\n&bull;\tWorking with CI/CD pipelines, such as Jenkins\n&bull;\tWriting unit tests, and integration test suites\n&bull;\tWith git workflow fundamentals, i.e., merge, rebase, reset, cherry-pick, etc. \n&bull;\tWorking in Agile Development Methodologies, e.g., Scum\n&bull;\tUsing APMs, and analytics tools, such as New Relic, Google Analytics, etc. \n&bull;\tBachelor&rsquo;s Degree in computer science preferred\n&bull;\tExperience in eCommerce and/or FinTech preferred<b>Skills</b>:        Node.js,                     JavaScript,                     React,                     ExpressJS,                     API,                     TypeScript,                     API Development,                     API Integration,                     MongoDB            ","link":"https://www.upwork.com/jobs/Remote-Work-from-Home-React-Developer-with-Typescript-Express-Script-Node-MERN-Developer_%7E0182454f86d68dff57?source=rss","processedDate":"2024-03-19T08:46:54.435Z","postedDate":"<b>Posted On</b>: February 20, 2024 22:41 UTC","id":"0182454f86d68dff57"},{"skillset":["WordPress","PHP","JavaScript","Troubleshooting","New Relic","Web Development","DNS","WooCommerce","CSS","WordPress Plugin"],"title":"Web Developer / Word Press / woocomerce specialist for ongoing projects - Upwork","description":"\nWe are looking for a web developer to help us with site modifications and improvements on a monthly basis. This person must be very knowledgeable of wordpress, elementor, woocommerce and of managing an ecommerce site. The ideal person with be able to develop in PHP as well as front end languages such as HTML, Javascript and CSS.&nbsp;&nbsp;Excellent communication is a must. This individual will clearly communicate when they will be available and when they will not. They will also explain all planned modifications. We also expect this person to make recommendations about ways we can improve the site without us asking. We DO NOT expect the person we hire to know everything but we expect honesty about what they can and can&#039;t do. Being resourceful at finding solutions is a must.\nSome of the tasks that must be accomplished are:\nTrouble shoot frequent admin-adjax.php calls \nTrouble shoot cron jobs causing server CPU is max out\n!!! Advise how to best manage push and pull updates to the production environment from staging. Use plugin to export customer data from production to staging and merge data. \nConfigure monitoring and reporting tools such as NewRelic\nResearch and suggest the best plugins to solve new website needs\nHelp implement SEO strategies\nCreate new templates for categories, tags, and brand pages\nKnowledge of Google analytics and tag Manager a plus but not necessary\nWe are a new business but are growing and we would like to find someone who is dedicated to helping us succeed. As we grow and become profitable we will happily scale salaries to share in our success. \nWe would like to start with just a few tasks to see how well we work together. Thank you for your time! <b>Skills</b>:        WordPress,                     PHP,                     JavaScript,                     Troubleshooting,                     New Relic,                     Web Development,                     DNS,                     WooCommerce,                     CSS,                     WordPress Plugin            ","link":"https://www.upwork.com/jobs/Web-Developer-Word-Press-woocomerce-specialist-for-ongoing-projects_%7E0132facd8f2623b015?source=rss","processedDate":"2024-03-19T08:46:54.435Z","postedDate":"<b>Posted On</b>: January 29, 2024 20:24 UTC","id":"0132facd8f2623b015"},{"skillset":["Linux","Ubuntu","Tech &amp; IT","Business with 1-9 Employees","Prometheus","Network Engineering","Docker","DevOps","React","C#"],"title":"Prometheus deployment assistance &amp; integration /w CANapps SAAS - Upwork","description":"Prometheus experience is mandatory.&nbsp;&nbsp;&nbsp;Ongoing support &amp;amp; assistance with completing Prometheus. implementation, which supports a multi-tenant SAAS architecture.&nbsp;&nbsp;We have a Dev-Ops deployment pipeline /w dev, test &amp;amp; production environments.&nbsp;&nbsp;Currently production environment admin password changes are not taking affect &amp;amp; alert emails are not being delivered.&nbsp;&nbsp;There are many checks to be defined, tested &amp;amp; implemented.&nbsp;&nbsp;&nbsp;Additionally, integration with CANapps SAAS is required.&nbsp;&nbsp;CANapps are a family of business apps developed by Stream Data &amp;amp; delivered as SAAS.<b>Skills</b>:        Linux,                     Ubuntu,                     Tech &amp; IT,                     Business with 1-9 Employees,                     Prometheus,                     Network Engineering,                     Docker,                     DevOps,                     React,                     C#            ","link":"https://www.upwork.com/jobs/Prometheus-deployment-assistance-amp-integration-CANapps-SAAS_%7E0114cda66f5129a841?source=rss","processedDate":"2024-03-19T08:47:00.181Z","postedDate":"<b>Posted On</b>: February 29, 2024 17:09 UTC","id":"0114cda66f5129a841"},{"skillset":["DevOps","Linux System Administration","Kubernetes"],"title":"Setup &amp; document setup of 3 CP + 6 WN (9 total nodes) Kubernetes Cluster with specified capabilities - Upwork","description":"Reading Time\nLESS than 3 mins (439 words @150wpm)\n+++ What is our goal?\nON PREM Kubernetes: Deploy our current Docker-based containerized HA application infra using Kubernetes\n+++ Why do we want to move to Kubernetes?\nWe&rsquo;ll continue with our current setup if we don&#039;t find a good path to deploy Kubernetes. We don&rsquo;t care about performance optimization and resource stranding at the moment. The primary reason we&rsquo;d move to an orchestrated environment is specifically:\n+ Automate deployment, updates\n+ Simplify High Availability mgmt (incl auto pod rescheduling, node failover, and self-healing)\n+ Simplify ongoing service addition, discovery &amp;amp; network mgmt\n+++ What are our specs?\nThe following are highlights (detailed spec to follow)\n+ All open source free to use components\n+ Set up on Prem (9 TOTAL nodes, 3 control plane nodes)\n+ Our container images include MongoDB, RabbitMQ,, Prometheus &amp;amp; Alert Manager\n+++ Any other requirements/notes?\n+ Need to choose a service mesh, tracing, CI/CD (we favor ArgoCD)\n+ Need experience who has experience integrating Prometheus &amp;amp; Alert Manager into our code\n+ Need someone who has experience with Keycloak &amp;amp; Hashicorp vault setup and operation (production-grade)\n+++ What hardware do we run on/plan to use?\n+ Linux machines using Ubuntu 22.04LTS/23.04LTS (each is 4 core machines each with 8GB of memory, each with a minimum of 100GB of disk space).\n+++ What are the deliverables?\n+ Setup cluster \n+ Setup service infra (in the proper sequence) \n+ Setup offsite backup\n+ Document file system backup &amp;amp; disaster recovery\n+ Test (and document testing) various components and document test procedures:&nbsp;&nbsp;Perform intentional degradation &amp;amp; recover \nNote: We may augment this list\n+++ What do we provide?\n+ sudo-level account access on all 9 nodes\n+++ Note: re: our Alternative\nWe&rsquo;ll continue with our current setup if we don&#039;t find a good path to deploy Kubernetes. The primary reason we&rsquo;d move to an orchestrated environment is specifically:\n+ Automate deployment, updates\n+ Simplify High Availability mgmt (incl auto pod rescheduling, node failover, and self-healing)\n+ Simplify ongoing service addition, discovery &amp;amp; network mgmt\n+++ Documenting the entire process for DISASTER RECOVERY\nOne deliverable will be a documented setup &amp;amp; recovery process along with a live walk through of the documentation (explanation + copy/paste commands). The goal will be to setup the cluster from scratch in during disaster recovery (in case you&#039;re not around when we need help). Note: We have specific SLA/SLO spec.\n+++ How proficient in ENGLISH should you be?\nMust be really easy to understand. \nIt&#039;s ok if you&#039;re NOT fluent in English\nWe do need to understand you well &amp;amp; quickly.\n+++ How to Apply\nRespond to the questions first. We&#039;ll send you a link to schedule a 30min discussion to answer your Qs and elaborate on you capabilities as a match for our specs/needs.<b>Skills</b>:        DevOps,                     Linux System Administration,                     Kubernetes            ","link":"https://www.upwork.com/jobs/Setup-amp-document-setup-total-nodes-Kubernetes-Cluster-with-specified-capabilities_%7E01896843424e75aedf?source=rss","processedDate":"2024-03-19T08:47:00.182Z","postedDate":"<b>Posted On</b>: February 24, 2024 00:13 UTC","id":"01896843424e75aedf"},{"skillset":["AI Chatbot","Chatbot Integration","Artificial Intelligence","Python","Chatbot Development","Natural Language Processing","API","Prototyping","Web Application","Web Development"],"title":"Build AI Web Application MVP - Upwork","description":"Hello! The full job description can be found on this Notion site. \nhttps://tame-sing-275.notion.site/Prometheus-Proof-of-Concept-e89c99a24c104c938b4e906382e2454e?pvs=74\nPlease ensure to read it in-depth as we will only accept candidates who have clearly read the scope. <b>Skills</b>:        AI Chatbot,                     Chatbot Integration,                     Artificial Intelligence,                     Python,                     Chatbot Development,                     Natural Language Processing,                     API,                     Prototyping,                     Web Application,                     Web Development            ","link":"https://www.upwork.com/jobs/Build-Web-Application-MVP_%7E019276eaf58d925eb2?source=rss","processedDate":"2024-03-19T08:47:00.182Z","postedDate":"<b>Posted On</b>: February 22, 2024 05:10 UTC","id":"019276eaf58d925eb2"},{"skillset":["Google Cloud Platform","Jenkins","Information Security","Terraform","System Automation","Python Script","Kubernetes","Prometheus","CI/CD","Ansible","DevOps","Amazon Web Services","Web Server","ELK Stack"],"title":"Linux Engineer - Upwork","description":"Proven experience as a Linux Engineer or similar role.\nStrong knowledge of Linux server administration and troubleshooting.\nProficiency in Ansible for configuration management.\nExperience with GitLab for source code version control.\nScripting skills in Python and Bash.\nNetwork administration experience, including knowledge of TCP/IP, DNS, and VPN.\nFamiliarity with Terraform for infrastructure as code (IAC).\nStrong problem-solving and analytical skills.\nExcellent communication and teamwork abilities.\nRelevant certifications (e.g., RHCE, Linux+, CCNA) are a plus.<b>Skills</b>:        Google Cloud Platform,                     Jenkins,                     Information Security,                     Terraform,                     System Automation,                     Python Script,                     Kubernetes,                     Prometheus,                     CI/CD,                     Ansible,                     DevOps,                     Amazon Web Services,                     Web Server,                     ELK Stack            ","link":"https://www.upwork.com/jobs/Linux-Engineer_%7E014df5556b3d1b3c70?source=rss","processedDate":"2024-03-19T08:47:00.182Z","postedDate":"<b>Posted On</b>: February 21, 2024 16:20 UTC","id":"014df5556b3d1b3c70"},{"skillset":["DevOps","SaaS","System Monitoring","Prometheus","Incident Management","Incident Response Plan","Technical Writing"],"title":"SRE with management experience to write an educational article for peers - Upwork","description":"We create advanced and free educational content for venture-backed technology startups in the public cloud and IT infrastructure space. The readers of our content are administrators, engineers, and technical managers.\nWe collaborate with subject matter experts like you, willing to share their knowledge with less experienced peers to lend a genuine and practical voice to our educational articles.\nOur team includes professional editors and graphic designers who improve the article&#039;s language and visual content before publication. As such, we are interested in your knowledge, ideas, and technical expertise more than your perfect English writing or drawing skills.\nThese guides are examples of the type of content we create:\nhttps://www.kubecost.com/kubernetes-devops-tools\nhttps://www.squadcast.com/sre-best-practices\nIn this job posting, we seek a SaaS site reliability expert with management experience to help us write an article of 1500-2000 words on technical topics related to DevOps best practices. Examples of such topics are:\n- Building a DevOps team\n- DevOps project management\n- DevOps team structure\n- DevOps engineer skills\n- DevOps process flow\nWe require candidates to have hands-on experience implementing incident management systems and procedures in modern DevOps and Site Reliability Engineering settings, as well as DevOps team management experience.\nWe are happy to engage you to write a single article; however, we would prefer to collaborate with you on additional articles in the coming months at the rate of one or two articles per month.\nNote that all of our educational articles are published anonymously on the websites of our clients and are not attributed to any authors.\nWe require all writing to be original and done by the author without the use of AI, such as ChatGPT, except for basic grammar checking.<b>Skills</b>:        DevOps,                     SaaS,                     System Monitoring,                     Prometheus,                     Incident Management,                     Incident Response Plan,                     Technical Writing            ","link":"https://www.upwork.com/jobs/SRE-with-management-experience-write-educational-article-for-peers_%7E0131ecd9fc20dcc3b7?source=rss","processedDate":"2024-03-19T08:47:00.182Z","postedDate":"<b>Posted On</b>: December 16, 2023 06:38 UTC","id":"0131ecd9fc20dcc3b7"},{"skillset":["Network Administration","Network Monitoring","IT Infrastructure"],"title":"Solarwinds specialist - Upwork","description":"Looking for someone to assist in Solarwinds implementations including look and feel customisation and reporting customisation in a NOC style environment.\nPotential for ongoing work across several projects<b>Skills</b>:        Network Administration,                     Network Monitoring,                     IT Infrastructure            ","link":"https://www.upwork.com/jobs/Solarwinds-specialist_%7E01174ba52287a3b236?source=rss","processedDate":"2024-03-19T08:47:16.861Z","postedDate":"<b>Posted On</b>: March 06, 2024 04:47 UTC","id":"01174ba52287a3b236"},{"skillset":["Network Administration","Network Equipment","System Administration"],"title":"Setup APC Smart-UPS Alerts on SolarWinds\nand RADIUS on UPS - Upwork","description":"Setup APC Smart-UPS Alerts on SolarWinds\nconfigure RADIUS in UPS<b>Skills</b>:        Network Administration,                     Network Equipment,                     System Administration            ","link":"https://www.upwork.com/jobs/Setup-APC-Smart-UPS-Alerts-SolarWinds-and-RADIUS-UPS_%7E015f6aca7a3bed66ba?source=rss","processedDate":"2024-03-19T08:47:16.861Z","postedDate":"<b>Posted On</b>: February 29, 2024 03:26 UTC","id":"015f6aca7a3bed66ba"},{"skillset":["SolarWinds VoIP &amp; Network Quality Manager","Network Administration"],"title":"Solarwinds Monitoring Networking  - Upwork","description":"Hello all, \nLooking for someone who is good at Networking and application monitoring.\nlooking for someone who got experience in monitoring. \nsite reliability engineering. <b>Skills</b>:        SolarWinds VoIP &amp; Network Quality Manager,                     Network Administration            ","link":"https://www.upwork.com/jobs/Solarwinds-Monitoring-Networking_%7E0192ab7f7ffaabdc3d?source=rss","processedDate":"2024-03-19T08:47:16.861Z","postedDate":"<b>Posted On</b>: February 27, 2024 02:07 UTC","id":"0192ab7f7ffaabdc3d"},{"skillset":["SNMP","Network Administration","Network Engineering","Network Security","Network Equipment","Virtual LAN","Gateway Ticketing Systems Galaxy"],"title":"Network Engineer - Upwork","description":"The candidate will be maintaining LAN and WAN connectivity for multiple remote locations across 25 geographically separated districts.\nThe candidate will be responsible for the ingest and triage of any tickets or requests from the helpdesk.\nThe candidate will be responsible for reviewing any alerts received and proper ticket creation to include urgency, priority, and other classification(s) that may be required.\nCandidate will be responsible for read-only level 1 troubleshooting and escalation either to tier 3 or companion teams depending on the symptoms of the event.\nThe candidate will be responsible for assisting the ensuring the validity of node data in the systems used (ISE, DNAC, SolarWinds Orion).\nResponsibilities \nFamiliarity/Experience with 3 or more of the following:\nCameras\nCircuit and WAN Management\nInterfacing with MPLS and LTE Vendors\nCisco ISE and DNAC\nEncoders/Decoders\nIoT Equipment\nNAT/PAT\nNetwork Management Tools: SolarWinds Orion, phpIPAM\nRouters: Cisco IR1101s, 809s\nRouting Protocols: BGP, OSPF\nSwitches: Cisco 9300, Advantech\nTACACS/RADIUS\nHelp troubleshoot and maintain network tools and topology maps.\nMaintain complete details of issues in the ticketing system.\nReceive phone calls directly from end-users.\nWork tickets escalated from Tier One service desk personnel and escalated to Tier Three as needed.\nConduct research, analysis, and correlation across a wide variety of all source data sets (indications and warnings).\nMeet SLA requirements for response, restore, and notification time with an emphasis on proper pending codes.\nMentor and train Tier other Service Desk personnel as needed.\nBe able to work shift work (Days, Swings, Mids).\nPreferred Experience and attributes\nWorking knowledge of ITIL principles.\nWorking experience with Enterprise level ticketing systems such as SNOW or Remedy\nUnderstanding of Syslog and SNMP monitoring\nNetwork and Security certifications (CCNA, Security +, and Network +) or equivalent knowledge.\nAbility to interpret the information collected by network tools (e.g. Nslookup, Ping, and Traceroute).\nKnowledge of computer networking concepts and protocols, and network security methodologies.\nKnowledge of host/network access control mechanisms (e.g., access control list, capabilities lists).<b>Skills</b>:        SNMP,                     Network Administration,                     Network Engineering,                     Network Security,                     Network Equipment,                     Virtual LAN,                     Gateway Ticketing Systems Galaxy            ","link":"https://www.upwork.com/jobs/Network-Engineer_%7E0176206727b2578e2d?source=rss","processedDate":"2024-03-19T08:47:16.861Z","postedDate":"<b>Posted On</b>: February 09, 2024 21:41 UTC","id":"0176206727b2578e2d"},{"skillset":["Information Security","Vulnerability Assessment","Network Security","Security Analysis","Internet Security","Certified Information Systems Security Professional","Network Administration"],"title":"Cybersecurity Expert specializing in SIEM Implementation - Upwork","description":"We&#039;re seeking a skilled Cybersecurity Expert to assist with the implementation of Security Information and Event Management (SIEM) systems. The ideal candidate will have extensive experience in cybersecurity practices and a deep understanding of SIEM technologies. Responsibilities include configuring and customizing SIEM solutions, integrating with existing security infrastructure, and providing guidance on best practices for threat detection and response. Strong analytical skills and the ability to troubleshoot and resolve complex security issues are essential. If you&#039;re passionate about cybersecurity and have a proven track record in SIEM implementation, we want to hear from you.\nRequirements:\n&nbsp;&nbsp;&nbsp;&nbsp;Proficiency in cybersecurity principles and practices\n&nbsp;&nbsp;&nbsp;&nbsp;Experience with SIEM platforms such as Splunk, ArcSight, or LogRhythm\n&nbsp;&nbsp;&nbsp;&nbsp;Ability to configure and customize SIEM solutions to meet specific organizational needs\n&nbsp;&nbsp;&nbsp;&nbsp;Strong analytical and problem-solving skills\n&nbsp;&nbsp;&nbsp;&nbsp;Excellent communication and teamwork abilities<b>Skills</b>:        Information Security,                     Vulnerability Assessment,                     Network Security,                     Security Analysis,                     Internet Security,                     Certified Information Systems Security Professional,                     Network Administration            ","link":"https://www.upwork.com/jobs/Cybersecurity-Expert-specializing-SIEM-Implementation_%7E0152df6cad00ebd48b?source=rss","processedDate":"2024-03-19T08:47:22.679Z","postedDate":"<b>Posted On</b>: March 17, 2024 22:04 UTC","id":"0152df6cad00ebd48b"},{"skillset":["Jira","Project Management","Splunk","Agile Project Management"],"title":"Looking for a Scrum Master who can help me manage my JIRA board (Running Splunk Project) - Upwork","description":"i m looking for a scrum master who can help me manage my jira board - looking to test out a person via part-time basis - to ensure all tasks gets delivered and jira board is maintained - we run 2weeks sprints.<b>Skills</b>:        Jira,                     Project Management,                     Splunk,                     Agile Project Management            ","link":"https://www.upwork.com/jobs/Looking-for-Scrum-Master-who-can-help-manage-JIRA-board-Running-Splunk-Project_%7E0141b15fd04187f9d0?source=rss","processedDate":"2024-03-19T08:47:22.679Z","postedDate":"<b>Posted On</b>: March 08, 2024 04:53 UTC","id":"0141b15fd04187f9d0"},{"skillset":["Cloud Engineering","Cloud Implementation","Amazon Web Services","DevOps","Deployment Automation","Amazon RDS"],"title":"set up alert thresholds for MaximumUsedTransactionIDs and TransactionLogsDiskUsage metrics on AWS - Upwork","description":"- Establish alert thresholds for MaximumUsedTransactionIDs and TransactionLogsDiskUsage metrics.\n- Configure monitoring of MaximumUsedTransactionIDs and TransactionLogsDiskUsage for the Postgres databases in all environments.\n- Implement Splunk alerts for immediate notification in case of DMS job failures.\n- Document the setup and configuration of the monitoring for MaximumUsedTransactionIDs and TransactionLogsDiskUsage metrics. Include guidelines for interpreting alerts and taking appropriate actions.<b>Skills</b>:        Cloud Engineering,                     Cloud Implementation,                     Amazon Web Services,                     DevOps,                     Deployment Automation,                     Amazon RDS            ","link":"https://www.upwork.com/jobs/set-alert-thresholds-for-MaximumUsedTransactionIDs-and-TransactionLogsDiskUsage-metrics-AWS_%7E0158748a6c8ef0ac9d?source=rss","processedDate":"2024-03-19T08:47:22.679Z","postedDate":"<b>Posted On</b>: March 04, 2024 17:43 UTC","id":"0158748a6c8ef0ac9d"},{"skillset":["Python","GitHub"],"title":"Splunk developer needed urgently - Upwork","description":"Experience Integrating Splunk with a variety of data sources\nExperience using Splunk handlers in Python\nPython experience compulsory\nNo learners. Must be very experienced<b>Skills</b>:        Python,                     GitHub            ","link":"https://www.upwork.com/jobs/Splunk-developer-needed-urgently_%7E01a282e6c6a7eb23b4?source=rss","processedDate":"2024-03-19T08:47:22.679Z","postedDate":"<b>Posted On</b>: March 03, 2024 17:35 UTC","id":"01a282e6c6a7eb23b4"},{"skillset":["Splunk"],"title":"Need some help on splunk query - Upwork","description":"Need a query to get the average of a pullrequest merge time. So that I can build dashboard around it. This is kind of a troubleshotting a query<b>Skills</b>:        Splunk            ","link":"https://www.upwork.com/jobs/Need-some-help-splunk-query_%7E016717c6cea0c25907?source=rss","processedDate":"2024-03-19T08:47:22.679Z","postedDate":"<b>Posted On</b>: February 27, 2024 00:03 UTC","id":"016717c6cea0c25907"},{"skillset":["Splunk","Training"],"title":"Splunk trainer required - Upwork","description":"Develop and deliver comprehensive training courses on Splunk products and solutions, including Splunk Enterprise, Splunk Cloud, and Splunk IT Service Intelligence (ITSI).\nCreate engaging and interactive learning materials, including presentations, demos, hands-on labs, and exercises.\nCustomize training content to meet the specific needs and skill levels of participants, including administrators, developers, and end-users.\nProvide guidance and support to students throughout their Splunk learning journey, including answering questions, troubleshooting issues, and sharing best practices.\nStay updated on the latest developments and features in Splunk technology to ensure training materials are current and relevant.\nCollaborate with other trainers and subject matter experts to continuously improve training programs and develop new courses.\nEvaluate the effectiveness of training sessions through assessments and feedback and make adjustments as needed.\nAssist clients in developing Splunk implementation plans, use cases, and strategies as needed.\nParticipate in marketing and promotional activities to attract new students and promote our training offerings.<b>Skills</b>:        Splunk,                     Training            ","link":"https://www.upwork.com/jobs/Splunk-trainer-required_%7E018398f912d296b6d2?source=rss","processedDate":"2024-03-19T08:47:22.680Z","postedDate":"<b>Posted On</b>: February 25, 2024 14:32 UTC","id":"018398f912d296b6d2"},{"skillset":["Python"],"title":"Develop QRadar/Splunk apps/add-ons - Upwork","description":"We are a leading enterprise software company seeking an experienced developer to create Splunk and QRadar integrations for our product. The goal is to fetch data via API from our product and present it seamlessly within Splunk and QRadar dashboards for efficient monitoring and analysis.\nResponsibilities:\n* Develop Splunk and QRadar integrations to fetch data from our enterprise product via API.\n* Design and implement connectors for seamless data retrieval.\n* Flexible setup and customization for our clients using these apps.\n* Ensure proper parsing and formatting of data for optimal display in Splunk and QRadar environments.\n* Build dashboards within Splunk and QRadar to present the data in a clear and actionable format.\nSkills Required:\n* Strong experience in developing Splunk and QRadar integrations.\n* Proficiency in languages such as Python\n* Familiarity with API authentication mechanisms and data retrieval.\n* Expertise in creating configuration option screens for seamless integration setup.\n* Ability to design and implement visually appealing dashboards within Splunk and QRadar.\nDeliverables:\n* Successfully developed Splunk and QRadar integrations.\n* Fully documented code and configuration files.\n* Functional dashboards within Splunk and QRadar displaying relevant metrics.<b>Skills</b>:        Python            ","link":"https://www.upwork.com/jobs/Develop-QRadar-Splunk-apps-add-ons_%7E013e01b061174138b2?source=rss","processedDate":"2024-03-19T08:47:22.680Z","postedDate":"<b>Posted On</b>: February 21, 2024 13:24 UTC","id":"013e01b061174138b2"},{"skillset":["Jenkins","Bash","Python","Google Cloud Platform","CI/CD","System Administration","ELK Stack","Splunk","DevOps","Elasticsearch","Kibana"],"title":"DevOps Engineer - Upwork","description":"\nWe are on the lookout for a skilled Technical Support Expert and DevOps Engineer to assist our highly capable in-house tech team. This ongoing, part-time role focuses on providing hands-on support during peak workloads and serving as a knowledgeable sounding board for our team&rsquo;s ideas and strategies.\nKey Responsibilities:\nTechnical Support:\n●\tOffer hands-on assistance to our tech team, particularly during high workloads.\n●\tAct as a collaborative partner in brainstorming and problem-solving sessions.\nDevOps Engineering:\n●\tContribute your expertise to our SaaS project development and maintenance.\n●\tImplement and manage cloud computing, CI/CD systems, web sockets, and more.\nEssential Skills and Experience:\nTechnical Support:\n●\tProficient in Jablatron Systems, general networking, and Windows 12 Server (including security, firewalls, and ports).\n●\tExperienced with Managed Switches and Draytech Routers.\n●\tRelevant advanced IT qualifications or equivalent experience.\nDevOps Engineer:\n●\tStrong background in cloud computing, CI/CD systems, setting up databases and servers, Elastic Search, and related technologies.\n●\tExtensive experience in DevOps, with a focus on SaaS projects preferred.\nIdeal Candidate Profile:\n●\tFluent in English with excellent collaborative communication skills.\n●\tIndependent yet adept at working as part of a team.\n●\tA tech enthusiast who&rsquo;s always eager to explore and discuss new technological trends.<b>Skills</b>:        Jenkins,                     Bash,                     Python,                     Google Cloud Platform,                     CI/CD,                     System Administration,                     ELK Stack,                     Splunk,                     DevOps,                     Elasticsearch,                     Kibana            ","link":"https://www.upwork.com/jobs/DevOps-Engineer_%7E016136819e4bf1a165?source=rss","processedDate":"2024-03-19T08:47:22.680Z","postedDate":"<b>Posted On</b>: February 08, 2024 12:48 UTC","id":"016136819e4bf1a165"},{"skillset":["MySQL","Java"],"title":"Low code/Out systems Developer -4+ Yrs - Upwork","description":"We are looking for an Independent contributor, who can support us for 8 hours a day, 5 days a week, with the following requirements.\nRole- Low code Developer\nExp Required - 4+ Yrs\nContract -06 Months\nTimings : 10:30 am to 07:30 PM IST\nLocation : Remote (India)\n3+ years of .NET or JAVA development experience\nExperience with Outsystems and/or Appian for Low-Code preferable - 4yrs\n 3+ years with relational databases\n 3+ years of MS SQL or MYSQL\n 1+ years designing and developing REST APIs\n Proficiency in C#, .NET, HTML, and/or Javascript\n Exposure to JIRA and BitBucket/Git for source control a plus\n Practical understanding of data structures, algorithms, and design patterns in a web environment  Cloud first architectures (AWS, Azure, Cloudera, etc.) a plus\n Log aggregators (SumoLogic, Splunk) a plus\n Experience with SAP, HANA, and/or Vistex a plus\n Bachelor&#039;s degree in Computer Science, Information Technology or similar\n Strong analytical skills to debug complex problems and curiosity/passion for technology\n Great understanding of Web Performance measuring and how to optimize (APM)\n Great collaborator and communicator with teammates and business partners\n Good written and verbal language skills (English)\nInterested candidates please apply with your resume.<b>Skills</b>:        MySQL,                     Java            ","link":"https://www.upwork.com/jobs/Low-code-Out-systems-Developer-Yrs_%7E016099af0da0ddf4f7?source=rss","processedDate":"2024-03-19T08:47:22.680Z","postedDate":"<b>Posted On</b>: February 03, 2024 07:31 UTC","id":"016099af0da0ddf4f7"},{"skillset":["Telegram API","Bot Development","API","Node.js","Chatbot Development"],"title":"Telegram Bot Developer - Upwork","description":"Job Title: Telegram Bot Developer\nJob Description\nI&#039;m looking for a skilled Telegram Bot Developer who can help me expand the capabilities of my project. I need someone with experience in developing Telegram bots, especially using the Telegraf library on the Node.js platform. This job involves creating simple, interactive bots that engage users on Telegram. It&#039;s a straightforward task, and I&#039;ll give you detailed instructions or pseudocode on how I want the user interactions to be, making it an easy and clear job.\nResponsibilities:\n- Develop simple Telegram bots using the Telegraf framework, inspired by the bots I&#039;ve mentioned.\n- Use Telegraf to manage commands, callbacks, and middleware in a straightforward way.\n- Create basic user interactions with inline keyboards and custom markups.\n- Integrate external APIs to bring dynamic content into the bots, similar to the examples provided.\n- Ensure the bots run smoothly with basic error handling, user authentication, and data management.\n- I&#039;ll work closely with you, providing clear guidelines and expectations to translate user needs into technical solutions.\n- Stay updated with Telegram bot development trends, but don&#039;t worry, the job won&#039;t require anything too complex.\nQualifications:\n- Experience in developing Telegram bots, ideally with some simple projects in your portfolio.\n- Familiarity with Node.js, TypeScript, and the Telegram bot ecosystem.\n- Ability to integrate external APIs and services.\n- Know-how to create straightforward conversational flows and basic chatbot UI/UX.\n- Competence in basic authentication, error handling, and data storage within bots.\n- Good problem-solving skills and the ability to follow detailed instructions.\n- Good communication skills.\nHow to Apply:\nSend me your resume, a cover letter, and a portfolio of Telegram bots you&#039;ve developed. Highlight any simple projects you&#039;ve worked on. Let me know your experience with the Telegraf library and Node.js, emphasizing how you can make this project straightforward and cost-effective.\nThis job is much simpler than it sounds, and I&#039;m looking for someone who can do it efficiently without overcomplicating things. I&#039;m excited to see how you can contribute with your skills!<b>Skills</b>:        Telegram API,                     Bot Development,                     API,                     Node.js,                     Chatbot Development            ","link":"https://www.upwork.com/jobs/Telegram-Bot-Developer_%7E01ee106318e0f2e105?source=rss","processedDate":"2024-03-19T08:47:28.478Z","postedDate":"<b>Posted On</b>: February 26, 2024 23:54 UTC","id":"01ee106318e0f2e105"},{"skillset":["CentOS","Linux System Administration","Linux","System Administration"],"title":"ISCSI need to configure on redhat cluster - Upwork","description":"Need some to run iscsi command on redhat cluster. Cluster is is ready just need to configure iscsi<b>Skills</b>:        CentOS,                     Linux System Administration,                     Linux,                     System Administration            ","link":"https://www.upwork.com/jobs/ISCSI-need-configure-redhat-cluster_%7E0130764bdd7e60c899?source=rss","processedDate":"2024-03-19T08:47:34.401Z","postedDate":"<b>Posted On</b>: March 17, 2024 10:18 UTC","id":"0130764bdd7e60c899"},{"skillset":["Linux System Administration","CentOS"],"title":"Country Block from Centos Server - Upwork","description":"We need Block Incoming Hit from Centos server.\nIt&rsquo;s a Vehicle Tracking server. Here sometimes hacker send fake data that&rsquo;s why we need only allow data receive from Bangladesh location IP&nbsp;&nbsp;and Block other country.<b>Skills</b>:        Linux System Administration,                     CentOS            ","link":"https://www.upwork.com/jobs/Country-Block-from-Centos-Server_%7E0142e758c828e0516f?source=rss","processedDate":"2024-03-19T08:47:34.401Z","postedDate":"<b>Posted On</b>: March 17, 2024 07:09 UTC","id":"0142e758c828e0516f"},{"skillset":["Linux"],"title":"OVH dedicate server lost data - Upwork","description":"I have a dedicate web server&nbsp;&nbsp;hosted in OVH.com, this morning, for unknown reason, the OVH shut down my server automatically went into rescue mode. \nAfter I restart my from disk mode, I noticed that the server rolled back to a very old status dated in 2020. My root password changed and crontab also changed to 4 years ago. All my data and files of yesterday has been lost.\nI never made any backup and never do any restore in the past months. \nI want to know if someone can help me to roll back all the files and data back to Yesterday&#039;s status? I guess this is OVH problem. <b>Skills</b>:        Linux            ","link":"https://www.upwork.com/jobs/OVH-dedicate-server-lost-data_%7E011d32644200a17c6c?source=rss","processedDate":"2024-03-19T08:47:34.401Z","postedDate":"<b>Posted On</b>: March 17, 2024 02:40 UTC","id":"011d32644200a17c6c"},{"skillset":["Server Virtualization","Linux","System Administration","Network Administration","Debian","Network Security","Linux System Administration"],"title":"Setup and Optimize Networking for 3 KVM Instances Using Virtfusion - Upwork","description":"We are wanting the KVM to be setup on the dedicated server from scratch, we will provide the root credentials etc which will need to then be setup.\nThis will be the setup:\nVPS: Virtfusion control server\nDedicated 1: Virtfusion Slave\nDedicated 2: Virtfusion slave\nDedicated 3: Virtfusion slave\nWe will provide access to all servers, including license keys, we need to ensure the networking is setup correctly for each VPS and the virtfusion control server and ensure bridge/vlan network all correctly work for new deployed VPS<b>Skills</b>:        Server Virtualization,                     Linux,                     System Administration,                     Network Administration,                     Debian,                     Network Security,                     Linux System Administration            ","link":"https://www.upwork.com/jobs/Setup-and-Optimize-Networking-for-KVM-Instances-Using-Virtfusion_%7E0195b8da8b27ea1d61?source=rss","processedDate":"2024-03-19T08:47:34.401Z","postedDate":"<b>Posted On</b>: March 16, 2024 17:14 UTC","id":"0195b8da8b27ea1d61"},{"skillset":["Docker","ERPNext"],"title":"Install ERPNext Docker image on unRaid Server - Upwork","description":"I would like to have ERPNext installed on my unRaid server. I see it looks like it could be done using docker compose, but if possible, I would like to have it as a normal docker container on unRaid and not go through Docker Compose. <b>Skills</b>:        Docker,                     ERPNext            ","link":"https://www.upwork.com/jobs/Install-ERPNext-Docker-image-unRaid-Server_%7E011527ae5033b70d7b?source=rss","processedDate":"2024-03-19T08:47:34.401Z","postedDate":"<b>Posted On</b>: March 16, 2024 17:11 UTC","id":"011527ae5033b70d7b"},{"skillset":[],"title":"Looking for cisco hyperflex expert - Upwork","description":"Looking for Expert on Cisco Hyperflex for my ongoing project.\nwe have cisco hyperflex installed in production. we need a expert who can help to resolve all sort of technical issues on hyperflex.","link":"https://www.upwork.com/jobs/Looking-for-cisco-hyperflex-expert_%7E01e5cf43bfc84f62f6?source=rss","processedDate":"2024-03-19T08:47:34.401Z","postedDate":"<b>Posted On</b>: March 15, 2024 11:45 UTC","id":"01e5cf43bfc84f62f6"},{"skillset":["DigitalOcean","Linux System Administration","Ubuntu","Linux","System Administration"],"title":"Digitalocean file restoring - Upwork","description":"We are seeking a skilled data recovery specialist to assist us in recovering files from DigitalOcean<b>Skills</b>:        DigitalOcean,                     Linux System Administration,                     Ubuntu,                     Linux,                     System Administration            ","link":"https://www.upwork.com/jobs/Digitalocean-file-restoring_%7E01129eabd9919bac99?source=rss","processedDate":"2024-03-19T08:47:34.401Z","postedDate":"<b>Posted On</b>: March 15, 2024 10:52 UTC","id":"01129eabd9919bac99"},{"skillset":["Linux System Administration","System Administration","Linux","Network Administration","Debian"],"title":"Install and configure edbjca on debian 12 - Upwork","description":"I need someone to install the package edbjca on my debian 12 server. I need you to configure it to work as a CA and configure all the related requirements such as installing and configuring an application server like wildly and a database like maria db\nI will need u to write a detailed instruction about installation so that I carry the same to production<b>Skills</b>:        Linux System Administration,                     System Administration,                     Linux,                     Network Administration,                     Debian            ","link":"https://www.upwork.com/jobs/Install-and-configure-edbjca-debian_%7E01024dfdbe952aa752?source=rss","processedDate":"2024-03-19T08:47:34.401Z","postedDate":"<b>Posted On</b>: March 15, 2024 06:18 UTC","id":"01024dfdbe952aa752"},{"skillset":["Network Administration","Firewall","Cisco Meraki"],"title":"Cisco Meraki Firewall MX67 Error - Upwork","description":"Troubleshoot Cisco Meraki Firewall DHCP Error \nIve been having the following errors populate randomly over the past few months on random Devices.\nDHCP\tDHCP problem\textra: no_offers_received, vap: 0, vlan: 1\nIt happens at random times and eventually the devices are assigned IP addresses however its beginning to cause minor bugs with users during the work day affecting internet connectivity. <b>Skills</b>:        Network Administration,                     Firewall,                     Cisco Meraki            ","link":"https://www.upwork.com/jobs/Cisco-Meraki-Firewall-MX67-Error_%7E0157b9b7f8c4609dc9?source=rss","processedDate":"2024-03-19T08:47:34.401Z","postedDate":"<b>Posted On</b>: March 15, 2024 03:53 UTC","id":"0157b9b7f8c4609dc9"},{"skillset":["Database Administration","PostgreSQL","Linux System Administration","Zabbix","System Monitoring"],"title":"Zabbix Setup for PostgreSQL - Upwork","description":"Need expert to setup zabbix monitoring for Postgres database <b>Skills</b>:        Database Administration,                     PostgreSQL,                     Linux System Administration,                     Zabbix,                     System Monitoring            ","link":"https://www.upwork.com/jobs/Zabbix-Setup-for-PostgreSQL_%7E01096341b3ff0e7ee4?source=rss","processedDate":"2024-03-19T08:47:34.401Z","postedDate":"<b>Posted On</b>: March 14, 2024 18:53 UTC","id":"01096341b3ff0e7ee4"},{"skillset":[],"title":"NextCloud Restore - Upwork","description":"NextCloud Restore\nWe have a backup of our NextCloud system that was made with RSnapshots (Ubuntu).\nWe need to restore the NextCloud on an Ubuntu VM on our server.\nIf you are an expert at NextCloud restoration, please submit a proposal.\nThank you.","link":"https://www.upwork.com/jobs/NextCloud-Restore_%7E019df19e6b78893d6b?source=rss","processedDate":"2024-03-19T08:47:34.402Z","postedDate":"<b>Posted On</b>: March 14, 2024 18:18 UTC","id":"019df19e6b78893d6b"},{"skillset":[],"title":"Spectralink 8440 VOIP Provisioning Server Setup - Upwork","description":"I&#039;m looking for someone with proven experience in setting up a https provisioning server for Spectralink WiFi VOIP handsets (8440). Please do not apply if you have no thorough knowledge of this.","link":"https://www.upwork.com/jobs/Spectralink-8440-VOIP-Provisioning-Server-Setup_%7E01383b9850ba994f75?source=rss","processedDate":"2024-03-19T08:47:34.402Z","postedDate":"<b>Posted On</b>: March 14, 2024 07:46 UTC","id":"01383b9850ba994f75"},{"skillset":["SAP SQL Anywhere"],"title":"SQLanywhere backup and restore - Upwork","description":"Hi we are looking for expert to help us on SQLanywhere backup and restore task for two systems and then some more DB related tasks<b>Skills</b>:        SAP SQL Anywhere            ","link":"https://www.upwork.com/jobs/SQLanywhere-backup-and-restore_%7E01097ac9c00e73609b?source=rss","processedDate":"2024-03-19T08:47:34.402Z","postedDate":"<b>Posted On</b>: March 14, 2024 05:46 UTC","id":"01097ac9c00e73609b"},{"skillset":["Ubuntu","Linux","Network Administration","Apache HTTP Server","Squid","Server","Linux System Administration","Bash","System Administration","Network Security"],"title":"Squid Proxy / Ubuntu Fix - Upwork","description":"You&#039;ll be required to fix ongoing issues with Squid Proxy. We have IP addresses routed to our server and assigning them with a custom script. However the user:pass authentication system is not working at all after the server has been rebooted. Some IP subnets are not pinging at all while the others are not working with the necessary authentication protocol. Your job will be: \n1) to finally identify this issue and make sure this won&#039;t happen for future server restarts\n2) explain the issue in great detail and also how the script may be responsible for it \n3) provide a solution to us / our hosting provider\nThe functionality of the custom script (basically executing squid and configuring the ip addresses) will be provided in detail so you won&#039;t have any issues understanding the ongoing processes.<b>Skills</b>:        Ubuntu,                     Linux,                     Network Administration,                     Apache HTTP Server,                     Squid,                     Server,                     Linux System Administration,                     Bash,                     System Administration,                     Network Security            ","link":"https://www.upwork.com/jobs/Squid-Proxy-Ubuntu-Fix_%7E010f03f51c8c5ac63b?source=rss","processedDate":"2024-03-19T08:47:34.402Z","postedDate":"<b>Posted On</b>: March 13, 2024 10:01 UTC","id":"010f03f51c8c5ac63b"},{"skillset":["Network Administration","Linux System Administration","System Administration","Network Security","Ubuntu"],"title":"Zabbix Setup Expert - Upwork","description":"We are seeking a skilled individual to setup Zabbix in our ITSM tool. The successful candidate must be fluent in Zabbix and have experience in configuring and implementing it within an ITSM environment. This project will involve setting up Zabbix to monitor various aspects of our IT infrastructure and integrating it seamlessly into our existing ITSM tool. The key skills required for this role include: \n- Fluent in Zabbix\n- Strong knowledge of ITSM\n- Experience in configuring Zabbix for monitoring\n- Familiarity with integrating Zabbix into existing ITSM tools\nIf you have the expertise and experience we are looking for, we would love to hear from you. Please submit your application detailing your relevant skills and experience.\nNote: We will Support him to implement Zabbix in our ITSM tool, our ask is to setup Zabbix and trigger alert from zabbix later that will be converted into tickets in our ITSM Tool<b>Skills</b>:        Network Administration,                     Linux System Administration,                     System Administration,                     Network Security,                     Ubuntu            ","link":"https://www.upwork.com/jobs/Zabbix-Setup-Expert_%7E013fe4b0fbe6e2adbb?source=rss","processedDate":"2024-03-19T08:47:34.402Z","postedDate":"<b>Posted On</b>: March 12, 2024 05:02 UTC","id":"013fe4b0fbe6e2adbb"},{"skillset":["Discourse","Linux","SSH","Linux System Administration"],"title":"Need someone who can install Discourse on a VPS following a simple tutorial - Upwork","description":"Hello there, exactly as the title states, I&#039;m looking for someone who can follow this tutorial https://www.digitalocean.com/community/tutorials/how-to-install-discourse-on-ubuntu-20-04 and install Discourse.\nThank you very much!<b>Skills</b>:        Discourse,                     Linux,                     SSH,                     Linux System Administration            ","link":"https://www.upwork.com/jobs/Need-someone-who-can-install-Discourse-VPS-following-simple-tutorial_%7E0130223bf3d15c6c6c?source=rss","processedDate":"2024-03-19T08:47:34.402Z","postedDate":"<b>Posted On</b>: March 11, 2024 23:24 UTC","id":"0130223bf3d15c6c6c"},{"skillset":["System Administration","Linux","Ubuntu","Desktop Application"],"title":"Kubuntu, kde  linux desktop admin - Upwork","description":"I am using kubuntu on Lenovo P50 and occasionally have issues with the system settings. Need someone that knows ubuntu well.\nThe current issue is that when using the nvidia card the system will not go to sleep.<b>Skills</b>:        System Administration,                     Linux,                     Ubuntu,                     Desktop Application            ","link":"https://www.upwork.com/jobs/Kubuntu-kde-linux-desktop-admin_%7E017f58b443a47072fd?source=rss","processedDate":"2024-03-19T08:47:34.402Z","postedDate":"<b>Posted On</b>: March 11, 2024 21:19 UTC","id":"017f58b443a47072fd"},{"skillset":["CentOS","Linux System Administration","Linux","Bash","Bash Programming"],"title":"Linux shell specialist needed - Upwork","description":" I need a specialist of Linux shell for a work of one hour on Linux shell scripts.<b>Skills</b>:        CentOS,                     Linux System Administration,                     Linux,                     Bash,                     Bash Programming            ","link":"https://www.upwork.com/jobs/Linux-shell-specialist-needed_%7E01acd9e10eccc3fcd9?source=rss","processedDate":"2024-03-19T08:47:34.402Z","postedDate":"<b>Posted On</b>: March 11, 2024 11:46 UTC","id":"01acd9e10eccc3fcd9"},{"skillset":["Cisco Certified Network Professional"],"title":"Cisco NCS5011 and NCS540 experts - Upwork","description":"We need someone who knows in depth networking about the Cisco NCS series.. What we need is someone who has experience with NCS540 and NCS5011\n- Guidance on its limitation\n- Share your experience in how you used this hardware along with best practices\n- Others<b>Skills</b>:        Cisco Certified Network Professional            ","link":"https://www.upwork.com/jobs/Cisco-NCS5011-and-NCS540-experts_%7E012b1f73e92a419e9b?source=rss","processedDate":"2024-03-19T08:47:34.402Z","postedDate":"<b>Posted On</b>: March 11, 2024 02:08 UTC","id":"012b1f73e92a419e9b"},{"skillset":["dBase"],"title":"MySQL - Upwork","description":"I have an Oracle OCI MySQL running as a PaaS, i want to replicate the data to PaaS hosted GCP.\nExperience \nConfiguring of MySQL from on-premise&nbsp;&nbsp;TO GCP Cloud MySQL (PaaS)\nConfiguring of MySQL from OCI Heatwave TO&nbsp;&nbsp;GCP Cloud MySQL (PaaS)\nScope of work\n1-&nbsp;&nbsp;Configuration requirement to deploy MySQL PaaS in GCP\n2- Deploy the PaaS in GCP (I can d this task as per your instruction)\n3- Configure connectivity from OCI- MySQL&nbsp;&nbsp;to GCP Cloud MySQL PaaS (I will configure the IPSec and routing). \n4- Create a tool/script to notify when the replication is falling behind or stopped.<b>Skills</b>:        dBase            ","link":"https://www.upwork.com/jobs/MySQL_%7E0188ec4d7ae2fa4dee?source=rss","processedDate":"2024-03-19T08:47:34.402Z","postedDate":"<b>Posted On</b>: March 10, 2024 10:22 UTC","id":"0188ec4d7ae2fa4dee"},{"skillset":["Linux System Administration"],"title":"Cloud server help - Upwork","description":"About cloud servers. We need help&nbsp;&nbsp;.\n AWS, oracle cloud ,AZURE, GCP, linode, if you are expert , you can contact me.<b>Skills</b>:        Linux System Administration            ","link":"https://www.upwork.com/jobs/Cloud-server-help_%7E012d892d7e5de20490?source=rss","processedDate":"2024-03-19T08:47:34.402Z","postedDate":"<b>Posted On</b>: March 10, 2024 07:54 UTC","id":"012d892d7e5de20490"},{"skillset":["Apache HTTP Server","Linux System Administration"],"title":"Bitnami apache fix load - Upwork","description":"load ca certificates using apache, I need some apache person.<b>Skills</b>:        Apache HTTP Server,                     Linux System Administration            ","link":"https://www.upwork.com/jobs/Bitnami-apache-fix-load_%7E01659f3d60e9bfd4ac?source=rss","processedDate":"2024-03-19T08:47:34.402Z","postedDate":"<b>Posted On</b>: March 10, 2024 04:25 UTC","id":"01659f3d60e9bfd4ac"},{"skillset":["Security Assessment &amp; Testing","Vulnerability Assessment","Kali Linux","Application Security","Penetration Testing","Network Security","Security Infrastructure","Manual Testing","Ethical Hacking","OWASP","Windows Server","NIST SP 800-53","Internet Security","Web Application Security","Security Engineering"],"title":"Stolen ps5 - Upwork","description":"My ps 5 was stolen I need it traced I have the serial number and box<b>Skills</b>:        Security Assessment &amp; Testing,                     Vulnerability Assessment,                     Kali Linux,                     Application Security,                     Penetration Testing,                     Network Security,                     Security Infrastructure,                     Manual Testing,                     Ethical Hacking,                     OWASP,                     Windows Server,                     NIST SP 800-53,                     Internet Security,                     Web Application Security,                     Security Engineering            ","link":"https://www.upwork.com/jobs/Stolen-ps5_%7E0137968ab812f7aaaa?source=rss","processedDate":"2024-03-19T08:47:34.402Z","postedDate":"<b>Posted On</b>: March 09, 2024 22:44 UTC","id":"0137968ab812f7aaaa"},{"skillset":["3CX","VoIP"],"title":"3CX on prem installation , setup with mobile connection - Upwork","description":"First you need to be 3cx expert , I have installed 3cx on prem but the issue im facing that url i can ony open on same computer and not outside of the network.\nany idea? then only apply<b>Skills</b>:        3CX,                     VoIP            ","link":"https://www.upwork.com/jobs/3CX-prem-installation-setup-with-mobile-connection_%7E014884b274d3a87759?source=rss","processedDate":"2024-03-19T08:47:34.402Z","postedDate":"<b>Posted On</b>: March 09, 2024 14:27 UTC","id":"014884b274d3a87759"},{"skillset":["Oracle Database","Oracle NoSQL Database","Linux"],"title":"Oracle servers Storage Migration  - Upwork","description":"Our four physical Oracle servers are divided into two PROD and one TEST server. They are running Oracle Database 19C, Oracle EBS 12.2.10, and Oracle Linux 7.9. Additionally, we have Oracle Linux 6.5, Oracle EBS 12.1.3, and Oracle Database 11.2.0.4 (11G) on the same 2 servers (PROD + TEST). The physical servers won&#039;t change; rather, their LUN will be moved to new network switches, storage, and SANs.\nWe need Engineer to support to migrate the LUN to new storage.<b>Skills</b>:        Oracle Database,                     Oracle NoSQL Database,                     Linux            ","link":"https://www.upwork.com/jobs/Oracle-servers-Storage-Migration_%7E01864ab875d70ef668?source=rss","processedDate":"2024-03-19T08:47:34.402Z","postedDate":"<b>Posted On</b>: March 09, 2024 12:18 UTC","id":"01864ab875d70ef668"},{"skillset":["Network Engineering","Network Administration","Aruba","Cisco WLC","Cisco Prime","Cisco Meraki","Fortinet","Computer Network","Computing &amp; Networking","Cisco ASA","Cisco IOS","Cisco ISE"],"title":"ISE, DNA, SDWAN Deployment - Upwork","description":"\nWorking with a client in Manhattan on an ISE, SDWAN and DNA deployment that is fully in flight, I need an engineer that has been there and done that.\n\t1. Design workshops complete\n\t2. Lab Environment SDWAN stood up with DNA, ISE almost completed.\n\t\ta. The lab environment will turn into production once UAT is completed by the client\n\t3. I need an engineer to steps in and take on the remaining work to get this implementation completed, \n\t4. I have about 85 days to get us through remaining build and migrations. \n\t5. The current engineer will still be available for consult and will thoroughly hand this off if you should engage. \n\t6. Timeline is looking like 4 to 5 months to get us to the first migration\n\t7. The project has a project Manager and will drive all the activity with the client and keep everyone in check.\n\t8. We are a little behind and will need to ramp up quickly\n I can go deeper into the discussion if your interested in taking on this project <b>Skills</b>:        Network Engineering,                     Network Administration,                     Aruba,                     Cisco WLC,                     Cisco Prime,                     Cisco Meraki,                     Fortinet,                     Computer Network,                     Computing &amp; Networking,                     Cisco ASA,                     Cisco IOS,                     Cisco ISE            ","link":"https://www.upwork.com/jobs/ISE-DNA-SDWAN-Deployment_%7E01a63c783ea8023633?source=rss","processedDate":"2024-03-19T08:47:34.402Z","postedDate":"<b>Posted On</b>: March 08, 2024 19:23 UTC","id":"01a63c783ea8023633"},{"skillset":["Asterisk","VoIP","Linux"],"title":"Problem with Asterisk - Upwork","description":"Hello, I&#039;m using a server with Magnus Billing + Asterisk, and since yesterday I started having some problems with attacks, calls drop and the SIPS that are connected disconnect, it only resolves when I restart Asterisk, but after a few minutes the problem happens again . I&#039;ve already tried configuring fail2ban, but it doesn&#039;t seem to solve my problem.<b>Skills</b>:        Asterisk,                     VoIP,                     Linux            ","link":"https://www.upwork.com/jobs/Problem-with-Asterisk_%7E011884d593b5ccec05?source=rss","processedDate":"2024-03-19T08:47:34.402Z","postedDate":"<b>Posted On</b>: March 08, 2024 16:30 UTC","id":"011884d593b5ccec05"},{"skillset":["VPN","Network Administration","Network Equipment","Network Security","Computer Network","Firewall","Microsoft Windows","Linux","Virtual LAN","Linux System Administration"],"title":"Help in Routing Home Router traffic using DDWRT software through 5G SOCKS5 Proxy - Upwork","description":"I have installed DD-WRT successfully on an ASUS RT-AC66U - it&#039;s running latest version of DD-WRT. I need someone to connect to my laptop using anydesk and configure the DD-WRT software so that all devices which are connected to that router are routed through the 5G Proxy. I also need the DD-WRT settings to be modified: Firewall rules that block STUN (Session Traversal Utilities for NAT) servers used by WebRTC to prevent my ip from leaking. Any other suggests are welcomed. The router/DD-WRT software will route traffic through a USA 5G Proxy and have iPhones connected&nbsp;&nbsp;to it for use with Tiktok marketing. We want to avoid any ip leakage to make sure TikTok thinks we are in the USA by having a USA IP Address. Please don&#039;t tell me I can use a normal VPN... I&#039;m interested in routing traffic to my 5G USA proxy only.<b>Skills</b>:        VPN,                     Network Administration,                     Network Equipment,                     Network Security,                     Computer Network,                     Firewall,                     Microsoft Windows,                     Linux,                     Virtual LAN,                     Linux System Administration            ","link":"https://www.upwork.com/jobs/Help-Routing-Home-Router-traffic-using-DDWRT-software-through-SOCKS5-Proxy_%7E01d751e6ac4d77af35?source=rss","processedDate":"2024-03-19T08:47:34.402Z","postedDate":"<b>Posted On</b>: March 08, 2024 08:58 UTC","id":"01d751e6ac4d77af35"},{"skillset":["Linux System Administration","Network Administration","System Administration","Linux"],"title":"Setting up two linux servers and  server with vpn. - Upwork","description":"Need to set up stage and production servers and github for them. To make everything work, the project is written in laravel/php. \nAlso we need to configure standard security settings for the servers. \nAnd the second task is to configure connection to stage server via vpn through another server. The server with vpn already has wireguard installed.\nWe will be able to describe the task in more detail in private messages. <b>Skills</b>:        Linux System Administration,                     Network Administration,                     System Administration,                     Linux            ","link":"https://www.upwork.com/jobs/Setting-two-linux-servers-and-server-with-vpn_%7E01e0e45bc33e13b87f?source=rss","processedDate":"2024-03-19T08:47:34.402Z","postedDate":"<b>Posted On</b>: March 07, 2024 15:28 UTC","id":"01e0e45bc33e13b87f"},{"skillset":["Oracle Database"],"title":"Oracle OEM HA Solution - Upwork","description":"Looking for Oracle Cloud Control version 13 (OEM) HA Solution requirements and documentation.<b>Skills</b>:        Oracle Database            ","link":"https://www.upwork.com/jobs/Oracle-OEM-Solution_%7E011bd3b70d664e28a9?source=rss","processedDate":"2024-03-19T08:47:34.402Z","postedDate":"<b>Posted On</b>: March 07, 2024 15:24 UTC","id":"011bd3b70d664e28a9"},{"skillset":["Linux System Administration","Network Administration","CentOS","cPanel","Computer Network","Postfix SMTP Server"],"title":"Server admin specialized in Mail Configuration, Postfix, WHM and more - Upwork","description":"Need a system admin that can help me out with some questions and configuring mail servers. \nOur servers are with Hetzner Cloud and we also have CloudFlare.\nLooking for a good troubleshooter that can help me with DNS settings.\nYour English should be good enough to communicate easily via voice and text.\nWe will invite you for a short interview if we think you are a suitable option for us.\nThanks,\nKind Regards,\nDave and Elle<b>Skills</b>:        Linux System Administration,                     Network Administration,                     CentOS,                     cPanel,                     Computer Network,                     Postfix SMTP Server            ","link":"https://www.upwork.com/jobs/Server-admin-specialized-Mail-Configuration-Postfix-WHM-and-more_%7E0115877449692bb076?source=rss","processedDate":"2024-03-19T08:47:34.402Z","postedDate":"<b>Posted On</b>: March 07, 2024 14:14 UTC","id":"0115877449692bb076"},{"skillset":["Business with 10-99 Employees"],"title":"SSL Certificate installation for Tomcat and Windows Server - Upwork","description":"Install SSL Certificate to Tomcat Servers and Windows Server IIS<b>Skills</b>:        Business with 10-99 Employees            ","link":"https://www.upwork.com/jobs/SSL-Certificate-installation-for-Tomcat-and-Windows-Server_%7E0132d27c5e966fb4bb?source=rss","processedDate":"2024-03-19T08:47:34.402Z","postedDate":"<b>Posted On</b>: March 07, 2024 13:34 UTC","id":"0132d27c5e966fb4bb"},{"skillset":["Ubuntu","DigitalOcean","System Administration","PostgreSQL"],"title":"Liferay 7.3/7.4 installation on Digital Ocean - Upwork","description":"I&#039;m looking for someone who is experienced in Liferay installation who can debug this install quickly. Data base step is causing problems.\nSee logfile attached<b>Skills</b>:        Ubuntu,                     DigitalOcean,                     System Administration,                     PostgreSQL            ","link":"https://www.upwork.com/jobs/Liferay-installation-Digital-Ocean_%7E014f7f292383067c50?source=rss","processedDate":"2024-03-19T08:47:34.402Z","postedDate":"<b>Posted On</b>: March 07, 2024 12:21 UTC","id":"014f7f292383067c50"},{"skillset":["Ethical Hacking"],"title":"Gmail Recovery - Upwork","description":"I want to recover my gmail account without device &amp;amp; without phone number<b>Skills</b>:        Ethical Hacking            ","link":"https://www.upwork.com/jobs/Gmail-Recovery_%7E0101c72a582013dd8a?source=rss","processedDate":"2024-03-19T08:47:34.402Z","postedDate":"<b>Posted On</b>: March 07, 2024 09:08 UTC","id":"0101c72a582013dd8a"},{"skillset":["PostgreSQL","TCP/IP","Linux"],"title":"Postgress sql not accessible through TC/IP - Upwork","description":"We are able to connect to postgress sql on server but seems listener settings need to be set for access through TCP IP <b>Skills</b>:        PostgreSQL,                     TCP/IP,                     Linux            ","link":"https://www.upwork.com/jobs/Postgress-sql-not-accessible-through_%7E0114da3acc00564087?source=rss","processedDate":"2024-03-19T08:47:34.402Z","postedDate":"<b>Posted On</b>: March 07, 2024 07:56 UTC","id":"0114da3acc00564087"},{"skillset":["FreePBX","Asterisk","VoIP Administration"],"title":"Need Help with FreePBX server running in the cloud - Upwork","description":"We have a FreePBX server that has been running on AWS for a while, the IP address on our office Firewall changed and now the FreePBX server is not accepting the phone connections.&nbsp;&nbsp;it shows the following error message:\nchan_sip.c:28835 handle_request_register: Registration from &#039;&amp;quot;freddy&amp;quot; sip:freddy@x.x.x.x:5060&#039; failed for &#039;x.x.x.x:5060&#039; - Wrong password\nno passwords have changed and we have confirmed that we are using the correct passwords.&nbsp;&nbsp;\ntried connecting the phone using a netgear router to remove firewall from the picture and still same issue.\nneed someone to help us solve this issue.<b>Skills</b>:        FreePBX,                     Asterisk,                     VoIP Administration            ","link":"https://www.upwork.com/jobs/Need-Help-with-FreePBX-server-running-the-cloud_%7E016cce8fb0a118a7f2?source=rss","processedDate":"2024-03-19T08:47:34.402Z","postedDate":"<b>Posted On</b>: March 07, 2024 07:02 UTC","id":"016cce8fb0a118a7f2"},{"skillset":["Linux","Postfix SMTP Server","Linux System Administration","System Administration","Email Communication","Email Deliverability","Mail Server Implementation","DNS","SMTP","Ubuntu"],"title":"Set up my Ubuntu 20.08 as a mail server and send email to Gmail - Upwork","description":"I want to set up my Ubuntu 20.04 to send SMTP messages to Gmail, Hotmail, and Yahoo domains. \nSetup MX Record &amp;amp; DNS Entry\nSecure SMTP \nInstall necessary software to setup robust SMTP mail server<b>Skills</b>:        Linux,                     Postfix SMTP Server,                     Linux System Administration,                     System Administration,                     Email Communication,                     Email Deliverability,                     Mail Server Implementation,                     DNS,                     SMTP,                     Ubuntu            ","link":"https://www.upwork.com/jobs/Set-Ubuntu-mail-server-and-send-email-Gmail_%7E0177c351f03bf34a90?source=rss","processedDate":"2024-03-19T08:47:34.402Z","postedDate":"<b>Posted On</b>: March 07, 2024 04:42 UTC","id":"0177c351f03bf34a90"},{"skillset":["NGINX","SSL","Linux System Administration","Docker","Ubuntu"],"title":"Nginx Proxy Setup+SSL Configuration - Upwork","description":"I need someone to help me with proxy setup.\nI am using this script \nhttps://shorturl.at/izO08\nHere is some guides i used to install this in Ubuntu and docker script running\nDocker setup : https://shorturl.at/wHKL6\nProxy : https://shorturl.at/qEOP9\nYou can setup cloudflare SSL or Lets encrypt SSL<b>Skills</b>:        NGINX,                     SSL,                     Linux System Administration,                     Docker,                     Ubuntu            ","link":"https://www.upwork.com/jobs/Nginx-Proxy-Setup-SSL-Configuration_%7E01f51985af0f336a2a?source=rss","processedDate":"2024-03-19T08:47:34.402Z","postedDate":"<b>Posted On</b>: March 06, 2024 18:16 UTC","id":"01f51985af0f336a2a"},{"skillset":["Network Administration","Dedicated Platform"],"title":"Hetzner private dedicated server configuration &amp; advisory - Upwork","description":"We currently have a dedicated cluster in Italy with an Italian Provider named Aruba.\nThe current Setup schema is hereunder attached.\nWe have been looking at Hetzner, german provider, and both the quantity of computational resources as well as the price are unmatched.\nThe three servers at aruba are described in the Aruba Server.png Attachment while the targeted ones at Hetzner are described in the Hetzner Server.png attachment.\nIn the current setup there are 2 characterstics:\n1) dedicated private switch (layer 2)\n2) Physical firewall with PFsense installed (the only thing exposed to internet)\nNow the question would be, and the need for consultance therefore, is it possible to replicate the current architecture in Hetzner without having to buy a 4th machine just to install PFsense? (since the minimum one is 64gb of RAM, too much for just PFSense).\nIn the new Architecture there will also be some difference regarding operating systems, in particular:\nServer A\n- OS: Ubuntu\nServer B\n- OS Harvester \nServer C\n- OS Harvester\nIn the current environment we&#039;ve set up a VPN on PFsense, thank to the physical firewall.\nSince I believe that it wont be possible to have one at Hetzner, there is another alternative solution?<b>Skills</b>:        Network Administration,                     Dedicated Platform            ","link":"https://www.upwork.com/jobs/Hetzner-private-dedicated-server-configuration-amp-advisory_%7E019e0e77ebb1a5870c?source=rss","processedDate":"2024-03-19T08:47:34.402Z","postedDate":"<b>Posted On</b>: March 06, 2024 14:39 UTC","id":"019e0e77ebb1a5870c"},{"skillset":["FortiGate Firewall","Linux"],"title":"Fortigate script - change virtual server port automatically - Upwork","description":"We have Virtual Server configured with Virtual Server IP:Port = external IP address:443. This IP:Port also used for Fortigate ACME Let&#039;sEncrypt certificate (we run a small webserver for internal use). Therefore, we would like a automated script to:\n1) 30 days from Let&#039;sEncrypt certificate expiry date (at set at 2359 hours);\n2) temporarily change Virtual Server Port to some other port;\n3) check that Let&#039;sEncrypt certificate has successfully retrieved new certificate (it should show new expiry date);\n4) change back Virtual Server Port to 443.<b>Skills</b>:        FortiGate Firewall,                     Linux            ","link":"https://www.upwork.com/jobs/Fortigate-script-change-virtual-server-port-automatically_%7E01f4ac50a46eec900e?source=rss","processedDate":"2024-03-19T08:47:34.402Z","postedDate":"<b>Posted On</b>: March 06, 2024 03:17 UTC","id":"01f4ac50a46eec900e"},{"skillset":["Ubuntu","Network Security","NGINX","Web Proxy","Linux"],"title":"Nginx Reverse Proxy - Upwork","description":"Network Engineer - Reverse Proxy configuration\nWe are currently seeking an engineer to assist with the reverse proxy configuration.\nThe engineer, ideally, should have experience with nginx proxies, Namecheap and Cloudflare\n- You will get access to our nginx reverse proxy server and an example website\n- You will configure the reverse proxy to be sending his IP address, instead of the user&#039;s IP address.\nWe will be more than happy to collaborate with you.<b>Skills</b>:        Ubuntu,                     Network Security,                     NGINX,                     Web Proxy,                     Linux            ","link":"https://www.upwork.com/jobs/Nginx-Reverse-Proxy_%7E017dbfba19029b1974?source=rss","processedDate":"2024-03-19T08:47:34.402Z","postedDate":"<b>Posted On</b>: March 05, 2024 18:30 UTC","id":"017dbfba19029b1974"},{"skillset":["Apache HTTP Server","Linux","Amazon Web Services","Elasticsearch","Linux System Administration","PHP","MySQL","Ubuntu"],"title":"Need Expert for Elasticsearch to troubleshoot service failed Linux server  - Upwork","description":"We setup Elastic service instance&nbsp;&nbsp;in Ubuntu machine and access from multiple websites for keyword each and other filters.\nSome time the instance got down and error says &amp;quot;failed&amp;quot; due to memory issue or CPU Utilization.\nWe are not able to troubleshoot and find the solution for this issue.\nwe installed the same setup in one more Ubuntu machine, both system sometimes elastic service got down.\nNeed Solution -\n1. We need to setup proper Error log mechanism to capture the down time.\n2. Set alert mechanism for threshold for prevent this issue.\n3. How to sortout this failed issue.\nAttached error screenshot and message.\nElastic down at 7:35pm because of&nbsp;&nbsp;&amp;quot;ExitOnOutOfMemoryError&amp;quot; memory size exceed.\n&nbsp;&nbsp;<b>Skills</b>:        Apache HTTP Server,                     Linux,                     Amazon Web Services,                     Elasticsearch,                     Linux System Administration,                     PHP,                     MySQL,                     Ubuntu            ","link":"https://www.upwork.com/jobs/Need-Expert-for-Elasticsearch-troubleshoot-service-failed-Linux-server_%7E01107dd24ff465d317?source=rss","processedDate":"2024-03-19T08:47:34.402Z","postedDate":"<b>Posted On</b>: March 05, 2024 15:18 UTC","id":"01107dd24ff465d317"},{"skillset":["Linux","Ubuntu","Network Engineering","VPN","Network Administration","Network Security","Linux System Administration","Firewall","System Administration"],"title":"Setup V2Ray or Vless / Equivalent VPN servers  - Upwork","description":"We are looking for someone with experience in V2Ray vpn setup. Planning to add this into our network and need an expert to discuss potential options and also implement a solution. \nThis will be the beginning of a longterm working partnership.&nbsp;&nbsp;<b>Skills</b>:        Linux,                     Ubuntu,                     Network Engineering,                     VPN,                     Network Administration,                     Network Security,                     Linux System Administration,                     Firewall,                     System Administration            ","link":"https://www.upwork.com/jobs/Setup-V2Ray-Vless-Equivalent-VPN-servers_%7E01a9fff8c819f0bd62?source=rss","processedDate":"2024-03-19T08:47:34.403Z","postedDate":"<b>Posted On</b>: March 05, 2024 06:48 UTC","id":"01a9fff8c819f0bd62"},{"skillset":["Kamailio","Asterisk"],"title":"Kamailio with TLS- Handshake fail with some client sites - Upwork","description":"We have a Kamailio server setup with TLS and RTP Engine.&nbsp;&nbsp;The Kamailio server connected with Asterisk Voice gateway. \nThere is a one way audio when calls are made. We need a Kamailio server expert to troubleshoot and fix the issue.\n======\nUpdate -\nHi , The one way audio is fixed but we have an issue where a TLS handshake with client fails. A softphone(MicroSIP) is able to connect using SIP-TLS with our Kamailio server but not our clients.\nNeed to troubleshoot and fix this.\nAttached error screenshot from Kamailio log\nPlease let me know you can help with fixing this?<b>Skills</b>:        Kamailio,                     Asterisk            ","link":"https://www.upwork.com/jobs/Kamailio-with-TLS-Handshake-fail-with-some-client-sites_%7E01b7d5265ef30d37e7?source=rss","processedDate":"2024-03-19T08:47:34.403Z","postedDate":"<b>Posted On</b>: March 05, 2024 01:00 UTC","id":"01b7d5265ef30d37e7"},{"skillset":["VMWare","Google Cloud Platform","Veeam"],"title":"Backup 3 VM3 from GCP VMWare - Upwork","description":"I have a Private Cloud on GCP (VMWare engine) with 3 VMs. I need to backup these 3 VMs and then restore them to a new Private Cloud.\nThe backup needs to be completed in the next 16 hours - by 16:00 CET.<b>Skills</b>:        VMWare,                     Google Cloud Platform,                     Veeam            ","link":"https://www.upwork.com/jobs/Backup-VM3-from-GCP-VMWare_%7E015ec12b994777a641?source=rss","processedDate":"2024-03-19T08:47:34.403Z","postedDate":"<b>Posted On</b>: March 04, 2024 23:26 UTC","id":"015ec12b994777a641"},{"skillset":["CentOS","Ubuntu","Amazon EC2","Linux System Administration","Network Administration","cPanel","Plesk","Virtual Private Server","Apache Administration","Web Host Manager"],"title":"VPN or Server - Upwork","description":"Hi, I don&#039;t know much about tech but I bought a machine that only allows access if your on my wifi and I know there is a way that it could be done where others can also access it. I don&#039;t know much about any of this but from what I was told this could be done by creating a VPN or some kind of server. I am open to your expertise in potentially figuring out a solution for me. If you are interested lets set up a call so I can explain more if you are interested. Thanks<b>Skills</b>:        CentOS,                     Ubuntu,                     Amazon EC2,                     Linux System Administration,                     Network Administration,                     cPanel,                     Plesk,                     Virtual Private Server,                     Apache Administration,                     Web Host Manager            ","link":"https://www.upwork.com/jobs/VPN-Server_%7E012379feecab4e04a0?source=rss","processedDate":"2024-03-19T08:47:34.403Z","postedDate":"<b>Posted On</b>: March 04, 2024 21:53 UTC","id":"012379feecab4e04a0"},{"skillset":["DevOps","Linux","System Administration","Linux System Administration"],"title":"Server Migration Dev Ops - Upwork","description":"We would like to have a resource who can migrate the server:\n-The resource have to migrate the server from old VPS server to new VPS server. Migration of 30-32 approx websites\n-SSL Implementation\n-DNS updations\nTotal VPS server space is 230GB approx.\nPlz make sure that nothing should change in terms of UI/UX, tech, plungi etc on the new server.\nThe activity should take place during night only.\nPlease share your profile+work exp..\nAlso share the tentative timelines.<b>Skills</b>:        DevOps,                     Linux,                     System Administration,                     Linux System Administration            ","link":"https://www.upwork.com/jobs/Server-Migration-Dev-Ops_%7E016bbc298002ad3122?source=rss","processedDate":"2024-03-19T08:47:34.403Z","postedDate":"<b>Posted On</b>: March 04, 2024 09:34 UTC","id":"016bbc298002ad3122"},{"skillset":["System Administration","Oracle WebLogic Server"],"title":"Weblogic 11 to weblogic 12 e migration - Upwork","description":"Project Description:\nWe are currently in the process of migrating our Oracle WebLogic Server applications from version 11G to 12C. Our team has initiated the setup of the WebLogic 12C environment but requires specialized assistance to complete the migration successfully. This project involves not only the migration of applications but also ensuring their compatibility and optimal functionality in the new environment.\nWhat Has Been Done:\nInitial Setup: Oracle WebLogic Server 12C has been installed by our team.\nDatabase Server: A database server has been created, ready for integration with WebLogic 12C.\nDomain Creation: The process of creating a new domain in WebLogic 12C has been started but not completed.\nWhat Needs to Be Done:\nDomain Configuration: Complete the creation and configuration of the domain in WebLogic 12C, ensuring it is correctly pointed to our database server.\nMigration of Applications: Migrate our applications from WebLogic 11G to 12C, including Oracle Forms 11G, ensuring compatibility and functionality.\nDependency Management: Identify and migrate all dependencies necessary for the applications to function optimally in the new environment.\nTesting and Optimization: Conduct thorough testing of the migrated applications for functionality, performance, and security. Optimize the environment based on testing outcomes.\nBackup Strategy: Advise on and implement a robust backup strategy for the current 11G environment before migration, if not already in place.\nDocumentation: Provide detailed documentation of the migration process, configurations, and any changes made during the transition.\nSkills Required:\nIn-depth knowledge of Oracle WebLogic Server, specifically versions 11G and 12C.\nExperience with Oracle Forms 11G and the migration challenges associated with these forms.\nProficiency in database connectivity and domain configuration within WebLogic environments.\nStrong troubleshooting and optimization skills for WebLogic applications.\nExcellent communication skills, with the ability to document and explain technical processes clearly.<b>Skills</b>:        System Administration,                     Oracle WebLogic Server            ","link":"https://www.upwork.com/jobs/Weblogic-weblogic-migration_%7E0160a3bc97a0cd075f?source=rss","processedDate":"2024-03-19T08:47:34.403Z","postedDate":"<b>Posted On</b>: March 04, 2024 09:11 UTC","id":"0160a3bc97a0cd075f"},{"skillset":["Microsoft Windows","Linux","Windows Server","Linux System Administration","System Administration","Ubuntu"],"title":"SysAdmin GURU with knowledge of GPU/LLM servers and hosting LLM's - Upwork","description":"Are you an Expert in installing a server from scratch with NVIDIA GPU?\nWe have a server with Nvidia RTX-8000 GPU and 256GB ram and enough hard disk.\nWe want someone to do the following tasks and work with our IT team to get it done.\nUpdate all BIOS for the server.\nInstall Basrebone hypervisor or any other VM OS.\nWhen server boots, we want to go to ProxMox instance first so that we can manage all VM&#039;s from this instance.\nConfigure RTX-8000 (we had some issues configuring drivers for this in the past)\nInstall PROXMOX, Wazuh.com, Cal.com, and N8N.com instances (all these can be individual VM&#039;s)\nInstall 7B Mistral\nInstall LLama\nSetup Docker so that we can add/remove Docker installs\nCreate one latest Windows server instance\nOne MERN setup for web app\nOne Postgres SQL instance\nMySQL instance\nFABRIC https://github.com/danielmiessler/fabric\n(we will not be running all at a time, we will turn on/off instances for our experiments and POC projects)\nALL BOT RESPONSES WILL BE DELETED.\nPlease mention **SysAdminGuru** as the first word in your response so that I know you read the job description in detail.<b>Skills</b>:        Microsoft Windows,                     Linux,                     Windows Server,                     Linux System Administration,                     System Administration,                     Ubuntu            ","link":"https://www.upwork.com/jobs/SysAdmin-GURU-with-knowledge-GPU-LLM-servers-and-hosting-LLM_%7E018135e5e6c91d5cd1?source=rss","processedDate":"2024-03-19T08:47:34.403Z","postedDate":"<b>Posted On</b>: March 03, 2024 15:11 UTC","id":"018135e5e6c91d5cd1"},{"skillset":["Linux System Administration","CentOS","Linux","Network Administration"],"title":"install latest CURL and configure with PHP litespeed on Centos 7 server - Upwork","description":"I have Centos 7 server installed CyberPanel and I need to upgrade CURL to version 7.88 at least and configure it with PHP 8.1 for litespeed<b>Skills</b>:        Linux System Administration,                     CentOS,                     Linux,                     Network Administration            ","link":"https://www.upwork.com/jobs/install-latest-CURL-and-configure-with-PHP-litespeed-Centos-server_%7E01d092980b6296999c?source=rss","processedDate":"2024-03-19T08:47:34.403Z","postedDate":"<b>Posted On</b>: March 03, 2024 09:55 UTC","id":"01d092980b6296999c"},{"skillset":[],"title":"Veeva Configuration Specialist - Upwork","description":"&bull;\tWorking experience in the Veeva Vault platform and products RIM, QMS\n&bull;\tExpertise in Vault Object Model, Validation Rules, Relationships, Wizards, Object Lifecycles, Object Workflows, Document Handling along with Document Lifecycles and Document Workflows, Reports, Dashboards, DAC Configuration, Security Configuration, Jobs, File Staging\n&bull;\tExperience in data activities via Loader, APIs, vault refresh and domain admin activities","link":"https://www.upwork.com/jobs/Veeva-Configuration-Specialist_%7E0184e6df28b70ffd14?source=rss","processedDate":"2024-03-19T08:47:34.403Z","postedDate":"<b>Posted On</b>: March 03, 2024 03:54 UTC","id":"0184e6df28b70ffd14"},{"skillset":["Linux System Administration","System Administration","Network Administration","Linux","VPN","Network Security","OpenVPN"],"title":"Hide/mask the IP of dedicated server using OVPN Public IPv4 or VPS (Route traffic through it) - Upwork","description":"**Please read this before applying**\n- If you apply using ChatGPT template, you will be ignored. \nI am looking for someone who has done this in the past. We will discuss my requirements and decide the best solution for my case.&nbsp;&nbsp;I will explain my use-case to you in better detail.\nI need someone to configure my dedicated server to route traffic through OVPN.com (IPV4) or through a VPS. The goal is to hide my server&#039;s IP/location.\nLet me know if you are up for the task and we will discuss the details.<b>Skills</b>:        Linux System Administration,                     System Administration,                     Network Administration,                     Linux,                     VPN,                     Network Security,                     OpenVPN            ","link":"https://www.upwork.com/jobs/Hide-mask-the-dedicated-server-using-OVPN-Public-IPv4-VPS-Route-traffic-through_%7E01ead2a8abcf9f7928?source=rss","processedDate":"2024-03-19T08:47:34.403Z","postedDate":"<b>Posted On</b>: March 02, 2024 21:14 UTC","id":"01ead2a8abcf9f7928"},{"skillset":["Linux","DigitalOcean","Linux System Administration","Ubuntu","Docker","Docker Compose"],"title":"Migrate Phabricator from Digital Ocean to Hetzner - Upwork","description":"Hi, \nI have a digital ocean droplet in which I had deployed a phabricator instance using a bitnami docker. I have used this for some years. \nThis was setup by docker compose. \nNow I have a managed hetzner server (with konsole and SSH access) and I want to migrate phabricator to this. \nAs far as I know managed servers do not have docker. <b>Skills</b>:        Linux,                     DigitalOcean,                     Linux System Administration,                     Ubuntu,                     Docker,                     Docker Compose            ","link":"https://www.upwork.com/jobs/Migrate-Phabricator-from-Digital-Ocean-Hetzner_%7E015af2be7b5c126184?source=rss","processedDate":"2024-03-19T08:47:34.403Z","postedDate":"<b>Posted On</b>: March 01, 2024 22:32 UTC","id":"015af2be7b5c126184"},{"skillset":["DevOps Engineering","Ubuntu","CentOS","SMTP","Postfix SMTP Server"],"title":"Автоматизировать создание и добавление доменов на сервере с ISP Manager'ом - Upwork","description":"Необходимо автоматизировать создание сайта на сервере, получения всех необходимых сертификатов SSL, создание почтового домена и всех необходимых записей для этого домена (SPF, DMARC) и создание почтовых ящиков для этого домена.<b>Skills</b>:        DevOps Engineering,                     Ubuntu,                     CentOS,                     SMTP,                     Postfix SMTP Server            ","link":"https://www.upwork.com/jobs/ISP-Manager_%7E01d930c613e913c3a2?source=rss","processedDate":"2024-03-19T08:47:34.403Z","postedDate":"<b>Posted On</b>: March 01, 2024 22:12 UTC","id":"01d930c613e913c3a2"},{"skillset":["System Administration","SuiteCRM","CRM Software","Debian"],"title":"Suite CRM crontab issue - Upwork","description":"Please read the problem carefully \nWhat is the Problem?\nThe problem involves SuiteCRM cron jobs on a Debian 11 server not completing and instead running endlessly. This issue is affecting three independent SuiteCRM instances simultaneously, indicating a systemic or configuration problem rather than an issue isolated to a single SuiteCRM instance.\nWhere is the Problem?\nThe problem appears to be at the intersection of the Debian server environment (post-update) and the SuiteCRM scheduler/cron job configuration. Given that the issue manifested simultaneously across all instances following a Debian update, it suggests the root cause is related to changes or disruptions caused by the update process, potentially at the system level affecting cron job execution.\nWhat Has Been Tried So Far That Didn&#039;t Work?\nManual Execution of Cron Jobs: Attempting to manually execute cron jobs to bypass the issue, which did not resolve the endless running state.\nDatabase Operations: Truncating queued and archived jobs in the SuiteCRM databases, which did not affect the problem.\nServer and Cron Daemon Manipulations: Actions such as killing the process associated with /run/crond.pid, rebooting the server, and attempting to delete and recreate the crond.pid file, all of which failed to resolve the issue.\nPermutations and Combinations Already Tried:\nSuiteCRM Version Update: Updating all instances from version 7.12.11 in an attempt to solve the problem, which did not affect the outcome.\nCron Configuration and Execution Review: Checking the Scheduler logs, manually running cron jobs, and reviewing the cron configurations for each SuiteCRM user.\nSystem Update and Recovery Efforts: Attempting to recover from an interrupted Debian update, including managing locked processes and reviewing the impact of security patches.\nServer Restart and Daemon Reset: Restarting the server and attempting to reset the cron daemon by manipulating the crond.pid file.\nsuccessful person will get more work<b>Skills</b>:        System Administration,                     SuiteCRM,                     CRM Software,                     Debian            ","link":"https://www.upwork.com/jobs/Suite-CRM-crontab-issue_%7E0141da548dd03f6cfe?source=rss","processedDate":"2024-03-19T08:47:34.403Z","postedDate":"<b>Posted On</b>: March 01, 2024 13:16 UTC","id":"0141da548dd03f6cfe"},{"skillset":["DNS","Grandstream","Fortinet","Cisco ASA","Network Security","Network Monitoring","Palo Alto Firewalls","Firewall","Wireless Network Implementation","VPN","Cisco Certified Network Professional","PfSense","Ubiquiti","Cisco Router","Cisco IOS"],"title":"Need help creating rules/routes on either UDM SE, or Unifi USP Edge Router - Upwork","description":"Hello! we are essentially trying to create a DMZ on a Ubiquiti Dream Machine SE. The Unifi solution doesn&#039;t currently offer a &amp;quot;DMZ&amp;quot; option and so we need to manually configure the rules and a VLAN to make sure that traffic on the VLAN goes out its WAN interface IP and not the WAN interface IP of the USM-SE. We currently have a fiber internet connection and need to setup the firewall. There is a /30 P2P that is configured on the WAN 1 interface of the firewall, there is internet connectivity. We are having difficulty using the /29 block of useable IP addresses. Do you have experience with this and will you be able to assist? Please let me know at your earliest convenience.<b>Skills</b>:        DNS,                     Grandstream,                     Fortinet,                     Cisco ASA,                     Network Security,                     Network Monitoring,                     Palo Alto Firewalls,                     Firewall,                     Wireless Network Implementation,                     VPN,                     Cisco Certified Network Professional,                     PfSense,                     Ubiquiti,                     Cisco Router,                     Cisco IOS            ","link":"https://www.upwork.com/jobs/Need-help-creating-rules-routes-either-UDM-Unifi-USP-Edge-Router_%7E01f9a86d7867a65b9c?source=rss","processedDate":"2024-03-19T08:47:34.403Z","postedDate":"<b>Posted On</b>: February 29, 2024 23:16 UTC","id":"01f9a86d7867a65b9c"},{"skillset":["3CX","VoIP","SMS"],"title":"3CX VoipInnovations SMS - Upwork","description":"I am using VoipInnovations as my Voip Provider on my 3CX Server. I can get calls to work but SMS is not working.\nFailed to send message(s) to the provider &#039;generic&#039; from &#039;+1XXXXXXXXXX&#039; to &#039;+1XXXXXXXXXX&#039;. \nServer was unable to process request. ---&amp;amp;gt; System.Xml.XmlException: Data at the root level is invalid. Line 1, position 1. at System.Xml.XmlTextReaderImpl.Throw<b>Skills</b>:        3CX,                     VoIP,                     SMS            ","link":"https://www.upwork.com/jobs/3CX-VoipInnovations-SMS_%7E01dd1db8ba10329b15?source=rss","processedDate":"2024-03-19T08:47:34.403Z","postedDate":"<b>Posted On</b>: February 29, 2024 18:21 UTC","id":"01dd1db8ba10329b15"},{"skillset":["Linux","Iptables","Linux System Administration"],"title":"Best approach for per user bandwidth management in Linux using tc/iptables - Upwork","description":"I am having a Gateway device based on OpenWRT. Currently there is a need to enforce bandwidth restriction of per device/user basis.\nThe common tool to do the same in Linux is tc(traffic control) along with some iptables rules.\nNow, for this approach I am currently using HTB classes along with fq_codel as qdisc and applying tc filter to enforce the specific class.\nNow , in theory this works fine, but my concern is , is it scalable for say , 4k - 5k users . Idealy for HTB, they say you can create uptill 70k classes but is it advisable and what impact it creates as far as performance is concerned.\nThe main question is, is there any better way ?<b>Skills</b>:        Linux,                     Iptables,                     Linux System Administration            ","link":"https://www.upwork.com/jobs/Best-approach-for-per-user-bandwidth-management-Linux-using-iptables_%7E01a8d89c3cb95d8f49?source=rss","processedDate":"2024-03-19T08:47:34.403Z","postedDate":"<b>Posted On</b>: February 29, 2024 11:32 UTC","id":"01a8d89c3cb95d8f49"},{"skillset":["Ethical Hacking","Data Recovery","Facebook","Instagram","Twitter/X","Snapchat"],"title":"Tech support - Upwork","description":"I have issues with my iCloud. I need someone able to help me log in to my iCloud.<b>Skills</b>:        Ethical Hacking,                     Data Recovery,                     Facebook,                     Instagram,                     Twitter/X,                     Snapchat            ","link":"https://www.upwork.com/jobs/Tech-support_%7E0186201ac0106954b5?source=rss","processedDate":"2024-03-19T08:47:34.403Z","postedDate":"<b>Posted On</b>: February 28, 2024 15:46 UTC","id":"0186201ac0106954b5"},{"skillset":["Zabbix"],"title":"Further develop zabbix setup and reporting - Upwork","description":"For further development of our Zabbix setup, we are looking for a Zabbix expert who is experienced with Zabbix 6.0.\nThe assignment consists of several aspects that must all be realized for successful completion. These aspects are as follows:\n- Checking the current setup. Are there any deficiencies here? Are there any improvements to be discovered?\n- Setting up dashboarding including forwarding reports to other environments (teams, outlook, TOPdesk, etc.).\n- Questions from our Zabbix expert regarding the setup of CMS.\n- Automatic reporting based on setup and desired KPI set.<b>Skills</b>:        Zabbix            ","link":"https://www.upwork.com/jobs/Further-develop-zabbix-setup-and-reporting_%7E018a4525cd0fdbbe5a?source=rss","processedDate":"2024-03-19T08:47:34.403Z","postedDate":"<b>Posted On</b>: February 28, 2024 14:48 UTC","id":"018a4525cd0fdbbe5a"},{"skillset":["Virtualization","Zabbix","Docker","Network Administration","Cloud Computing","Storage Area Network","Unix Shell","Proxmox VE","Linux System Administration","DevOps"],"title":"Proxmox PvE cluster setup with VLAN, Ceph and securety - Upwork","description":"I need a cluster architect with the ability to also teach the basics in a live session.<b>Skills</b>:        Virtualization,                     Zabbix,                     Docker,                     Network Administration,                     Cloud Computing,                     Storage Area Network,                     Unix Shell,                     Proxmox VE,                     Linux System Administration,                     DevOps            ","link":"https://www.upwork.com/jobs/Proxmox-PvE-cluster-setup-with-VLAN-Ceph-and-securety_%7E016d9965df59c38c03?source=rss","processedDate":"2024-03-19T08:47:34.403Z","postedDate":"<b>Posted On</b>: February 28, 2024 08:41 UTC","id":"016d9965df59c38c03"},{"skillset":["Network Administration","Linux System Administration","Network Security","DevOps"],"title":"443 port error  - Upwork","description":"We recently changed the server, and the DNS records of the domain have changed accordingly.\nIt&#039;s been 2 weeks.\nAll providers have changed dns to the new one , except one\nUsers who use this provider get our old server, and they faced this error: &amp;quot;java.net.ConnectException: Failed to connect to 09soft.kz/165.22.13.172:443 &amp;quot;. because of ip is old.\nhow can we temporarily solve this problem while the provider is updating the dns.\nperhaps we will redirect the requests? or should we add ssl again?<b>Skills</b>:        Network Administration,                     Linux System Administration,                     Network Security,                     DevOps            ","link":"https://www.upwork.com/jobs/443-port-error_%7E01664dbf94b159f1e5?source=rss","processedDate":"2024-03-19T08:47:34.403Z","postedDate":"<b>Posted On</b>: February 28, 2024 05:25 UTC","id":"01664dbf94b159f1e5"},{"skillset":["Backup","Data Backup","Data Migration","Data Recovery","Recover Data Recovery Software"],"title":"Synology Expert - Upwork","description":"Need someone to restore a WIndows Backup of a VM that we have placed on a Synology device<b>Skills</b>:        Backup,                     Data Backup,                     Data Migration,                     Data Recovery,                     Recover Data Recovery Software            ","link":"https://www.upwork.com/jobs/Synology-Expert_%7E016bd3e45811474cde?source=rss","processedDate":"2024-03-19T08:47:34.403Z","postedDate":"<b>Posted On</b>: February 28, 2024 04:51 UTC","id":"016bd3e45811474cde"},{"skillset":["VPN"],"title":"Setup of VPNs - Upwork","description":"We are looking for somebody to help us setup VPN connections within docker to external VPN servers. External server use different VPN solutions (IPSEC, Site-to-site). <b>Skills</b>:        VPN            ","link":"https://www.upwork.com/jobs/Setup-VPNs_%7E01df6e3d6d218be445?source=rss","processedDate":"2024-03-19T08:47:34.404Z","postedDate":"<b>Posted On</b>: February 27, 2024 21:33 UTC","id":"01df6e3d6d218be445"},{"skillset":["Iptables","Network Administration","Linux System Administration"],"title":"Setup Wireguard VPN between 2 VPS manual - Upwork","description":"I need step-by-step manual for setup Wireguard VPN between two Debian Linux VPS with killswitch on client and except rules for client VPS SSH server(it must works after client vps connect&#039;s to vpn server).<b>Skills</b>:        Iptables,                     Network Administration,                     Linux System Administration            ","link":"https://www.upwork.com/jobs/Setup-Wireguard-VPN-between-VPS-manual_%7E01dc736bbf991c8897?source=rss","processedDate":"2024-03-19T08:47:34.404Z","postedDate":"<b>Posted On</b>: February 27, 2024 18:33 UTC","id":"01dc736bbf991c8897"},{"skillset":["VMware Administration","VMWare"],"title":"Windows 2022 Core Esxi Server Automation - Upwork","description":"I am in need of an expert capable of building a Windows Server 2022 Core on an Esxi server, using a template and automation to provide hostname, IP, and addition to the domain.\nProject Requirements:\n- Set up Windows Server 2022 Core on Esxi server using a provided template.\n- Utilize Powershell scripting to automate the process of giving hostname and IP.\n- Add the server to a domain using Active Directory Domain Services (AD DS).\nPreferably, I am in search of a freelancer with strong technical experience, particularly in server management, windows server environments, automation and domain services. Quality work and clear communication are highly appreciated.<b>Skills</b>:        VMware Administration,                     VMWare            ","link":"https://www.upwork.com/jobs/Windows-2022-Core-Esxi-Server-Automation_%7E019b667e8403e27a22?source=rss","processedDate":"2024-03-19T08:47:34.404Z","postedDate":"<b>Posted On</b>: February 27, 2024 16:37 UTC","id":"019b667e8403e27a22"},{"skillset":["Fortinet","FortiGate Firewall"],"title":"Fortinet FortiManager Implementation on existing network - Upwork","description":"FortiManager implementation to more than 20 branches\nHO using 400F\nbranches mixed 40F and 60F<b>Skills</b>:        Fortinet,                     FortiGate Firewall            ","link":"https://www.upwork.com/jobs/Fortinet-FortiManager-Implementation-existing-network_%7E0193f3b5898ef395a9?source=rss","processedDate":"2024-03-19T08:47:34.404Z","postedDate":"<b>Posted On</b>: February 27, 2024 14:07 UTC","id":"0193f3b5898ef395a9"}]