[{"skillset":["API"],"title":"API Calls For Social Media Analytics - Upwork","description":"API Calls For Social Media Analytics\nProject: Developing a social media dashboard to review key Metrics from various social platforms.\nObjectives:\n1 - Connect api&rsquo;s from social platforms, Facebook, Instagram, Twitter, YouTube, Vimeo, Tik Tok, using app id and keys to pull key Metrics.\n2 - Provide a json response with key Metrics based on date range and platform(s). \n3 - Include a step by step document with screenshots for how a &rdquo;user&rdquo; would create or get each platforms app id and secret key.\nFor more information on metrics see the below document:\nhttps://docs.google.com/document/d/1wb6qZQTa4aaSSs0UKqvUIIIoiNjgDiVtuvxNCLGCFD8/edit?usp=sharing<b>Skills</b>:        API            ","link":"https://www.upwork.com/jobs/API-Calls-For-Social-Media-Analytics_%7E01c8d7980ed9fe0405?source=rss","processedDate":"2024-03-18T20:19:26.515Z","postedDate":"<b>Posted On</b>: March 18, 2024 17:12 UTC","id":"01c8d7980ed9fe0405"},{"skillset":["MEP Design","Autodesk AutoCAD","Mechanical Design"],"title":"MEP - Generate BoQ for LPG, Diesel and Compressed air for a hotel from drawings - Upwork","description":"Generate BoQ (excel format) for MEP:\n1. LPG supply \n2. Diesel supply\n3. Compressed air supply\nThese are building services for a hotel.\nCAD drawings will be provided.<b>Skills</b>:        MEP Design,                     Autodesk AutoCAD,                     Mechanical Design            ","link":"https://www.upwork.com/jobs/MEP-Generate-BoQ-for-LPG-Diesel-and-Compressed-air-for-hotel-from-drawings_%7E018f430d7725a6b5a9?source=rss","processedDate":"2024-03-18T20:19:26.515Z","postedDate":"<b>Posted On</b>: March 18, 2024 15:02 UTC","id":"018f430d7725a6b5a9"},{"skillset":["Smartphone","Tablet","Hybrid App Development","Bluetooth","User Profile Creation","Android","iOS","Mobile App Development","iOS Development","Android App Development"],"title":"iOS/Android Chronograph application - Upwork","description":"Hello everyone,\nWe are looking to develop a Shooting Chronograph application which connects to a physical Chronograph unit via BT and can send and receive data (comms protocol attached).\nSome key features:\n- Cloud DB\n- User registration\n- Link to 3rd party devices on cloud (to rear/write data)\n- Remote activation of a Chronograph unit via BT\n- Send, receive and display data\n- Record some external data into the app sessions such as baro levels, temperatures, GPS location etc\n- User entered data fields\n- Provide various reports based on the CHronograph reading and user data.\n- Share/Store data on Cloud and export via various means (XLS/CSV and others)\nThe app should run in a shell based (browser) environment on both iOS and Android for easier maintenance. \nThe above is a short summary of the requirements - additional details/SOW will be provided at later state.\nCompletion approx. date - end of Q2 2024.\nDevelopers must be able to clearly communicate in English and be available on Skype.\nEuropean dev team is preferred. <b>Skills</b>:        Smartphone,                     Tablet,                     Hybrid App Development,                     Bluetooth,                     User Profile Creation,                     Android,                     iOS,                     Mobile App Development,                     iOS Development,                     Android App Development            ","link":"https://www.upwork.com/jobs/iOS-Android-Chronograph-application_%7E01e1a1467358357add?source=rss","processedDate":"2024-03-18T20:19:26.515Z","postedDate":"<b>Posted On</b>: March 18, 2024 12:03 UTC","id":"01e1a1467358357add"},{"skillset":["Cybersecurity Tool"],"title":"Install qRadar Community Edition - Upwork","description":"Fairly straightforward task as the job title suggests. I need IBM qRadar Community Edition installed, the file has already been downloaded. As the official IBM channel on youtube shows, the community edition installation takes just a few minutes, but I need to make sure it&#039;s done properly and log sources from a personal PC are setup. Fairly basic stuff<b>Skills</b>:        Cybersecurity Tool            ","link":"https://www.upwork.com/jobs/Install-qRadar-Community-Edition_%7E01b81b1db82e44b3c3?source=rss","processedDate":"2024-03-18T20:19:26.515Z","postedDate":"<b>Posted On</b>: March 18, 2024 00:56 UTC","id":"01b81b1db82e44b3c3"},{"skillset":["Chatbot Development","Natural Language Generation","Natural Language Processing","Natural Language Understanding","Speech Synthesis","Game Design","Unreal Engine","Prototyping","Unity","Game Development","Animation","C++","Illustration","Graphic Design","Python","C#","Mobile Game"],"title":"Unity Game Engine /  With interactive Avatar (Q&amp;A) / AI Chat bot ability  - Upwork","description":"We&rsquo;re in need of someone who can help create our AI / Chat Bot &amp;amp; AI Avatar using our materials such as our digital book.\nTurning this Avatar to have the ability to read to users and allow users to ask it questions based on the book / content provided.\nPosition Overview: We are seeking an AI Platform Engineer to join our dynamic team. As an engineer, you&rsquo;ll play a pivotal role in elevating our AI bot&rsquo;s capabilities, enhancing its performance, and driving innovation.\nWe welcome applications from individuals, freelancers committed to excellence. Submit your portfolio and application through Upwork. Only candidates meeting our stringent criteria will receive a response. <b>Skills</b>:        Chatbot Development,                     Natural Language Generation,                     Natural Language Processing,                     Natural Language Understanding,                     Speech Synthesis,                     Game Design,                     Unreal Engine,                     Prototyping,                     Unity,                     Game Development,                     Animation,                     C++,                     Illustration,                     Graphic Design,                     Python,                     C#,                     Mobile Game            ","link":"https://www.upwork.com/jobs/Unity-Game-Engine-With-interactive-Avatar-amp-Chat-bot-ability_%7E013b9c342dc4cba3b2?source=rss","processedDate":"2024-03-18T20:19:26.515Z","postedDate":"<b>Posted On</b>: March 17, 2024 21:47 UTC","id":"013b9c342dc4cba3b2"},{"skillset":["Data Entry","Critical Thinking Skills","Company Research","Topic Research","Data Collection"],"title":"Opportunity for new freelancer. Research Project - Upwork","description":"Bid for 200 entries - watch the video and include your price for 200 entries at begining of your cover later. Otherwise will be ignored.\nhttps://share.vidyard.com/watch/2srDy5KrEbUB9Zcri3Q12U?<b>Skills</b>:        Data Entry,                     Critical Thinking Skills,                     Company Research,                     Topic Research,                     Data Collection            ","link":"https://www.upwork.com/jobs/Opportunity-for-new-freelancer-Research-Project_%7E0190047b3943ed7cd8?source=rss","processedDate":"2024-03-18T20:19:26.516Z","postedDate":"<b>Posted On</b>: March 17, 2024 10:20 UTC","id":"0190047b3943ed7cd8"},{"skillset":["UGC","Product Demonstration","Unboxing Video","Product Review","Demo Presentation","Demo Video"],"title":"Product Reviewer UGC -  Create Short Review Videos (Demonstrate Amazon Items)  - Upwork","description":"Can you present product reviews of items that you have at home? If you can explain functions and features and answer potential questions a purchaser may have., then this could be for you. \nJust say why you bought the items and how it helped you. With a friendly an honest approach. \nâœ… The items can be around your home or at family or friends&#039; homes. They just need to be for sale on Amazon.com, and you need to be familiar with them\nâœ… The video is to be in two parts (1.) Demo the product&nbsp;&nbsp;(2.1) The product after X years or uses or (2.2) Answering common questions (see product Q and A or written reviews) \nâœ… Video length&nbsp;&nbsp;(1.) 40 seconds to 180 seconds and (2.1/2.2) 40 seconds to 180 seconds (this can be in one take or two - 1 file or 2)\nâœ… You can show your face or demo the product (the best videos show a face). These videos will appear alongside products on Amazon and help purchasers decide whether an item is the right choice for them and placed possibly other social media platforms\nâœ… Potential free items in the future - for the right candidate there is a chance of the added bonus of receiving products for free to review\nðŸŸ¢ For each video, $20 will be paid\nðŸŸ¢ No editing required - just a natural honest User Generated Content \nðŸŸ¢ See if there are video reviews on a product (not all have a video carousel) \nðŸŽ¥ If you&#039;ve already made a product review video or similar UGC, send me a file or link so I can see you in action! I look forward to seeing it. <b>Skills</b>:        UGC,                     Product Demonstration,                     Unboxing Video,                     Product Review,                     Demo Presentation,                     Demo Video            ","link":"https://www.upwork.com/jobs/Product-Reviewer-UGC-Create-Short-Review-Videos-Demonstrate-Amazon-Items_%7E012a9bb26c2d6b3229?source=rss","processedDate":"2024-03-18T20:19:26.516Z","postedDate":"<b>Posted On</b>: March 16, 2024 13:18 UTC","id":"012a9bb26c2d6b3229"},{"skillset":["Mechanical Design"],"title":"Check the pump's Q and H in a firefighting project and the  diameter of the main pipe   - Upwork","description":"I have a project of 19 residential building blocks and two service buildings (light hazard). The building blocks have car parking in their basements.\nWe have a tank with a 150-cubic-meter volume and a pump station to serve these buildings. \nWe already have the design, but we want to double-check the Q (discharge) and H (head) of the pump and the diameter of the main pipe that connects the buildings to the pump station. \nMore details about the design and the required dimensions will be provided after hiring.&nbsp;&nbsp;<b>Skills</b>:        Mechanical Design            ","link":"https://www.upwork.com/jobs/Check-the-pump-and-firefighting-project-and-the-diameter-the-main-pipe_%7E01ebe8d73d583b038a?source=rss","processedDate":"2024-03-18T20:19:26.516Z","postedDate":"<b>Posted On</b>: March 16, 2024 13:09 UTC","id":"01ebe8d73d583b038a"},{"skillset":["Chatbot Development","Python","LangChain"],"title":"Improve Pipeline Retrieval Docs For LLM - Upwork","description":"We are looking for someone who improves the retrieval of documents from vector DB or Improves the whole pipeline of RAG. \nI have 1 PDF containing 30 pages with lots of data. Now if i want Q/A to explain any 1 topic in full depth.&nbsp;&nbsp;\nI want complete control over the context that goes into the LLM.\nLet&#039;s say there is a chapter about Democracy and under that, there is 10 topics. So for each topic i want in-depth explanation from LLM using the context from the pdf <b>Skills</b>:        Chatbot Development,                     Python,                     LangChain            ","link":"https://www.upwork.com/jobs/Improve-Pipeline-Retrieval-Docs-For-LLM_%7E01f81bc8b6d088fe67?source=rss","processedDate":"2024-03-18T20:19:26.516Z","postedDate":"<b>Posted On</b>: March 16, 2024 11:35 UTC","id":"01f81bc8b6d088fe67"},{"skillset":["System Administration","System Configuration","Zendesk","Administrative Support"],"title":"Zendesk Implementation: Requirement Mapping, Implementation, Setup Support - Upwork","description":"We are an Australian telehealth business established in mid 2023. We launched in Q4 2023, and have seen rapid growth both in interest (leads) and active users.\nUntil now, we have managed all lead/ users through a mix of emails (gmail), phone (simple mobile line) and chat (wix widget), but we are getting to a point where this is becoming more unmanageable.\nWe want to implement Zendesk to centralise all communications to drive efficiency and improve experience\nWe are looking for a partner who can:\n1. work with us on defining the requirements\n2. successfully implement zendesk\n3. deliver a training workshop to our team\n4. oversee migration to zendesk from our other tools &amp;amp; ensure successful rollout\nWe are looking for someone who can work on this project beginning early April, with a view to completing it over a 2 - 2.5 week period. Please see attached briefing document for more information, and feel free to ask questions on the brief.\nThere may be scope for follow-on work from this project<b>Skills</b>:        System Administration,                     System Configuration,                     Zendesk,                     Administrative Support            ","link":"https://www.upwork.com/jobs/Zendesk-Implementation-Requirement-Mapping-Implementation-Setup-Support_%7E017c6b2f21f13af4b4?source=rss","processedDate":"2024-03-18T20:19:26.516Z","postedDate":"<b>Posted On</b>: March 16, 2024 10:11 UTC","id":"017c6b2f21f13af4b4"},{"skillset":["3D Rendering"],"title":"Mini Project for Product Rendering Main Project - Upwork","description":"Product rendering animation project:\nWe&#039;d like the Q-Pad to be floating and slightly curved to show user position, then show the saturation, then checkmark and sound when saturation hits the green oval. Then show the Q-Strip coming out with saturation on the Q-Strip cotton pads...similar to the last screen in the video.<b>Skills</b>:        3D Rendering            ","link":"https://www.upwork.com/jobs/Mini-Project-for-Product-Rendering-Main-Project_%7E01331c656e18d815e6?source=rss","processedDate":"2024-03-18T20:19:26.516Z","postedDate":"<b>Posted On</b>: March 15, 2024 21:20 UTC","id":"01331c656e18d815e6"},{"skillset":["React Native","iOS","App Store"],"title":"Expert iOS Developer and Consultant for App Store Submission and AWS Notifications System - Upwork","description":"Project Description:\nWe are seeking an experienced iOS Developer and Consultant to provide hourly consulting services for the development of an iOS mobile app and its submission to the App Store. The ideal candidate will possess a strong background in iOS app development, including front-end architecture, real-time notifications systems, and extensive experience in navigating the App Store approval process.\nResponsibilities:\nConsulting on iOS App Development: Provide expert guidance on iOS app development, focusing on front-end architecture and best practices to ensure a smooth user experience and efficient performance.\nApp Store Submission Guidance: Assist in preparing the app for submission to the App Store, including a final quality assurance (Q/A) review to ensure compliance with Apple App Store guidelines. Identify and suggest solutions for any potential issues critical for App Store approval.\nNotifications System Architecture: Help design and implement a notifications system using AWS Pinpoint or other AWS services, integrating it seamlessly with other components of our system to support real-time notifications.\nExperience and Skills Required:\nProven iOS App Development: Extensive experience in developing iOS apps, with a strong understanding of front-end architecture, design patterns, and best practices.\nExpertise in Real-Time Notifications: Demonstrated experience in designing and implementing real-time notifications systems, preferably with AWS services like AWS Pinpoint.\nApp Store Approval Process: Significant experience in successfully navigating the App Store approval process, with a track record of getting apps approved without major issues.\nConsulting Skills: Excellent communication and consulting skills, with the ability to provide clear, actionable advice and work collaboratively with our team.\nProblem-Solving: Strong analytical and problem-solving skills, with a proactive approach to identifying and resolving potential issues before submission to the App Store.\nHow to Apply:\nPlease submit your application including:\nA brief introduction about yourself and your experience in iOS app development.\nExamples of previous iOS apps you&#039;ve developed or contributed to, especially those that involved real-time notifications and successful App Store submissions.\nYour approach to ensuring an app complies with App Store guidelines and your experience with AWS Pinpoint or similar services.\nYour availability and preferred hourly rate.\nApplications without the above information may not be considered. We&#039;re looking forward to collaborating with a seasoned iOS Developer and Consultant who can help bring our app to the next level and ensure a successful launch on the App Store.<b>Skills</b>:        React Native,                     iOS,                     App Store            ","link":"https://www.upwork.com/jobs/Expert-iOS-Developer-and-Consultant-for-App-Store-Submission-and-AWS-Notifications-System_%7E01718c21713a066eb5?source=rss","processedDate":"2024-03-18T20:19:26.516Z","postedDate":"<b>Posted On</b>: March 15, 2024 17:52 UTC","id":"01718c21713a066eb5"},{"skillset":["Marketing Management","Project Management","Social Media Management","Social Media Content","Paid Media","Paid Social","Digital Marketing Management","Social Media Advertising","Content Creation","Facebook Ad Campaign","Digital Marketing","Content Writing","Community Management","Digital Media","Copywriting"],"title":"Marketing Assistant - Strategy &amp; Social Media - Upwork","description":"The Marketing Assistant will play a key role in implementing marketing strategies to increase our Instagram followers, engage our audience, find potential customers for collaborations and affiliate marketing opportunities. This position requires creativity, a keen understanding of current social media trends, and the ability to analyze market data to drive engagement and growth. \nHere are the tasks for the role:\n1. **Strategic Content Creation:** Develop a content calendar integrating varied content types (posts, stories, reels, IGTV) aligned with trending topics, seasonal themes, and brand messaging. Incorporate user-generated content and behind-the-scenes glimpses to foster community and authenticity.\n2. **Data-Driven Insights:** Regularly analyze Instagram Insights to track follower growth, engagement rates, and campaign performance. Use this data to refine content strategy, posting time, and audience targeting for optimized outreach and engagement.\n3. **Engagement and Community Building:** Actively engage with followers by responding to comments, direct messages, and mentions in a timely manner. Conduct polls, Q&amp;amp;A sessions, and contests to boost interaction and gather audience insights.\n4. **Hashtag Strategy:** Research and utilize a mix of trending, niche-specific, and branded hashtags to increase content visibility and attract relevant followers. Regularly update the hashtag strategy based on performance analytics.\n5. **Influencer and Partner Outreach:** Identify and initiate collaborations with influencers and brands that align with the company&rsquo;s values and audience interests. Manage the entire workflow of partnership, from outreach to campaign execution and evaluation.\n6. **Affiliate Marketing Program Support:** Assist in the development and optimization of the affiliate marketing program. Provide affiliates with necessary resources and monitor affiliate performance to ensure mutual benefits and growth.\n7. **Visual Consistency and Branding:** Ensure that all Instagram content reflects the brand&rsquo;s visual identity and tone of voice consistently. Use a curated color palette, consistent filters, and branding elements to create a cohesive and recognizable feed.\n8. **User-Generated Content (UGC) Amplification:** Encourage and curate UGC to showcase real-life applications of products or services, enhancing credibility and engagement. Implement hashtags or campaigns specifically for UGC collection and sharing.\n9. **Continuous Learning and Adaptation:** Stay abreast of Instagram platform updates, emerging social media trends, and best practices. Proactively suggest and implement innovative strategies or tools to maintain a competitive edge.\n10. **Reporting and Optimization:** Prepare monthly reports detailing key metrics, insights gained, and action plans for continuous improvement. Include competitor performance benchmarks and recommendations for strategic adjustments.<b>Skills</b>:        Marketing Management,                     Project Management,                     Social Media Management,                     Social Media Content,                     Paid Media,                     Paid Social,                     Digital Marketing Management,                     Social Media Advertising,                     Content Creation,                     Facebook Ad Campaign,                     Digital Marketing,                     Content Writing,                     Community Management,                     Digital Media,                     Copywriting            ","link":"https://www.upwork.com/jobs/Marketing-Assistant-Strategy-amp-Social-Media_%7E013eadbfe5e89f366b?source=rss","processedDate":"2024-03-18T20:19:26.516Z","postedDate":"<b>Posted On</b>: March 15, 2024 16:22 UTC","id":"013eadbfe5e89f366b"},{"skillset":["Interior Design","3D Rendering","SketchUp","3D Modeling","3D Design","Autodesk AutoCAD"],"title":"Interior Designer for Open Space Project - Upwork","description":"Looking for an interior designer experienced in Japanese, Scandinavian, Minimalism, and wabi-sabi styles to assist with concept development and create 3D models/renderings for an open space project.\nBudget: $35 (Fixed, non-negotiable)\nIf interested, please submit your proposal with relevant portfolio samples. \nThank you!<b>Skills</b>:        Interior Design,                     3D Rendering,                     SketchUp,                     3D Modeling,                     3D Design,                     Autodesk AutoCAD            ","link":"https://www.upwork.com/jobs/Interior-Designer-for-Open-Space-Project_%7E01dd3865e3afa33f50?source=rss","processedDate":"2024-03-18T20:19:26.516Z","postedDate":"<b>Posted On</b>: March 15, 2024 16:14 UTC","id":"01dd3865e3afa33f50"},{"skillset":["Microsoft Project","German to Hungarian Translation","memoQ","English to Hungarian Translation","Office 365","Business Consulting","Company Research","Business Valuation","Lead Generation","Hungarian to English Translation","Market Research","Real Estate Investment Assistance"],"title":"Occupational Health Services Contract Valuation - Upwork","description":"I am starting an occupational health service company. I will be providing occupational health services (mandatory worker check ups) as well as 24/7 emergency care services (via an EMT or paramedic, or similar) for a subcontracting construction company. The patients are going to be guest workers that do not speak Hungarian or English, only their own language.\nI need your help finding the market value for the contract. There will approximately be 4000 workers working for the construction company. The construction companies currently do not have proper occupational health service, and zero 24/7 care. We will be the only provider in town who can support workers that speak their language, i.e. nobody else has bilingual services in the area.\nWe already have the office set up, and it&#039;s very close to where the construction is taking place, and where the workers are staying. \nGiven this information, I need your help coming up with a contract value that I can offer to the company, for their whole workforce with option to extend, for a duration of 1 year. Please help me come up with a range of values that reflect the market, so that I can adjust for the profit margin.<b>Skills</b>:        Microsoft Project,                     German to Hungarian Translation,                     memoQ,                     English to Hungarian Translation,                     Office 365,                     Business Consulting,                     Company Research,                     Business Valuation,                     Lead Generation,                     Hungarian to English Translation,                     Market Research,                     Real Estate Investment Assistance            ","link":"https://www.upwork.com/jobs/Occupational-Health-Services-Contract-Valuation_%7E0136f1a02930888e28?source=rss","processedDate":"2024-03-18T20:19:26.516Z","postedDate":"<b>Posted On</b>: March 15, 2024 14:45 UTC","id":"0136f1a02930888e28"},{"skillset":["Software QA","Functional Testing","Software Testing","Web Testing","Automated Testing"],"title":"Quality Assurance Engineer for Software Testing - Upwork","description":"**Title:** Seeking Experienced Quality Assurance Engineer for Comprehensive Software Testing\n**Job Description:**\nWe are looking for a highly skilled and experienced Quality Assurance (QA) Engineer to join our software development team. The ideal candidate will have a keen eye for detail and a passion for ensuring that software products meet or exceed our quality standards. This role involves designing and implementing tests, debugging, and defining corrective actions. You will also review system requirements and track quality assurance metrics (e.g., defect densities and open defect counts.)\n**Responsibilities:**\n- Review and analyze system specifications to ensure clarity and understandability.\n- Collaborate with the development team to develop effective strategies and test plans.\n- Execute test cases (manual or automated) and analyze results.\n- Evaluate product code according to specifications.\n- Create logs to document testing phases and defects.\n- Report bugs and errors to development teams.\n- Help troubleshoot issues and conduct post-release/ post-implementation testing.\n- Work with cross-functional teams to ensure quality throughout the software development lifecycle.\n**Requirements:**\n- Proven experience as a Quality Assurance Engineer or similar role.\n- Experience in QA methodology and tools.\n- Ability to document and troubleshoot errors.\n- Working knowledge of test management software (e.g., qTest, Zephyr) and SQL.\n- Excellent communication skills.\n- Attention to detail.\n- Analytical mind and problem-solving aptitude.\n- Strong organizational skills.\n- BSc/BA in Computer Science, Engineering, or a related field.\n**Preferred Qualifications:**\n- Experience with automated testing tools (e.g., Selenium, TestComplete).\n- Familiarity with Agile frameworks and regression testing.\n- A keen eye for detail and a commitment to excellence.\n**What We Offer:**\n- Flexible hours to match your schedule.\n- Competitive hourly rate or project-based payment.\n- Opportunity to work on innovative projects with a talented team.\n- A collaborative and supportive work environment.\n**How to Apply:**\nPlease submit your resume, a brief introduction, and examples of projects you have worked on or contributed to. Include your role in these projects and any relevant links or documentation. We&#039;re looking forward to learning more about how your skills and experiences align with our needs.<b>Skills</b>:        Software QA,                     Functional Testing,                     Software Testing,                     Web Testing,                     Automated Testing            ","link":"https://www.upwork.com/jobs/Quality-Assurance-Engineer-for-Software-Testing_%7E01ffa69af6ecd95d04?source=rss","processedDate":"2024-03-18T20:19:26.516Z","postedDate":"<b>Posted On</b>: March 15, 2024 12:53 UTC","id":"01ffa69af6ecd95d04"},{"skillset":["C#","ASP.NET","Microsoft IIS"],"title":"Revamp of Payment Edit Program Project - Upwork","description":"Background Information and highlights\n1. Client IT department developed two separate programs to handle the daily operation of correcting payment information for multiple medical centers under the healthcare group\n2. Each payment edit program connects separated SQL database which links to different clinical programs\n3. The payment edit program is part of billing function of the whole clinical programs\n4. Each payment edit program serves similar functionalities, yet a slightly different structure for different medical center\n5. There will have 2 groups of main users, namely ACC and CAS, with different user rights.\nThe programs are used to correct the payment information due to human errors and customer service\n6. There are 2 status of deposit/ invoice records, namely unposted and posted.\nThere is an operation workflow that all deposits and invoices are temporarily stored in each clinic program locally which are &amp;quot;Unposted&amp;quot; records.\nAnd then end-users shall send those records to the master billing system which are called &amp;quot;Posted&amp;quot; records.\nNo amendment can be made on any &amp;quot;posted&amp;quot; record\n7. The project should be completed on or before 26 April 2024\nGoal and Objectives\n1. Combine 2 legacy programs, which was developed in ASP / ASP.Net, into single platform to handling the daily operation of payment edit for different medical centers\n2. Develop a platform which functionalities can be extended later as enhancement\n3. The client has their own IT department which shall take over the source codes for further modification\n4. Chrome-ready, the old program is only compatible with IE\n5. Add audit log functionalities\nFor the details of requirement, please check this google worksheet\nhttps://docs.google.com/spreadsheets/d/14I_-cUcxwDMvZGzYJumi0_3Uz-2MdST6rVpIq9Az03g/edit#gid=852995853\nDeliverables\n1. Web application program with simple UI design to handle the operation for Payment Edit\n2. Deployment Specs (Simple one is fine, we have techs to take over)\n3. Handover and System Specification (Simple one is fine, we have techs to take over)\n4. Full source codes with project setup files must be provided (Pushing to GIT)\nQualifications with PROOF\n1. Developers must have database skill to handle SQL scripts\n2. Developers must have experience for the development of system using ASP and ASP.NET\n3. Developers must have experience for simple UI design\nTechnical Requirement or program constraints (You must strictly follow, counter proposal is NOT allowed)\n1. Since this involves some essential patient data, Awarded parties and corresponding handler shall sign NDA (non disclosure agreement)\n2. We shall provide you a remote PC which could access to the development environment with full-set of database and data ready, and tools such as Visual Studio\n3. Since this program is for internal use, there is NO need for fancy UI but the UX must be simple and clear enough. Hence complex UI design is NOT required\n4. Existing SQL scripts would be provided.\nYou should NOT modify it unless it is necessary due to the complex operation.\nHowever, you can add new SQL script for handling new features added\n5. Those SQL scripts may use linked server to cross referencing of tables over 3 database server and schema. Please pay attention to that and make sure the DB server and schema is configurable\n6. Development language: ASP.NET C# or ASP.NET VB, webform or any MVC model is fine\n7. The project will be deployed in Microsoft IIS server\n8. Our client is using High Availability architectures for both frontend and backend.\nA server farm with 2 servers will be used for the deployment of this web application.\nThe server name should be shown in the interface for easy reference and trouble shooting.\n9. SQL Server; MS T-SQL with MS SQL Server (2005, 2014, 2017, 2019) Enterprise; Stored Procedure is required (Please note that we need to support old version of MS SQL server)\n10. Reporting, if there is any: SQL Server Reporting Service (SSRS)\n11. The web program must be compatible with Chrome\nHow to bid this job?\n1 Apply in Upwork AND\n2 Fill-in google form: https://docs.google.com/forms/d/e/1FAIpQLSdVnnxsZ2OHuT400DvreMasLgRubfhZRGAQBJdZTJ5hB9rR1Q/viewform\n3 Bidding Reminder:\n- You are required to quote the Bidding Price (USD) and estimated man day required\n- Your Man Rate in USD\n- We accept one-man band or company bid in this project which we don&#039;t mind as long as the project could be delivered; Lowest price with proven related job reference and skill set shall win<b>Skills</b>:        C#,                     ASP.NET,                     Microsoft IIS            ","link":"https://www.upwork.com/jobs/Revamp-Payment-Edit-Program-Project_%7E01468c7498d7b30ed6?source=rss","processedDate":"2024-03-18T20:19:26.516Z","postedDate":"<b>Posted On</b>: March 15, 2024 09:50 UTC","id":"01468c7498d7b30ed6"},{"skillset":["Cloud Computing"],"title":"Expert to create MCQ Challenges on Cloud Computing - Upwork","description":"Requirement: Create high-quality MCQs on Cloud Computing. Areas of the challenge could be - https://docs.google.com/spreadsheets/d/1ARJ8lkdROMnlns4HyrJRaZBuxoSJdDMHBSKMjDvhu1Q/edit#gid=0\nGeneral Overview:\nHackerRank is a SaaS business company that powers technical recruiting. We are inviting talented freelancers to join our team as members of HackerRank&#039;s External Talent.\nProject Overview:\nWe are the market-leading technical interview platform to identify and hire developers with the right skills. Opportunity with our organization means you get the chance to...\n1. Develop questions on the latest tools and technologies in the software industry\n2. Be part of the beta testing team (try questions and provide feedback before they launch)\n3. Build your resume and experience with unique opportunities specific to HackerRank needs\nProject Specifics:\nCreate MCQ challenges on Cloud Computing You need to be an expert in Cloud Computing with good experience in working on all aspects of it.\nRequirements:\nMinimum 3 years of work experience\nProficient English Fluency and writing skills\nPart-time Availability\nPlease note: This job requires you to work with HackerRank using tools such as the following\n1. HackerRank for work\n2. Microsoft Teams&nbsp;&nbsp;\n3. Github<b>Skills</b>:        Cloud Computing            ","link":"https://www.upwork.com/jobs/Expert-create-MCQ-Challenges-Cloud-Computing_%7E017a406d554338483e?source=rss","processedDate":"2024-03-18T20:19:26.516Z","postedDate":"<b>Posted On</b>: March 15, 2024 09:43 UTC","id":"017a406d554338483e"},{"skillset":["C#","ASP.NET",".NET Framework","API","API Integration","RESTful API","API Development"],"title":"HID API Integration with Suprema BioMini Slim 3 - Upwork","description":"We require the development of the integration with the HID API found below. This is specifically to link our own system with the digital persona access management API of HID Global. \nUsing a Suprema BioMini Slim 3 device to authenticate an employee against the HID Global DigitalPerson API. You would need to have or be able to obtain the device below to test your integration. Please include this in your bid.\nThe device costs around $ 180 in South Africa.\nhttps://www.google.com/search?sca_esv=faad6837b4280c9e&amp;amp;sca_upv=1&amp;amp;sxsrf=ACQVn0-4I3at4s1fOecJgiXhKCfuU-vOtg:1710488028405&amp;amp;q=biomini+slim+3&amp;amp;tbm=shop&amp;amp;source=lnms&amp;amp;prmd=sivnmbtz&amp;amp;ved=1t:200715&amp;amp;ictx=111&amp;amp;biw=1536&amp;amp;bih=695&amp;amp;dpr=1.25\nFeel free to look at the API details below:\nhttps://github.com/hidglobal/digitalpersona-access-management-api\nhttps://hidglobal.github.io/digitalpersona-access-management-api/digitalpersona-samples.html\nWhat we require:\n* We have a C#, ASP.NET SAAS application. \n* The developer must provide the necessary C# developed code (preferably a class library in C#) that we can incorporate into our system to authenticate an employee via the Suprema BioMini 3 device against the HID Global DigitalPersona API.\n* The HID Global API will communicate with the device, and you need to execute and confirm verification against the API.\n* A test environment will be provided to the selected provider.\n* A larger budget has been enabled, but if you are well versed with API&#039;s, it might take less time for you than the max budget.\n* Experience with Suprema and/or Biometric devices should help you considerably.\nIn summary:\n1. Our system will provide an employee identification number\n2. Your code must utilize the HID Global API to request employee verification via the USB biometric device.\n3. HID Global API will return success or fail to your code, which must provide the result to our system.\n4. Our system will continue logging the employee in if successful.<b>Skills</b>:        C#,                     ASP.NET,                     .NET Framework,                     API,                     API Integration,                     RESTful API,                     API Development            ","link":"https://www.upwork.com/jobs/HID-API-Integration-with-Suprema-BioMini-Slim_%7E01ec27ac429385db76?source=rss","processedDate":"2024-03-18T20:19:26.516Z","postedDate":"<b>Posted On</b>: March 15, 2024 07:42 UTC","id":"01ec27ac429385db76"},{"skillset":["Security Policies &amp; Procedures Documentation","Cybersecurity Management","IT Compliance Audit","Information Security Consultation","Information Security","ISO 27001","Governance","Risk Management &amp; Compliance","Certified Information Systems Security Professional","Information Security Audit","Cloud Security","Risk Management","SOC 2 Report","HIPAA","SOC 2","Security Management"],"title":"Refrigeration  313A certificate - Upwork","description":"Hey brother I need my 313A which is a ministry license any help to either get it changed online or getting the exact copy of the C of Q that I could potentially challenge and write? Shoot me a message if it&#039;s possible <b>Skills</b>:        Security Policies &amp; Procedures Documentation,                     Cybersecurity Management,                     IT Compliance Audit,                     Information Security Consultation,                     Information Security,                     ISO 27001,                     Governance, Risk Management &amp; Compliance,                     Certified Information Systems Security Professional,                     Information Security Audit,                     Cloud Security,                     Risk Management,                     SOC 2 Report,                     HIPAA,                     SOC 2,                     Security Management            ","link":"https://www.upwork.com/jobs/Refrigeration-313A-certificate_%7E012c0f55286dea6590?source=rss","processedDate":"2024-03-18T20:19:26.516Z","postedDate":"<b>Posted On</b>: March 15, 2024 01:18 UTC","id":"012c0f55286dea6590"},{"skillset":["Python","Android","Android App Development"],"title":"Need Android App d - Upwork","description":"Hi. I need Android App for dental clinics.\n1) User will auth/register. Choose service and book doctors date/time. User need orders page. Need push when soon will book\n2) Doctor should has also own clients orders page. For each book has ststus: started, not started, soon. Need push when soon will book\n3) Design need correct and do better\n------\n1. Introduction:\n1.1 Goal: Development of a mobile application to improve patient access to ophthalmological consultations, make appointments and order medications.\n2. General requirements:\n2.1 Supported platforms: iOS and Android.\n2.2 Programming language: Kotlin for Android, Swift for iOS.\n2.3 OS version requirements: Android\n2.4 Compatibility: The application must work correctly on different devices and screens.\n3. Functional requirements:\n3.1 Registration and Authentication:\n- Possibility of registration for patients and doctors.\n- Login using your email or phone number.\n3.2 Online consultations:\n- Possibility of requesting a consultation with a doctor in real time.\n- Sending photos or files for analysis by a doctor.\n3.3 Making an appointment:\n- Calendar of doctors&#039; availability.\n- Online booking of an appointment at a time convenient for the patient.\n3.4 Ordering medications:\n- Catalog of medicines with detailed information.\n- Possibility of ordering medications with delivery.\n3.5 Medical history management:\n- Electronic medical record for patients and doctors.\n- Storage of test results and diagnoses.\n4.2 User management:\n- Ability to add, block and delete users.\n- Role model for doctors and administrators.\n4.3 Schedule management:\n- Calendar of doctors&#039; availability.\n- Ability to edit the schedule and cancel appointments.\n4.4 Medication management:\n- Adding new drugs to the catalog.\n- Monitoring and inventory management.\n-------\nDental app design plan:\n1. Home screen:\nSections: &ldquo;Chat with a doctor&rdquo;, &ldquo;Online pharmacy&rdquo;, &ldquo;Selecting a service&rdquo;, &ldquo;Dentists&rdquo;, &ldquo;Profile&rdquo;, &ldquo;Diagnosis&rdquo;.\nInterface: Intuitive, with emphasized functional blocks.\n2. Chat with the doctor:\nChat interface: Easily accessible for the patient, functional for the doctor.\nNotification system: For new messages, as well as invitations to sessions.\n3. Online pharmacy:\nProduct categories: By categories and subcategories.\nSorting: By price and brands.\nProduct details: Description, name, brand, price, product photo.\n4. Service selection:\nList of services: Divided into basic dental services.\nSelect a clinic: With the ability to view dentists in each clinic.\n5. Dentists:\nList of dentists: With the ability to view the profile of each.\nFilter by Experience: Allows patients to select dentists based on experience.\nReviews: Patients can leave reviews about dentists.\n6. Dentist profile:\nAchievements and Experience: A detailed description of achievements and work experience.\nWork Schedule: Indicates availability for scheduling sessions.\n7. Session appointment:\nCalendar: Allows you to select convenient dates and times.\nNotifications: Reminders about the upcoming session.\n8. Diagnosis:\nTreatment Plan: Details of proposed treatments and medications.\nDocuments: Possibility of downloading and viewing documents on the diagnosis.\n9. Administrative part:\nProduct management: Adding, editing and deleting products in the pharmacy.\nDentist management: Add, edit and delete dentist profiles.\nSession Management: View and edit assigned sessions.\n10. Security and privacy:\nData Encryption: Protect medical data and personal information.\nAuthentication: Secure access to the administrative part.\n11. Element design:\nColor palette: Calm and professional colors.\nIcons: Informative icons for each function.\nTypography: Clear and readable font.\n------\nSorry can pay only $50 and good review. Need quickly.\nLink to design and need to correct better: figma.com/file/7ewzo1JJkr8Q6RSBC7alQn/Untitled?type=design&amp;amp;node-id=0%3A1&amp;amp;mode=design&amp;amp;t=8G2QD0sHGUSYrP1v-1\nNeed in Android. Write when you can and finish pls.<b>Skills</b>:        Python,                     Android,                     Android App Development            ","link":"https://www.upwork.com/jobs/Need-Android-App_%7E018d6e70d3327bff4a?source=rss","processedDate":"2024-03-18T20:19:26.516Z","postedDate":"<b>Posted On</b>: March 14, 2024 19:21 UTC","id":"018d6e70d3327bff4a"},{"skillset":["3D Design","Interior Design"],"title":"Room design 3D - Upwork","description":"Hi, I need you to make 3 d sketch for our four different rooms, where customers can host birthdays&nbsp;&nbsp;and other events.\nEach theme is different.\nOur themes are: \n1. Green/modern - we use only this material for walls and floor: https://www.decora.ee/sisustus-ja-kodukaubad/vaibad/muruvaip-marbella-2m\n2. Wooden style/pirates- we use only this kind of material for floors and walls: https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ-JiR2zDfBSorAa25A4lIdRIXz1l45DrXWFw&amp;amp;usqp=CAU\n3. Garage/industrial - we use only this kind of material for walls: https://bestor.ee/toode/trapetsprofiil-katuseplekk-balex-bp-20/ Color: brown. For the flooring we need to use brown PVC\n4. Classic: 1m height we use wood: https://wallpapers.com/images/featured/wood-pp3vc2xea9gfw3ap.jpg\nfrom 1m to 3meters we use this wallpaper https://www.decora.ee/tapeet-238820-p16\nFrom 3 meters to ceiling we need use same color paint as the wallpaper.\nDimensions, the positions of windows and doors are attached as a file. \nFurniture and extras + lights\nto each room we need a table for 20 people, chairs ( must be moveable), tv on the wall and some decoration extras - you can add them. It is important that the rooms look very unique. Also you can add a suitable lights. <b>Skills</b>:        3D Design,                     Interior Design            ","link":"https://www.upwork.com/jobs/Room-design_%7E0111128a444222ebb1?source=rss","processedDate":"2024-03-18T20:19:26.516Z","postedDate":"<b>Posted On</b>: March 14, 2024 18:23 UTC","id":"0111128a444222ebb1"},{"skillset":["English","Product Knowledge"],"title":"Tech tutorial recording - Upwork","description":"I have a Youtube channel for software tech tutorials.\nI need someone who is a bit of a tech geek and is competent at recording a YouTube review on features of a software.\nFor example, Elfsight.com\nPick one of their features, and do a 5-10 minutes tutorial on it.\nI will pay $1 per minute of video recording. Each video is estimated to be 3-10 minutes depending on the complexity of the feature.\nYou will be trained on how to record these.\nYou need to have good English accent. \nto apply, please send me an audio message with your voice recording explaining why you want this position and why you are a good fit.\nThis will potentially be a full time position for ongoing work.\nExamples of videos: \nhttps://www.youtube.com/watch?v=3BRi88ut7v4\nhttps://www.youtube.com/watch?v=AtosyqmjXqQ&amp;amp;t<b>Skills</b>:        English,                     Product Knowledge            ","link":"https://www.upwork.com/jobs/Tech-tutorial-recording_%7E01d65686c95f352d66?source=rss","processedDate":"2024-03-18T20:19:26.516Z","postedDate":"<b>Posted On</b>: March 14, 2024 16:33 UTC","id":"01d65686c95f352d66"},{"skillset":["Firebase Realtime Database","React","CSS","HTML","React Native","Web Development","Full-Stack Development"],"title":"Experienced ReachJS/Native Developer to Join Long Term Project(s) - Upwork","description":"Read Over &amp;amp; Comprehend All Details Provided Fully:\nFirst Things First:\n++ We Manually Review All 100+ Applicants. Oftentimes Providing Feedback.\n++ We Seek Market Value Developers. Not the Cheapest. Proposals Should Tailored to Task.\n++ We Prefer Top-Rated/Plus with 10k Minimum in UP Earnings.\n==============================================\nBackstory:\nWe are moving from a Flutter based platform over to a full React Native/JS instead for better scalability and performance. We are now looking for additional React developers for long term work and priced accordingly. We already have all of the FIGMA + custom built CRM that we are building out the mobile applications now, with the desktop to follow in early 2024.\nA few things of consideration before you submit an application:\n-- Solid Documented Work Experience in ReactJS/React Native + Firebase\n-- Must Provide Your GITHUB to Review Your React Code Quality By Existing Team\n-- Minimum 10k in UPWORK Earnings\n-- Minimum Top-Rated/Plus in UPWORK Experience\n-- Teamwork Towards a Common Goal for Long Term Projects** \n** I am not doing air traffic control between grown adults. I run into this often on these freelancer websites where you can talk and work directly with the other web developer(s) on the team. But instead send messages for me to relay to them, and so forth. I run multiple businesses, and this is unacceptable. If you cannot communicate and work as a collaborative, do not apply for this job!!\nLastly, we are not doing a complete code rebuild from scratch. You will need to produce within the existing framework, no exceptions. This is a non-negotiable. In every programming job, the new web developer wants a complete tear down and rages about previous web developers. If you cannot work within someone else&#039;s code, please do not bid on this job! \n==============================================\nREQUIREMENTS:\n-- FIREBASE DB\n-- REACTJS/NATIVE\n-- MONDAY PM (you must communication/work as a team)\n-- ANY LARGER MODEULES ARE FIXED BUDGET\n-- SIGN NDA (non-negotiable)\n-- DETAILED COMPREHENSIVE PROPOSAL ***\n-- WEEKLY VERIFABLE PROGRESS UPDATES REQUIRED!\n***&nbsp;&nbsp;We will not accept &#039;proposals&#039; that are a couple of sentences with arbitrary vague information, including fly-by-night deadlines and asking for thousands. We only work with professionals who present themselves as such with a solid UPWORK job history. This includes providing documentation of scope and scale, so we know what we are paying for! This protects both sides and sets proper expectations before going into a contract.\n==============================================\n&amp;quot;Do what you mean, mean what you say.&amp;quot;\nIf you cannot show us weekly progress on our contract, we would pull the contract from you. Too often on these websites, freelancers take on more work than they can actually manage. This causes a mix of rob Peter to pay Paul, and due dates being missed. If you are missing contract due dates, you would be dinged in your reviews accordingly. At the end of the day, we have a business to run. We provide all of these disclosures UPFRONT so you are aware that we are looking for professionals only!\nREASONS YOU WILL NOT BE CONSIDERED:\nï»¿\n++ AI Autoresponders/Immediate Elimination.\n++ Asking for Phone Calls When None is Needed/All Information Job Post\n++ Demanding a Minimum 40/80 Hours on Jobs That Do Not Require It\n++ Bad Reviews/Ratings. Particularly Where You Do not Meet Deadlines.\n++ Delays in Provided Basic Proposal for Easy Jobs.\n++ Vague/Incomplete/Dismissal of Q&amp;amp;A on More Complicated Job Posting\n++ Limited or No Documented UW Experience/Reviews/Ratings\n++ Submitting Cadillac Top Tier Rates for Junior Web Developer Monkey Work/Tasks\nSave all of the sales pitches. We have been doing web development for 25+ years, with many on UW. Focus on only what is required to complete this milestone and task, as that is all we want to hear about. This is a straight forward job with all of the information provided in the job posting. We work fast having 30+ job posts in the past 6 months. We only work with web developers who can keep up with our pace.\nThank ye kind sire.<b>Skills</b>:        Firebase Realtime Database,                     React,                     CSS,                     HTML,                     React Native,                     Web Development,                     Full-Stack Development            ","link":"https://www.upwork.com/jobs/Experienced-ReachJS-Native-Developer-Join-Long-Term-Project_%7E01fc00406e690f9b46?source=rss","processedDate":"2024-03-18T20:19:26.516Z","postedDate":"<b>Posted On</b>: March 02, 2024 07:02 UTC","id":"01fc00406e690f9b46"},{"skillset":["Interior Design","3D Modeling","Architectural Design","Autodesk AutoCAD","SketchUp"],"title":"Interior Design for Wellness Resort Project - Upwork","description":"I need a comprehensive blueprint for the design and construction of a wellness resort in India, guiding the project from conceptualization to realization. The super structure of the project is almost completed, I am sharing some files with you, for reference which outlines the current position of the project.\nhttps://app.box.com/s/dhc4j93jumztx757bl1zuozlfoiwgh5q\nThe concept note regarding the project can also be found in the folder.<b>Skills</b>:        Interior Design,                     3D Modeling,                     Architectural Design,                     Autodesk AutoCAD,                     SketchUp            ","link":"https://www.upwork.com/jobs/Interior-Design-for-Wellness-Resort-Project_%7E01cdb8ab8a434d72ac?source=rss","processedDate":"2024-03-18T20:19:26.516Z","postedDate":"<b>Posted On</b>: March 14, 2024 13:47 UTC","id":"01cdb8ab8a434d72ac"},{"skillset":["Go-to-Market Strategy","Business with 1-9 Employees","Product Management","SaaS","Data Analysis","Product Roadmap","Artificial Intelligence","Marketing Analytics","Agile Project Management","Startup Company"],"title":"Graybook.ai Product Roadmap - SAAS Experience - Data Driven  - Upwork","description":"Graybook.ai aspires to become the leading marketplace for AI users. One-stop shop portal that collates all users&#039; needs from blogs, product reviews, prompts and research on the AI industry.\nGraybook will launch in Q1,2024, based out of UAE.\nWe are seeking an experienced product leader to lead between the various parties to design/lead a growth agenda for the website post the launch, scopes will include:&nbsp;&nbsp;\nDefine the product roadmap. Product managers gather important insight through market research, competitor analysis, and customer interviews and then translate those insights into a product roadmap that provides the product team, and entire company, with a clear product development direction.\nCollaborate cross-functionally across teams. Product managers work closely with engineers, designers, marketers, and sales representatives to guide a new product line or feature through every stage.\nServe as the voice of the customer. Product managers ensure that the user experience remains at the forefront of decision-making, building products with customer empathy and delight in mind.\nBalance business and technical requirements. Product managers sit with the engineering team to determine the feasibility of proposed features and realistic expectations and timelines for technical implementation decisions.\nDevelop a go-to-market strategy: Working closely with product marketing and development, content managers to define the product&rsquo;s target customer and value proposition to craft effective messaging&mdash;landing pages, content , and marketing collateral&mdash;to effectively sell the product.\nDefine and measure product success: To measure product success, a product manager must be data-driven&mdash;analyzing user data, customer feedback, and market trends&mdash;to make informed decisions on feature prioritization and&nbsp;improvements<b>Skills</b>:        Go-to-Market Strategy,                     Business with 1-9 Employees,                     Product Management,                     SaaS,                     Data Analysis,                     Product Roadmap,                     Artificial Intelligence,                     Marketing Analytics,                     Agile Project Management,                     Startup Company            ","link":"https://www.upwork.com/jobs/Graybook-Product-Roadmap-SAAS-Experience-Data-Driven_%7E01ce09371957654968?source=rss","processedDate":"2024-03-18T20:19:26.517Z","postedDate":"<b>Posted On</b>: March 14, 2024 11:41 UTC","id":"01ce09371957654968"},{"skillset":["Functional Testing","Software QA","Quality Control","Web Testing","Performance Testing","Software Testing","Automated Testing"],"title":"Quality Assurance Engineer - Upwork","description":"**Title:** Seeking Experienced Quality Assurance Engineer for Comprehensive Software Testing\n**Job Description:**\nWe are looking for a highly skilled and experienced Quality Assurance (QA) Engineer to join our software development team. The ideal candidate will have a keen eye for detail and a passion for ensuring that software products meet or exceed our quality standards. This role involves designing and implementing tests, debugging, and defining corrective actions. You will also review system requirements and track quality assurance metrics (e.g., defect densities and open defect counts.)\n**Responsibilities:**\n- Review and analyze system specifications to ensure clarity and understandability.\n- Collaborate with the development team to develop effective strategies and test plans.\n- Execute test cases (manual or automated) and analyze results.\n- Evaluate product code according to specifications.\n- Create logs to document testing phases and defects.\n- Report bugs and errors to development teams.\n- Help troubleshoot issues and conduct post-release/ post-implementation testing.\n- Work with cross-functional teams to ensure quality throughout the software development lifecycle.\n**Requirements:**\n- Proven experience as a Quality Assurance Engineer or similar role.\n- Experience in QA methodology and tools.\n- Ability to document and troubleshoot errors.\n- Working knowledge of test management software (e.g., qTest, Zephyr) and SQL.\n- Excellent communication skills.\n- Attention to detail.\n- Analytical mind and problem-solving aptitude.\n- Strong organizational skills.\n- BSc/BA in Computer Science, Engineering, or a related field.\n**Preferred Qualifications:**\n- Experience with automated testing tools (e.g., Selenium, TestComplete).\n- Familiarity with Agile frameworks and regression testing.\n- A keen eye for detail and a commitment to excellence.\n**What We Offer:**\n- Flexible hours to match your schedule.\n- Competitive hourly rate or project-based payment.\n- Opportunity to work on innovative projects with a talented team.\n- A collaborative and supportive work environment.\n**How to Apply:**\nPlease submit your resume, a brief introduction, and examples of projects you have worked on or contributed to. Include your role in these projects and any relevant links or documentation. We&#039;re looking forward to learning more about how your skills and experiences align with our needs.\n---\nThis template is designed to attract candidates by clearly defining the role, responsibilities, and requirements. Feel free to adjust it to better fit your specific project needs or company culture.<b>Skills</b>:        Functional Testing,                     Software QA,                     Quality Control,                     Web Testing,                     Performance Testing,                     Software Testing,                     Automated Testing            ","link":"https://www.upwork.com/jobs/Quality-Assurance-Engineer_%7E01ff404d07c906f50e?source=rss","processedDate":"2024-03-18T20:19:26.517Z","postedDate":"<b>Posted On</b>: March 14, 2024 09:37 UTC","id":"01ff404d07c906f50e"},{"skillset":["Digital Project Management","Business with 1-9 Employees"],"title":"Operations Manager (Filipino Applicants Only) - Upwork","description":"Responsibilities:\nhttps://docs.google.com/document/d/1xYVoGszQ7LMaTtAdRyLFOIPUTnqxm6P8vQFnIRSuZuo/edit?usp=sharing\nDesired Skills and Qualifications:\n- Proven experience in operations management and executive assistance.\n- Strong organizational and project management skills.\n- Excellent communication and interpersonal abilities.\n- Ability to document processes and quickly learn new tools.\n- A problem-solver with a keen eye for process improvements.\n- Proficiency in workflow automation tools (Zapier, Integromat, Google Scripts) is preferred.\n- Knowledge of digital marketing is advantageous.\nThe company offers:\n- A monthly fixed salary of $800\n- A working schedule of 5PM to 1AM PHT\n- Paid holidays and vacation\n- Promotion and bonuses await for the successful hire who will perform well\nApply here: https://forms.gle/eZcwx6Yd3LWS1yp48<b>Skills</b>:        Digital Project Management,                     Business with 1-9 Employees            ","link":"https://www.upwork.com/jobs/Operations-Manager-Filipino-Applicants-Only_%7E0114e8f546d9f7a5fe?source=rss","processedDate":"2024-03-18T20:19:26.517Z","postedDate":"<b>Posted On</b>: March 14, 2024 08:42 UTC","id":"0114e8f546d9f7a5fe"},{"skillset":["Autodesk AutoCAD","2D Design","Architectural Design"],"title":"Building Plans for Off Grid Solar System  - Upwork","description":"Will need build plans for off grid solar system for a cabin.\nSOLAR MOUNT \nBuilding plans for a 20ft x 12ft solar mount that includes materials list. \nThe following videos show exactly the design:\nBuild - Part 1: https://www.youtube.com/watch?v=2yeiYHyVzgU \nBuild - Part 2: https://www.youtube.com/watch?v=pfbfTKT_5fQ\nMaterials: https://www.youtube.com/watch?v=YY3lyio1NaE \nSolar mount size: 20ft x 12ft\n10ft piers (2ft in ground) with 8ft above ground. \nSee Attachment: Solar Panel - 395W Hyundai\nSOLAR SHED\nBuilding plans for 4x4 solar shed to house the solar components. Will house EG4 6000XP invert, EG4 LL-S batteries. \nAttachments: (1) Shed Plans - 4x4 &amp;amp; (2) Shed Plans - Door (single shed door)\nWIRING TO CABIN\nWill run conduit from solar shed to the cabin.\nCABIN\nWill need main breaker panel wiring plans and basic wiring diagram for lights and outlets.\nSITE PLAN\nA lay out of the various parts of the off grid solar system including the cabin and shower shed.\nWill need building plans in &frac14;&amp;quot; scale with complete construction details and should be at least 11&amp;quot;x17&amp;quot; files and PDF versions. <b>Skills</b>:        Autodesk AutoCAD,                     2D Design,                     Architectural Design            ","link":"https://www.upwork.com/jobs/Building-Plans-for-Off-Grid-Solar-System_%7E016b0b538f9cb69f22?source=rss","processedDate":"2024-03-18T20:19:26.517Z","postedDate":"<b>Posted On</b>: March 14, 2024 06:41 UTC","id":"016b0b538f9cb69f22"},{"skillset":["Sales Funnel","Landing Page"],"title":"Create 2 Landing Pages - Book &amp; On-Demand Webinar - Upwork","description":"We have an existing landing page we are looking to improve, built using PhoneSites\nEXISTING LANDING PAGE:\nwww.GetAdamsBook.com\nLANDING PAGE EXAMPLES (BOOK)\nhttps://movetomillionsbook.com/ \nhttps://go.wealthyconsultant.com/getthebook-2\nLANDING PAGE EXAMPLES (WEBINAR):\nhttps://www.10xmarketingprogram.com/tt-1?h_ad_id=1747502301329409&amp;amp;ttc_id=1747502301328417&amp;amp;ttclid=E.C.P.CswByEMoyQSRiJVKf5GxmNb9EGh_PrGcyZUdnDmOi9sJg1SoIgB13Bt6ARwxEVzjwUVnu7_eetTt3O4nllgLXTKXFr_tyqiR9sGQrBUeoixs_B413U_aIZxnLUdXIBg-Lz2Q1YwskuJJ32NhJHTij-rp-IldweVKatEOHNVNY_0vpap9__93borCgRDXBnuTpRA_lRYIa8XlSIWmZTEtULmfsZgikq5IH1HQn8QkquGltO6EAhhsarTuud62YLd3rfrtM1ZM3s0EPRF-rcDfEgR2Mi4wGiB5TdmJmQbmYa3WuWH-VFG6WmM1Yup_pdOxJ1iDsePzTg&amp;amp;utm_campaign=MAC&amp;amp;utm_source=TikTokAds\nhttps://www.6stepmasterclass.com/6-steps-case-study-a?utm_campaign=free-training&amp;amp;utm_content=free-training&amp;amp;utm_medium=middle-section&amp;amp;utm_source=danlokweb\nhttps://www.mirandapearcemarketing.com/marketing-webinar-usa<b>Skills</b>:        Sales Funnel,                     Landing Page            ","link":"https://www.upwork.com/jobs/Create-Landing-Pages-Book-amp-Demand-Webinar_%7E01e7f95c7077a4b769?source=rss","processedDate":"2024-03-18T20:19:26.517Z","postedDate":"<b>Posted On</b>: March 13, 2024 22:27 UTC","id":"01e7f95c7077a4b769"},{"skillset":["Data Entry","Lead Generation","Virtual Assistance","Administrative Support"],"title":"Need a Real Estate VA to put together a list of Property Management Companies - Upwork","description":"Greetings!\nWe are currently seeking a skilled real estate virtual assistant to kickstart a property management list building project. This task is expected to be straightforward and manageable.&nbsp;&nbsp;Proficiency in conversational English is required.&nbsp;&nbsp;\nHere&#039;s what the job entails:\n1.&nbsp;&nbsp;Conduct a Google search for &amp;quot;Property Management Companies&amp;quot; in the following cities/MSAs:\nPine Bluff, AR\nKansas City, MO\nHuntsville/Decatur, AL\nBirmingham, AL\nMacon, GA\nColumbus, GA\nAugusta, GA\nFayetteville, NC\nGreensboro/Lexington, NC\nDallas/Fort Worth, TX\n2.&nbsp;&nbsp;Complete the form available at the following link:\nhttps://docs.google.com/forms/d/e/1FAIpQLScMqQMr983FIURFk_LPMqLu6oNb1q57zbonwp46QS9oOFPSYw/viewform\n(The first four questions can be filled using Google search, while the remaining five require a brief phone call to determine the appropriate contact person, role and availability details.)\n3.&nbsp;&nbsp;Submit the form and proceed to the next entry!\nWe are particularly interested in candidates with experience in the real estate investment sector, as this project may lead to a full-time position. The scope of responsibilities may evolve, covering tasks ranging from marketing and sales to research, data extraction, and technical support with CRMs, AI, and IT.\nTo apply, kindly specify your availability and hourly rate. Additionally, provide examples of past work that aligns with this role. Candidates with prior experience in real estate-related tasks will be given preference.\nThank you for considering this opportunity! For more information about our company, please visit simplehousedfw.com and simplehousecapital.com.\nBest regards,\nDwight Harrison<b>Skills</b>:        Data Entry,                     Lead Generation,                     Virtual Assistance,                     Administrative Support            ","link":"https://www.upwork.com/jobs/Need-Real-Estate-put-together-list-Property-Management-Companies_%7E0158c93408a490e6bf?source=rss","processedDate":"2024-03-18T20:19:26.517Z","postedDate":"<b>Posted On</b>: March 13, 2024 21:55 UTC","id":"0158c93408a490e6bf"},{"skillset":["Automation","Data Scraping","Zapier","Data Extraction"],"title":"Automated Information Gathering and CRM Integration - Upwork","description":"Project Overview:\nWe are looking for a skilled freelancer to develop an automated solution for gathering venue information from multiple websites, ensuring data cleanliness, enriching it with contact details from third-party sources (Apollo.io), and seamlessly integrating it into our CRM system (PipeDrive). The project aims to streamline our venue acquisition process, automate sales campaigns, and ensure regular updates of venue data for ongoing prospecting efforts.\nFor more information please check the full detail here:\nhttps://docs.google.com/document/d/12vbP8LcKrI7DJqO2-WbiWVZQEOLSnK0f64jsT-TiTyQ/<b>Skills</b>:        Automation,                     Data Scraping,                     Zapier,                     Data Extraction            ","link":"https://www.upwork.com/jobs/Automated-Information-Gathering-and-CRM-Integration_%7E0138b73b2c0e436f16?source=rss","processedDate":"2024-03-18T20:19:26.517Z","postedDate":"<b>Posted On</b>: March 13, 2024 21:33 UTC","id":"0138b73b2c0e436f16"},{"skillset":["Google Sheets"],"title":"Create Coupon Usage Tool in Google Sheets - Upwork","description":"TL:DR; I need to create a Google Sheets to help our sales people a) Choose a coupon that hasn&#039;t been used b) Say a Coupons been used c) Log who used what coupons. \nI have a GoogleSheets: https://docs.google.com/spreadsheets/d/1Z9pwtOnwwmcUOM9E_I3qB9fzECtLmXN7ljlvXlyDBnk/edit#gid=1937103632\nOn the first sheet, I&#039;d like to have four options \n1) Choose The Sales Person -- Type List --\nValues:&nbsp;&nbsp;Paj, James, Dave, Ron\n2) Choose the Tier -- Type List -- \nValues is from Column A on Sheet 2. \n^ Note once this is chosen \n3) The Option to say &amp;quot;I just used this coupon&amp;quot; \n4) The optoin to type in the customer they are doing -- Freeform \nA few notes:\n- I&#039;d like to randomly choose a coupon per tier so that we don&#039;t run into the issue of people ever having the same coupon open (coupons are single use) \n- After you you click I just used this coupon, I&#039;d like to log who the sales person and the customer. E.x. If line two on sheet two was used, it would read EVENT150TO100\tSEETHESEAS816782765 Paj Billy&#039;s Company <b>Skills</b>:        Google Sheets            ","link":"https://www.upwork.com/jobs/Create-Coupon-Usage-Tool-Google-Sheets_%7E016099a2e8552139a6?source=rss","processedDate":"2024-03-18T20:19:26.517Z","postedDate":"<b>Posted On</b>: March 13, 2024 20:50 UTC","id":"016099a2e8552139a6"},{"skillset":["Computer Skills","Email Communication","Typing","Proofreading","Company Research","Data Entry","Accuracy Verification","Data Scraping","Data Mining","Google Docs"],"title":"Data Entry for Music Schools - Upwork","description":"I am a classical composer of orchestral and chamber music looking for a Data Entry specialist for lists that are made via Google Docs. This is a one-time job, but may lead to additional work.&nbsp;&nbsp;&nbsp;\nRequired Qualifications:\n1. Proficiency in English reading and writing skills.\n2. Proficiency in data mining and data entry. \n3. Proficiency using Google Docs.\nPreferred Qualifications (may be helpful for future work):\n1. Experience playing any instrument (i.e., violin, piano, flute, guitar, etc.).\n2. Experience reading music notation.\n3. Experience with video editing via Davinci Resolve Studio. \n4. Experience with Adobe Photoshop. \nTo Apply for the Job, please follow the instructions here:&nbsp;&nbsp;\n1.\tReplicate this document:\na.\thttps://docs.google.com/document/d/1l-SWqmk-MZdIpd4qMmkAI4r6H6Nb6fj9X8AcsPRh-Dk/edit?usp=sharing\n2.\tFill out the table only for the following universities: \na.\tRoyal Birmingham Conservatoire\nb.\tRoyal Conservatoire of Scotland\nc.\tGuildhall School of Music and Drama\nd.\t(you will notice that I gave you an example of how to do this with the Royal Academy of Music in London). \n3.\tWhen you are finished, send your Google Doc link, and don&rsquo;t forget to manage the share permissions to &ldquo;Anyone with this link.&rdquo;\n4.\tDo not do more than what I have asked you. Otherwise, I will ignore your job application.\nThank you.<b>Skills</b>:        Computer Skills,                     Email Communication,                     Typing,                     Proofreading,                     Company Research,                     Data Entry,                     Accuracy Verification,                     Data Scraping,                     Data Mining,                     Google Docs            ","link":"https://www.upwork.com/jobs/Data-Entry-for-Music-Schools_%7E01c8d495e493004473?source=rss","processedDate":"2024-03-18T20:19:26.517Z","postedDate":"<b>Posted On</b>: March 13, 2024 19:06 UTC","id":"01c8d495e493004473"},{"skillset":["Game UI/UX Design","UI Graphics","Adobe Illustrator","Adobe Photoshop","Graphic Design","Web Design","Photo Manipulation"],"title":"Looking for expert graphics designer for social proofs - Upwork","description":"im looking for an expert UI Designer to make social proofs for me, \nThese will be for testimonials or like picture proofs of earnings and analytics. \nThey will be done for youtube earnings here are some examples \nhttps://gyazo.com/33d8305409c7ef958ae71c219bf7eee8\nhttps://gyazo.com/f9a22fbfdc4350faba74629e859c70d7\nhttps://miro.medium.com/v2/resize:fit:1400/1*oxllQAaJJ2avQEFiVXpR4Q.png\nhttps://wordsbyevanporter.com/content/images/2022/06/youtube_results.png\nI will need mobile images and computer images done as well, \nThese have to look very real, so I Need someone that has much experience with this kind of job. Thank you \nSend me your portfolio, so I Know your right for this role. Thank you <b>Skills</b>:        Game UI/UX Design,                     UI Graphics,                     Adobe Illustrator,                     Adobe Photoshop,                     Graphic Design,                     Web Design,                     Photo Manipulation            ","link":"https://www.upwork.com/jobs/Looking-for-expert-graphics-designer-for-social-proofs_%7E016c24fedce67fffbb?source=rss","processedDate":"2024-03-18T20:19:26.517Z","postedDate":"<b>Posted On</b>: March 13, 2024 18:17 UTC","id":"016c24fedce67fffbb"},{"skillset":["Embedded System","C++","C","Embedded C","Firmware","Assembly Language"],"title":"Implement Secure NOR Flash on Embedded System - Upwork","description":"We are seeking a skilled professional to assist us with implementing secure NOR flash on our embedded system using the C-Sky CK803 processor architecture and YunOS (aka AliOS Things) derived CSI-RTOS platform. Our firmware is fully written and based on an SDK from the chipset supplier. Some of the libraries are precompiled but contain full debugging symbols and disassemble well for analysis. Development platform is XuanTie CDK. If possible, as part of this project, we would like to reverse engineer writing to the OTP/eFuses in the MCU. We have a full map of the values and code for reading them, but no code for writing them.\nWe would like to implement either Infineon SEMPER Secure or Winbond W77Q NOR flash.<b>Skills</b>:        Embedded System,                     C++,                     C,                     Embedded C,                     Firmware,                     Assembly Language            ","link":"https://www.upwork.com/jobs/Implement-Secure-NOR-Flash-Embedded-System_%7E0108b4afcdae7a7532?source=rss","processedDate":"2024-03-18T20:19:26.517Z","postedDate":"<b>Posted On</b>: March 13, 2024 17:39 UTC","id":"0108b4afcdae7a7532"},{"skillset":["Game UI/UX Design","UI Graphics","Adobe Illustrator","Adobe Photoshop","Graphic Design","Web Design","Photo Manipulation"],"title":"Looking for a Social Proof Expert UI Designer  - Upwork","description":"im looking for an expert UI Designer to make social proofs for me, \nThese will be for testimonials or like picture proofs of earnings and analytics. \nThey will be done for youtube earnings here are some examples \nhttps://gyazo.com/33d8305409c7ef958ae71c219bf7eee8\nhttps://gyazo.com/f9a22fbfdc4350faba74629e859c70d7\nhttps://miro.medium.com/v2/resize:fit:1400/1*oxllQAaJJ2avQEFiVXpR4Q.png\nhttps://wordsbyevanporter.com/content/images/2022/06/youtube_results.png\nI will need mobile images and computer images done as well, \nThese have to look very real, so I Need someone that has much experience with this kind of job. Thank you \nSend me your portfolio, so I Know your right for this role. Thank you <b>Skills</b>:        Game UI/UX Design,                     UI Graphics,                     Adobe Illustrator,                     Adobe Photoshop,                     Graphic Design,                     Web Design,                     Photo Manipulation            ","link":"https://www.upwork.com/jobs/Looking-for-Social-Proof-Expert-Designer_%7E0109c577c2e5250722?source=rss","processedDate":"2024-03-18T20:19:26.517Z","postedDate":"<b>Posted On</b>: March 13, 2024 17:24 UTC","id":"0109c577c2e5250722"},{"skillset":["Web Development","WordPress","Web Design","HTML","Graphic Design"],"title":"Looking for a great Website developer!  - Upwork","description":"Are you a talented website/webshop developer with experience in WordPress? Do you want to be part of a dynamic team and utilize your skills to create digital solutions for a company specializing in magnet solutions for various industries? Then we are looking for you!\nOur company is a leading player in the magnet trade, offering custom magnet solutions for diverse sectors including interior and machine building, speaker manufacturers, and the food industry. From simple disc magnets to screw-in disc magnets with rubber coating, to complex magnetic filters, our range is broad and offers countless possibilities.\nWe are seeking an enthusiastic website/webshop developer who wants to work with us to design and implement a professional and user-friendly website/webshop. As part of our team, you&#039;ll have the opportunity to showcase your creativity and come up with innovative solutions that enhance our online presence and expand our customer base.\nFor more information about this exciting opportunity and our company, please contact us or review the attached document. We look forward to hearing from you and working together towards a successful digital future!<b>Skills</b>:        Web Development,                     WordPress,                     Web Design,                     HTML,                     Graphic Design            ","link":"https://www.upwork.com/jobs/Looking-for-great-Website-developer_%7E014efc9709462219e2?source=rss","processedDate":"2024-03-18T20:19:26.517Z","postedDate":"<b>Posted On</b>: March 13, 2024 16:56 UTC","id":"014efc9709462219e2"},{"skillset":["Project Management","Content Writing","Social Media Marketing","Marketing Strategy","Presentations","Communications"],"title":"Webinar Project Leader for Launch - Upwork","description":"Seeking Webinar Expertise for a Launch in the US Market\nI&#039;m on the hunt for your expertise as I prepare to launch a new brand in the dynamic US market. This venture promises to be an exciting journey, but I need guidance on crafting the perfect webinar experience to captivate potential customers and stakeholders alike.\nHere&#039;s where your expertise comes in:\n1. **Platform Recommendations**: I&#039;m looking for insights on the best webinar platforms available. Whether it&#039;s Zoom, Livestorm, GoToWebinar, or another contender, I need a platform that offers seamless interaction, robust features, and scalability to accommodate our growing audience.\n2. **Invitation Strategy**: Timing is everything, and I need advice on when and how to invite potential attendees to our webinars. Should I send invitations weeks in advance, or is a shorter lead time more effective? What methods should I utilize to ensure maximum visibility and RSVPs?\n3. **Speaker Selection**: A successful webinar hinges on engaging speakers who can deliver valuable insights and resonate with our target audience. What types of speakers should I aim to have onboard? Should I prioritize industry experts, thought leaders, or a mix of both?\n4. **Content Creation**: Content is king, and I want to ensure our webinar content is both informative and compelling. How can I tailor our content to address the pain points and interests of our target market? Should we incorporate interactive elements, Q&amp;amp;A sessions, or live polls to enhance engagement?\n5. **Technical Considerations**: From audio and visual setup to troubleshooting potential technical glitches, there are numerous technical considerations to keep in mind. What equipment and software are essential for delivering a professional webinar experience? How can I mitigate technical issues to ensure a smooth presentation?\n6. **Post-Webinar Engagement**: The conversation doesn&#039;t end when the webinar concludes. I&#039;m interested in strategies for fostering post-webinar engagement, whether through follow-up emails, social media interaction, or ongoing content delivery.\nLaunching a new brand in the US market is no small feat, but with the right webinar strategy in place, I&#039;m confident we can make a splash. If you&#039;re a webinar expert ready to lend your insights and expertise to this exciting venture, I&#039;d love to hear from you. Let&#039;s collaborate to create an unforgettable webinar experience that sets our brand apart from the competition.\nInterested parties can reach out to me directly via [contact information]. Together, let&#039;s elevate our brand and make a lasting impact in the US market! ðŸš€<b>Skills</b>:        Project Management,                     Content Writing,                     Social Media Marketing,                     Marketing Strategy,                     Presentations,                     Communications            ","link":"https://www.upwork.com/jobs/Webinar-Project-Leader-for-Launch_%7E015f32711893c478b9?source=rss","processedDate":"2024-03-18T20:19:26.517Z","postedDate":"<b>Posted On</b>: March 13, 2024 16:55 UTC","id":"015f32711893c478b9"},{"skillset":["Android"],"title":"[Android Studio] Webview + RateUs dialog + Navigation Drawer - Upwork","description":"Hi,\nI want to this app from &amp;quot;JAVA&amp;quot; on android studio.\n1.\tMake it from scratch.\n2.\tJAVA on Android Studio.\n3.\tWebview\n4.\tRateUs dialog\n5.\tNavigation Drawer\n6.&nbsp;&nbsp;&nbsp;I want it in 48 hours.\nRead this for more detail\nhttps://www.dropbox.com/scl/fi/nehyfhj4jpe0k0kcbfyyx/04_tour2.pdf?rlkey=8bm06wzwxkd0t8iukag260u0q&amp;amp;dl=0<b>Skills</b>:        Android            ","link":"https://www.upwork.com/jobs/Android-Studio-Webview-RateUs-dialog-Navigation-Drawer_%7E0178066384155a7df6?source=rss","processedDate":"2024-03-18T20:19:26.517Z","postedDate":"<b>Posted On</b>: March 13, 2024 16:40 UTC","id":"0178066384155a7df6"},{"skillset":["Product Sourcing","Supplier Search","Sourcing","Market Research"],"title":"Product sourcing in Europe (Turkey included) - Upwork","description":"Hello dear,\nMy name is Mika Westenberg, the representative of Flowter. We are based out of the Netherlands and make high quality bike accessoires. \nOur website: https://flowter.co/\nI was wondering if you can find manufacturers in Europe (Turkey also included) who can supply me with:\n-Aluminium/metal bicycle chain cleaner.\nComparable product: https://www.parktool.com/en-int/product/professional-chain-scrubber-cm-25\n- Plastic bicycle chain cleaner.\nComparable product: https://www.amazon.com/Park-Tool-Cyclone-Bicycle-Scrubber/dp/B07YWQYC83/ref=sr_1_7?crid=1408J9EG84F5X&amp;amp;dib=eyJ2IjoiMSJ9.x5m7BPsVi8NmGY_ZPVY91SBecks9-fNkGcPNkgSAOvKI_--yTeFUxnsjwGocOpgBCsVRaXQ1MfvkenX9F56xzekGkUV0TWYy1GcqZaAtv5qz33f0GjY33ZwRC3eAEIK5Inbyfg1CdDiW9auk547eXl4jfIbSdgtm_e8M4tU3cWiLM0IL3bfyBGbkmaPsD_cpz6ks5Hje_EI2hMcJ95r72ZcZS7cEry-QAjZOGN94PW_m75ZxvuLEAADU4Q_amrfkIaMtTS8wsxRlTTU3GkvwjUw_dPKIQobrM-Il4pAs_Mk.yK71DCZ1B3FQ5JtSU-0Dw_ucWV0yB_coCcJfFGpa7h4&amp;amp;dib_tag=se&amp;amp;keywords=bicycle%2Bchain%2Bcleaner&amp;amp;qid=1710337061&amp;amp;sprefix=bicycle%2Bchain%2B%2Caps%2C289&amp;amp;sr=8-7&amp;amp;th=1\n- Wood cleaning brush for bike\nComparable product:\nhttps://www.amazon.com/Peatys-Unisexs-Cleaning-Brush-Brown/dp/B09NRY3BXK/ref=sr_1_16?crid=QQY3AP718BKK&amp;amp;dib=eyJ2IjoiMSJ9.sLmqEbr0k7X6Vm2h8Af0UbtHBV3QAIr9jIEAuuiCUIQevPakfHPeB3YiK6SfJVIJv5ZAMKYKhYQC1uGeNhxEznME-ioW_a-lT1AZYr81tT00fNyI2XPhzINZDj1urb-zze_bhadU6kqfPBi-Z1-tuxAjl0EorkOe2LxfaCxWSjlnBPKveaTkuqBFuTS9lK99n9TLRGz_29H1d9oIumvxKtFhm3yo65tzgeIkyg7F2CbmnUyZs38D8CC0yZ8CYV0FacpaaXhBeJluu-R8hO5vgtxWCdfUnGhbM9eNf833zjQ.czZfRSAz5fr8qYavRAn2QTSqZ0oFN7OCPUXMT84VQso&amp;amp;dib_tag=se&amp;amp;keywords=wood%2Bbike%2Bcleaning%2Bbrush&amp;amp;qid=1710337440&amp;amp;sprefix=wood%2Bbike%2Bcleaning%2Bbrush%2Caps%2C379&amp;amp;sr=8-16&amp;amp;th=1\nPlease let me know if you can just find me suppliers in Europe (Turkey is also ok). Then we will discuss price.\nThank you,\nRegards,\nMika Westenberg<b>Skills</b>:        Product Sourcing,                     Supplier Search,                     Sourcing,                     Market Research            ","link":"https://www.upwork.com/jobs/Product-sourcing-Europe-Turkey-included_%7E016f8a215096c13186?source=rss","processedDate":"2024-03-18T20:19:26.517Z","postedDate":"<b>Posted On</b>: March 13, 2024 14:07 UTC","id":"016f8a215096c13186"},{"skillset":["Software QA","Functional Testing","Performance Testing","Automated Testing","Web Testing"],"title":"QA Enginner for a b2b saas tool - Upwork","description":"Job Description:\nWe are seeking a part-time QA Engineer with experience in the martech domain to ensure our SaaS platform, meets the highest quality standards. The ideal candidate will have a strong understanding of testing methodologies and be proficient in both manual and automated testing.\nResponsibilities:\n- Develop and execute test plans to identify software issues.\n- Report bugs and errors to the development team.\n- Conduct post-release/post-implementation testing.\n- Work with cross-functional teams to ensure quality throughout the software development lifecycle.\nQualifications:\n- Proven experience as a QA tester or similar role.\n- Experience in project management and QA methodology.\n- Familiarity with Agile frameworks and regression testing is a plus.\n- Ability to document and troubleshoot errors.\n- Working knowledge of test management software (e.g., qTest, Zephyr) and SQL.<b>Skills</b>:        Software QA,                     Functional Testing,                     Performance Testing,                     Automated Testing,                     Web Testing            ","link":"https://www.upwork.com/jobs/Enginner-for-b2b-saas-tool_%7E0161b5b8dfd1928b9a?source=rss","processedDate":"2024-03-18T20:19:26.517Z","postedDate":"<b>Posted On</b>: March 13, 2024 13:33 UTC","id":"0161b5b8dfd1928b9a"},{"skillset":["Company Research","Online Research","Google Docs","Data Entry","Microsoft Excel"],"title":"Data Entry  - Upwork","description":"For our company in public safety technology, we need someone who can verify leads in a Google Sheet and add information like salutation, number of employees, custom compliment, etc.\nWe are looking for someone with high proficiency in English who can work whenever needed.\nApply by answering the following questions:\nWhere are you based?\nWhat is your background (experience/education)?\nExample of work done.\nHourly salary expectation.\nApplications without these questions answered will not be considered. \nThank you in advance.<b>Skills</b>:        Company Research,                     Online Research,                     Google Docs,                     Data Entry,                     Microsoft Excel            ","link":"https://www.upwork.com/jobs/Data-Entry_%7E010e13f20074db7e25?source=rss","processedDate":"2024-03-18T20:19:26.517Z","postedDate":"<b>Posted On</b>: March 13, 2024 13:35 UTC","id":"010e13f20074db7e25"},{"skillset":["nRF52","Hardware Design","Bluetooth","Electronics","PCB Design","Electronic Design","Circuit Design","Altium Designer"],"title":"Schematics and PCB Design Task  for IOT Sensor - Upwork","description":"CONTROL BOARD REQUIREMENTS\n* The dimensions of the Control Board should be 24x40mm.\n* It should have a minimum of 4-6 mounting holes.\n* The locations of the elements on the placement diagram should be as indicated as much as possible on the PCB.\n* All materials used on the PCB should be selected from Digikey.\n* A 3.6V battery will be used for battery operation.\n* The input voltage for External Power usage will be between 4-32V.\n* Low Power requirements should be considered in the design.\n* The selected materials must be able to operate within a minimum temperature range of -40 ~ 85&deg;C.\n* A Hall Effect sensor will be used to wake the device from sleep. Approval should be obtained when selecting the sensor. A product similar to AH1815-W-7 can be chosen.\nThe selected product should have a magnetic detection threshold greater than 20mT.\n* MDBT50Q-1MV2/MDBT50Q-U1MV2 modules will be used as the control units.\n* RGB LED pins should be connected to the PWM pins of MDBT50Q.\n* A 1.25mm Molex 2-pin or similar product should be used for the Battery Connector.\n* The NFC antenna connector from nRF52840-DK should be used for the NFC antenna connector.\n* The IO Connector should use the product: Amphenol FCI SFW16R-1STE1LF.\n* The SPI (CS, MISO, MOSI, CLK), PDM/I2S (DATA, CLK), 2xADC input, 3xDigital Input, 2xSensor Power, and GND pins should be connected to the IO connector.\n* SMD-type materials should be selected for the PCB, and they should be as small as possible.\n* When Sensor-1 and Sensor-2 power blocks are active, each channel should be able to deliver a minimum of 250mA of current.\n* If possible, Battery and External Power Blocks can be combined.\n* The power consumption of the battery measurement block should be minimized when no battery measurement is being conducted.\n* The PCB should be able to be powered from the Debug/programming connector. Reset, SWO, SWDIO, SWCLK, VDD, and VSS pins should be accessible via this connector.\n* The Winbond W25N01GW model or the 64Mb version used in the nRF52840-DK development kit can be used as the Quad Flash. \nOne of them can be preferred considering factors such as price, power consumption, and performance usage advantages. \nIt is necessary to provide information on why the preferred product is chosen.\nYou can find detailed information about the nRF52840-DK development kit on the following link:https://infocenter.nordicsemi.com/index.jsp?topic=%2Fug_nrf52840_dk%2FUG%2Fdk%2Fintro.html\n* Ideally, all materials should be on a single surface.\n* The design should be done using Altium Designer.\nMileStones:\nMilestone 1:&nbsp;&nbsp;One week for Schematics\nMilestone 2: 3 days for PCB layout\nDeliverables:\nSchematic, PCB Layout, BOM, Production files, Schematic and PCB Layout 2D and 3D component libraries should be delivered.<b>Skills</b>:        nRF52,                     Hardware Design,                     Bluetooth,                     Electronics,                     PCB Design,                     Electronic Design,                     Circuit Design,                     Altium Designer            ","link":"https://www.upwork.com/jobs/Schematics-and-PCB-Design-Task-for-IOT-Sensor_%7E0184d0d46696b4fbef?source=rss","processedDate":"2024-03-18T20:19:26.517Z","postedDate":"<b>Posted On</b>: March 13, 2024 13:27 UTC","id":"0184d0d46696b4fbef"},{"skillset":["Web Development"],"title":"Price Tracker - Upwork","description":"Hi,\nI&#039;m interested in creating a site comparison website like: https://www.pricerunner.com/\nhttps://www.stephanis.com.cy/search?q=\nhttps://www.public.cy/search?q=\nhttps://www.e-shop.cy/search?q=\nhttps://electroline.com.cy/\nhttps://andreascharalambouscy.com/?s=\nhttps://bionic.com.cy/products?keywords=\nThe user will search for a specific product, the script will search on all websites, and data that matches the search will be stored in MySQL. If the data is already stored in MySQL, only prices will be updated so we can keep a record/history of the prices per day.<b>Skills</b>:        Web Development            ","link":"https://www.upwork.com/jobs/Price-Tracker_%7E01f91207d2344c97d7?source=rss","processedDate":"2024-03-18T20:19:26.517Z","postedDate":"<b>Posted On</b>: March 13, 2024 13:05 UTC","id":"01f91207d2344c97d7"},{"skillset":["Web Testing","Functional Testing","Bug Reports","Performance Testing","Software QA","Test Case Design","Manual Testing"],"title":"Website Tester - Upwork","description":"Integration testing \nUnit testing \nFeature testing\n Web testing\nOur website is almost complete, so we need to test it in every aspect.\nHere is the figma link of it:https://www.figma.com/file/ifKfXDv8rVQtY8qQXpQLY7/TheHired-Ai?type=design&amp;amp;node-id=0-1&amp;amp;mode=design<b>Skills</b>:        Web Testing,                     Functional Testing,                     Bug Reports,                     Performance Testing,                     Software QA,                     Test Case Design,                     Manual Testing            ","link":"https://www.upwork.com/jobs/Website-Tester_%7E01615d2a68f287d98c?source=rss","processedDate":"2024-03-18T20:19:26.517Z","postedDate":"<b>Posted On</b>: March 13, 2024 11:41 UTC","id":"01615d2a68f287d98c"},{"skillset":["Candidate Sourcing","Tech &amp; IT","Python","Boolean Search","Candidate Recommendation","Candidate Source List"],"title":"Source 10 software engineers based in Germany, Leipzig  - Upwork","description":"Task:\nI want to have a list of candidates ( 15 ), contain contact details who fulfill the following criterias:&nbsp;&nbsp;\n1) 8&ndash;10 years of experience in software engineering \n2) Programming languages&#039; proficiency: SQL, Python, AzureDevOps, Flask, Linux, GIT, SQLAlchemy\n3) Based in Germany, willing to be based in Leipzig\n4) Preferably German speaker\n5) Located in Leipzig\nPlease kindly describe / answer the following questions in your proposal with your rate for this task:\nQ1) Describe your Tech recruitment experience within Europe / Germany \nQ2) How would you approach this task?\nQ3) Your desired rate\nThank you!<b>Skills</b>:        Candidate Sourcing,                     Tech &amp; IT,                     Python,                     Boolean Search,                     Candidate Recommendation,                     Candidate Source List            ","link":"https://www.upwork.com/jobs/Source-software-engineers-based-Germany-Leipzig_%7E01e71963515e9d3e36?source=rss","processedDate":"2024-03-18T20:19:26.517Z","postedDate":"<b>Posted On</b>: March 13, 2024 10:51 UTC","id":"01e71963515e9d3e36"},{"skillset":["Web Application","AI Agent Development","AI Bot","AI Development","Web Development","Web Design"],"title":"Website Development / subscription system - Upwork","description":"I would like to have a complete website made that deals with Astrology and Horoscopes. My idea is that I would like a page where the person who is dying comes up, fills out a questionnaire where we get to know their horoscope and personality traits, and then, after buying a weekly or monthly subscription, we provide them with advice and free gifts that help make this period of their life better.\nI would like to start the website in English-German-Hungarian.\nI am linking to a few sites that I would like to copy:\nhttps://asknebula.com/flow/lp/simple-registration?utm_source=google&amp;amp;utm_medium=cpc&amp;amp;utm_campaign=24-05-23-Search_Simple_reg_Brand_WW&amp;amp;utm_content=nebula_astrologer&amp;amp;utm_campaignid=20188283262&amp;amp;utm_term=nebula%20astrologer&amp;amp;flow=catalogue&amp;amp;gad_source=1&amp;amp;gclid=Cj0KCQjwncWvBhD_ARisAEb 2HW-lJDXxo2lB19hN_HaPZfeXQSCStf-_Bs5lpTIh6Q0bYj55dhJPCFEaAgVtEALw_wcB\nhttps://appnebula.co/natal-chart/gender?utm_source=google&amp;amp;utm_medium=conversions&amp;amp;utm_campaign=01-10-2024_WW_Search_Natal-Chart_Purch_tag_5&amp;amp;utm_content=nebula_horoscope_&amp;amp;_astrology&amp;amp;utm_campaignid=20934736975&amp;amp;utm_term=nebula%20horoscope%20%26%20astrology&amp;amp;quizz=app-subscription-4-7 d- trial-per-day&amp;amp;gad_source=1&amp;amp;gclid=Cj0KCQjwncWvBhD_ARisAEb2HW_tQFzI8mjSzidTkDehFgTFsL4saHA-z5_BSRUaP8j_tXrI6uOBv5YaAjOFEALw_wcB<b>Skills</b>:        Web Application,                     AI Agent Development,                     AI Bot,                     AI Development,                     Web Development,                     Web Design            ","link":"https://www.upwork.com/jobs/Website-Development-subscription-system_%7E01f52c003a4db501c6?source=rss","processedDate":"2024-03-18T20:19:26.517Z","postedDate":"<b>Posted On</b>: March 13, 2024 10:39 UTC","id":"01f52c003a4db501c6"},{"skillset":["Buying","IT Sourcing","Tech &amp; IT","English","Market Research","Microsoft Excel","Price &amp; Quote Negotiation"],"title":"Procurement Specialist for IT equipment in consumer segment - Upwork","description":"Looking for a procurement specialist for IT equipment in consumer segment. Experience in IT procurement is mandatory.\nTask:\n-\tTo find 3 supplier/ distributors only within United Arab Emirates for each brand/product\n-\tSummarize data in excel\nMandatory data:\n-\tCompany name\n-\tType (distributor/reseller)\n-\tCompany details (size, year of establishment)\n-\tContact details (name. phone, email)\n-\tLeadtime\n-\tPrice per pcs/wholesale (+MoQ)\n-\tAny other useful inforamtion\nProduct:\n-Meta Quest 3 128 gb\n-Meta Quest 3 512 gb\n-APPLE VISION PRO 256 gb\n-APPLE VISION PRO 512 gb\n-APPLE VISION PRO 1 Tb\n-Controllers Valve Index (Knuckles)<b>Skills</b>:        Buying,                     IT Sourcing,                     Tech &amp; IT,                     English,                     Market Research,                     Microsoft Excel,                     Price &amp; Quote Negotiation            ","link":"https://www.upwork.com/jobs/Procurement-Specialist-for-equipment-consumer-segment_%7E012a1ec4a5b15ee0aa?source=rss","processedDate":"2024-03-18T20:19:26.517Z","postedDate":"<b>Posted On</b>: March 13, 2024 10:33 UTC","id":"012a1ec4a5b15ee0aa"},{"skillset":["Microsoft Power Automate","Business Process Automation","Robotic Process Automation","Automation"],"title":"RPA robot for AP software - Upwork","description":"We have an saas (web-based) AP processing software used to handle incoming invoices\nWe need to automate part of the handling flow which involves running through invoics and moving data from a comment field to a specific field if the data matches certain criteria\nWe would like to have an unattended robot to do this for us several times a day\nWe do not have RPA software currently, and we are open to the choice of software but will consider the ongoing license fee for the software as part of the project cost.&nbsp;&nbsp;\nOur initial screening indicidates that Power Automate will be the by far cheapest option in terms of monthly fee, given that we will only be running 1 robot. \nYou can apply with alternative software, but then please note the likely monthly cost for that software in your comments. \nAttached is a description of the workflow the robot will have to go through. We also have a video of the flow available on https://pnoholding-my.sharepoint.com/:v:/g/personal/ask_pnorental_com/ERJsiTOmfcpAmWkiX__36PUBdkZGzLB8c1ijhwaFfNVEbQ?e=9Yh4rM<b>Skills</b>:        Microsoft Power Automate,                     Business Process Automation,                     Robotic Process Automation,                     Automation            ","link":"https://www.upwork.com/jobs/RPA-robot-for-software_%7E0104acdad6ba3c392e?source=rss","processedDate":"2024-03-18T20:19:26.517Z","postedDate":"<b>Posted On</b>: March 13, 2024 08:09 UTC","id":"0104acdad6ba3c392e"},{"skillset":["TypeScript","Tailwind CSS","React"],"title":"Front-end Development for Admin Dashboard with React and TailwindCSS - Upwork","description":"&#039;m looking to turn the attached design into a fully functional admin dashboard using React, TypeScript, Zod, and TailwindCSS. \nThe final deliverable will be clean, maintainable, and well-commented code that replicates the provided design and adheres to the following specifics:\nResponsive User Interface: The interface should match the design in the attachment and be fully responsive, ensuring compatibility across different devices and screen sizes.\nReact with TypeScript: The codebase should be developed using React functional components with TypeScript, employing best practices for readability and scalability.\nForm Validation with Zod: Utilize Zod to implement schema validation for forms, ensuring robust data validation at runtime.\nUser List and Search Feature: The admin dashboard will have a user list as shown, with the ability to search through users based on name or phone number.\nPlease review the attached design and provide a brief plan on how you would approach this project, your estimated timeline.\nhttps://www.figma.com/file/8i3KEovDQpp8I0a3E6pFsL/Front-end-Development-for-Admin-Dashboard-with-React-and-TailwindCSS?type=design&amp;amp;node-id=0%3A1&amp;amp;mode=design&amp;amp;t=8ns4mW6qKJC7csv5-1<b>Skills</b>:        TypeScript,                     Tailwind CSS,                     React            ","link":"https://www.upwork.com/jobs/Front-end-Development-for-Admin-Dashboard-with-React-and-TailwindCSS_%7E01e392daedd4317818?source=rss","processedDate":"2024-03-18T20:19:26.517Z","postedDate":"<b>Posted On</b>: March 13, 2024 06:47 UTC","id":"01e392daedd4317818"},{"skillset":["Django","React","Web Development","WordPress","Wix"],"title":"Website develop - Upwork","description":"I am looking for an experienced web developer to help develop my website for my business. Please see the link for the Figma design.\nI have not decided on the platform or language for the website, but it should be dynamic and responsive. Please let me know your recomdation. \nIt&#039;s a big plus if you have experience with SEO and can get the website in the top 5 on Google.\nThe images and text in the Figma design are not final and will be updated continuously.. I have also the UI kit for the developer. \nhttps://www.figma.com/file/GN2pVopvcqvJg6jHnh6lI9/Til-udvikler?type=design&amp;amp;node-id=0%3A1&amp;amp;mode=design&amp;amp;t=7JGkJ8qH1hsjx6wM-1<b>Skills</b>:        Django,                     React,                     Web Development,                     WordPress,                     Wix            ","link":"https://www.upwork.com/jobs/Website-develop_%7E01fa6dd3bdb84de3a7?source=rss","processedDate":"2024-03-18T20:19:26.517Z","postedDate":"<b>Posted On</b>: March 13, 2024 05:55 UTC","id":"01fa6dd3bdb84de3a7"},{"skillset":["DevOps","Linux","Troubleshooting"],"title":"Expert Devops | Infrastructure | Linux - Help with Disk I/O usage! [Bonus if fixed] - Upwork","description":"Issue:\n- Disk I/O usages on linux server that has been writing at 1.4 MB/s in the timespan of 1-3hours. \n- pls watch https://www.loom.com/share/e750ad64dc714d7c9a22d4c4ae0fb5e7?sid=618638ff-ddbc-42c9-a505-c8cdf8a46b29\n- Tech Stack: DigitalOcean | Apache | PHP | Laravel \n- Troubleshooting: iotop| iostat\nWhat we need:\n- Help our backend dev to identify the root cause of the issue\n- Many freelancers might apply, I need to confirm that you CAN help. So please share any technical message which I should pass it to the backend developer, so he might tell me &amp;quot;yes this guys might help us. lets meet with him&amp;quot;.. pls write your msg too\nHow to work:\n- access will not be given since this is temp job, so we can do the troubleshooting during meeting with the backend dev\nBonus\n- If your guidance led to fixing the issue then a $100+ bonus will be paid<b>Skills</b>:        DevOps,                     Linux,                     Troubleshooting            ","link":"https://www.upwork.com/jobs/Expert-Devops-Infrastructure-Linux-Help-with-Disk-usage-Bonus-fixed_%7E019ff55723933eaa3f?source=rss","processedDate":"2024-03-18T20:19:26.517Z","postedDate":"<b>Posted On</b>: March 11, 2024 23:50 UTC","id":"019ff55723933eaa3f"},{"skillset":["Figma","User Interface Design","Web Design","User Experience Design"],"title":"UI/UX Design for Consumer SaaS Web App - Upwork","description":"We&#039;re looking for a UI/UX designer to help us build and iterate a Figma design for our Web app.\nOur app is an interactive AI reading assistant that offers summaries, Q&amp;amp;A chat, and line-by-line jump-to-source for any website. We have 2 products:\n1. Our core product is a Chrome extension. We have a design for this that we&#039;d like to iterate on: https://tilder.ai\n2. Our secondary product is a Web app, which we need to build a design for. We&#039;ll need the most help with this.\nWe&#039;re looking for:\n- an interest in building cutting-edge ways to interact with generative AI and LLMs\n- a portfolio of past design projects\n- experience creating wireframes, designing the user interface, and ensuring the app is easy to navigate\n- willing to start with existing designs and iterate, rather than build a new design system from scratch\n- willing to be scrappy and work with pre-built component libraries: ideally Tailwind + Flowbite (though we are open to other suggestions of other libraries)<b>Skills</b>:        Figma,                     User Interface Design,                     Web Design,                     User Experience Design            ","link":"https://www.upwork.com/jobs/Design-for-Consumer-SaaS-Web-App_%7E019c3a32cae6181e8d?source=rss","processedDate":"2024-03-18T20:19:26.517Z","postedDate":"<b>Posted On</b>: March 12, 2024 23:49 UTC","id":"019c3a32cae6181e8d"},{"skillset":["Content Writing","Social Media Content","Pinterest","Copywriting","Social Media Management"],"title":"Pinterest manager / virtual assistant / copywriter needed for fashion design agency - Upwork","description":"Hello,\nWe are a fashion design agency that primarily sells digital fashion design assets. We are looking for someone to help us manage our Pinterest and to help with the bulk uploading of pins using CSV.\nhttps://www.youtube.com/watch?v=om__M-qPzsY\nWe would like this person to be able to write copy for these posts and to link them to our website as well as someone who can schedule the Pinterest posts. <b>Skills</b>:        Content Writing,                     Social Media Content,                     Pinterest,                     Copywriting,                     Social Media Management            ","link":"https://www.upwork.com/jobs/Pinterest-manager-virtual-assistant-copywriter-needed-for-fashion-design-agency_%7E01c5050f5b0ad3dce1?source=rss","processedDate":"2024-03-18T20:19:26.517Z","postedDate":"<b>Posted On</b>: March 12, 2024 22:27 UTC","id":"01c5050f5b0ad3dce1"},{"skillset":["Virtual Assistance","Shopify","Data Entry","Dropshipping"],"title":"Add 1500 Product from Amazon UK to Shopify store  - Upwork","description":"Job Description:\nWe are seeking a diligent and detail-oriented individual to assist us in adding 1500 products from Amazon UK to our Shopify store. This job entails careful attention to detail and adherence to specific guidelines outlined in the provided instructional videos.\nResponsibilities:\nWatch the provided instructional videos\nVideo 1\nhttps://www.youtube.com/watch?v=DHF7mF9q8no\nand\nVideo 2\nAfter recording the first video we found a better way to find the barcode number \nyou will use this two website to convert asin to upc or ean\nbut i prefer the first one \nhttps://asinscope.com/en/convert/asin-to-upc\nhttps://www.synccentric.com\nI made a video regarding using the second website but as i said the easiest one is the first website \nhttps://www.youtube.com/watch?v=8zV8Fjhzrjc\nto understand the requirements thoroughly.\nUpload 1500 products from Amazon UK to our Shopify store according to the guidelines outlined in the videos.\nEnsure accurate product information, including titles, descriptions, prices, and images.\nCategorize products appropriately to ensure easy navigation for customers.\nExperience with Shopify product uploading and management.\nFamiliarity with Amazon UK product listings and navigation.\nExcellent attention to detail and organizational skills.\nAbility to follow instructions carefully and efficiently.\nStrong communication skills and responsiveness.\nReliable internet connection to access Shopify store.\nDuration: This project is expected to be completed within 18 days from the start date.\nWe look forward to reviewing your proposals and working with a dedicated individual to successfully add products to our Shopify store. If you have any questions, feel free to reach out for clarification. Thank you for your interest!<b>Skills</b>:        Virtual Assistance,                     Shopify,                     Data Entry,                     Dropshipping            ","link":"https://www.upwork.com/jobs/Add-1500-Product-from-Amazon-Shopify-store_%7E011ab125f20639903c?source=rss","processedDate":"2024-03-18T20:19:26.518Z","postedDate":"<b>Posted On</b>: March 12, 2024 21:14 UTC","id":"011ab125f20639903c"},{"skillset":["Data Entry"],"title":"Find websites for 772 companies (companies provided) - Upwork","description":"In a shared Google Doc:\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;For each row, Google Search (copy + paste) the company name (column A) and the city and state \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(columns G and H) into Google to see if a website for the company pops up.&nbsp;&nbsp;\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;It should be the actual company&#039;s website.\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;DO NOT include facebook pages, yellow book, Angi, HomeAdvisor, Yelp, etc.\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;If no website is found, put an &#039;NA&#039; in column Q and move on to the next row.&nbsp;&nbsp;\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;The first 16 have been done for examples.\nPay is $25\nDue:&nbsp;&nbsp;03/15/2024<b>Skills</b>:        Data Entry            ","link":"https://www.upwork.com/jobs/Find-websites-for-772-companies-companies-provided_%7E013d2238a30b4c1438?source=rss","processedDate":"2024-03-18T20:19:26.518Z","postedDate":"<b>Posted On</b>: March 12, 2024 18:11 UTC","id":"013d2238a30b4c1438"},{"skillset":["Make.com","Microsoft Excel","Automation","Google Sheets","Airtable"],"title":"Urgent: Write Make.com automation to create Excel file from Airtable data - Upwork","description":"This is an urgent job to be done immediately.\nWe have a Products table in Airtable, including an Airtable interface where the table can be viewed.\nFrom this table, we want to create a system for users to generate Quotes. \nWe want users to use an Airtable From to select Products from the Products table, to create a new Quote in a Quotes table.\nThe Products table is approx 2000 items, each Quote to be a selection of 1-20 of these Products.\nThe quote to be generated by Airtable Form. When Quote entry is created, to trigger automation in Make.com to generate an Excel file and PDF using data from the products and Form. The Excel and PDF files to be then be uploaded into the quote entry on Airtable.\nThe quote will be generated as an Excel file with a list of the selected items in rows. Column detail will also be pulled in from the database, and contain price, image, category, size, etc.:\nhttps://www.dropbox.com/scl/fo/cz4rdui8wx9ea0a59kovp/h?rlkey=kc5q4hb7giqurbbbu6jo3etho&amp;amp;dl=0\nThe product image must be inserted in the Excel file (=IMAGE&amp;quot;&amp;quot;) is acceptable.<b>Skills</b>:        Make.com,                     Microsoft Excel,                     Automation,                     Google Sheets,                     Airtable            ","link":"https://www.upwork.com/jobs/Urgent-Write-Make-com-automation-create-Excel-file-from-Airtable-data_%7E01ae8eba01f3268d55?source=rss","processedDate":"2024-03-18T20:19:26.518Z","postedDate":"<b>Posted On</b>: March 12, 2024 18:48 UTC","id":"01ae8eba01f3268d55"},{"skillset":["Web Application","JavaScript","Web Development","Bubble.io","HTML"],"title":"Develop a calculator on our site! Bubble.io Javascript - Upwork","description":"Hey! Please have a look at the below loom video: https://www.loom.com/share/90d520199fe44d1eb415fdf4907c0a99?sid=854b7ec2-c42d-4992-a469-900c5b9e41cd\nIn this video I explain the outline of the job as well as giving examples for the calculation. You can check out the figma design and elements here;\nhttps://www.figma.com/file/eUwha5ibIDqsFNVGJOzW4u/Passief-traden-shared?type=design&amp;amp;node-id=65%3A2635&amp;amp;mode=design&amp;amp;t=qMqaGJvtxiDNJcSX-1\nROI Calculator Instructions:\nhttps://docs.google.com/document/d/1aYhktR00JOtxHhzFsYrKncpvniWYYAQu/edit?usp=drive_link&amp;amp;ouid=102222885888691674969&amp;amp;rtpof=true&amp;amp;sd=true<b>Skills</b>:        Web Application,                     JavaScript,                     Web Development,                     Bubble.io,                     HTML            ","link":"https://www.upwork.com/jobs/Develop-calculator-our-site-Bubble-Javascript_%7E0190a9832855efe5d5?source=rss","processedDate":"2024-03-18T20:19:26.518Z","postedDate":"<b>Posted On</b>: March 12, 2024 17:20 UTC","id":"0190a9832855efe5d5"},{"skillset":["Odoo","Python","PostgreSQL","JavaScript","API","Odoo Development","Python Script","CSS","HTML"],"title":"Odoo Developer - Upwork","description":"Tasks /Responsibilities.\nDesign and Develop ODOO apps (new module development and customization).\nAnalyse the Scope document.\nCreate low-level requirement documents in discussion with different teams.\nFollow best practices in Software development to ensure the readability and maintainability of the code.\nRe-use the features available in ODOO to fulfill the Scope objectives.\nCreate a custom module in ODOO to meet the specific domain requirement.\nFollow the source code checking process to maintain the code in Git Version Control.\nCollaborate with the DevOps for deployment, integration, and continuous operations.\nCarry out any third-party application integrations required.\nFollow best practices for secured Software Development.\nQualification and Skills Requirements\nStrong knowledge of Python and programming concepts.\nComplete understanding of ODOO basic flow.\nKnowledge of data models available in ODOO core.\nProven expertise in developing custom modules in ODOO .\nODOO Techno functional knowledge.\nExperience in developing latest versions of ODOO and Excellent debugging skills in Odoo.\nExperience in migrating from earlier ODOO version to new version.\nCore knowledge about the current feature available in ODOO &ndash; Sales, Purchase, CRM, Accounts, Inventory, Projects, Time-sheet, HR etc.\nKnowledge in handling ODOO front end(XML and Java Script)\nGood knowledge of PostgreSQL with ability to write SQL queries.\nView customization &ndash; work on Widgets, Wizards, Java Script, view XML etc.\nQ-Web reports creation.\nData import using ODOO import as well as custom import using Python.\nKnowledge of Version Control System like git.\nKnowledge of Linux operating system<b>Skills</b>:        Odoo,                     Python,                     PostgreSQL,                     JavaScript,                     API,                     Odoo Development,                     Python Script,                     CSS,                     HTML            ","link":"https://www.upwork.com/jobs/Odoo-Developer_%7E0163613d61373eedfd?source=rss","processedDate":"2024-03-18T20:19:26.518Z","postedDate":"<b>Posted On</b>: March 12, 2024 16:30 UTC","id":"0163613d61373eedfd"},{"skillset":["Android App Development","Mobile App Development","React Native","JavaScript","Firebase"],"title":"React Native Developer - Full Time - Upwork","description":"We are seeking for a full time React Native Developer with more than 4 years of experience for one of our SaaS based product in agri-tech. The software is a tailor-made solution for dairy farms that sells direct-to-consume and manage the sales, logistics, and shipping of their products to the subscribers of the farm.\nAbout the product\nIt&rsquo;s an on-Market product with a few B2B clients.\nOur product is set for a complete overhaul. We&#039;re talking a full redesign and the integration of new features to elevate our service and user experience.\nThe software has three components:\n1. Mobile App for the subscribers\n2. Mobile App for the drivers\n3. Web App for the Dairy Farmer himself.\nFor a detailed overview of the company and a list of job responsibilities, please refer to our document here:\nhttps://docs.google.com/document/d/1XaC9Q52f9fs2PVc7VTzT6ck0f7fSkr-uRek2yEwVIqU/edit?usp=sharing\nLink to features of the software\nhttps://docs.google.com/document/d/1bC4R8Y1IYYVgRdtIGCy3cbdFO4dM7aYeVALBS6PMMGc/edit?usp=sharing<b>Skills</b>:        Android App Development,                     Mobile App Development,                     React Native,                     JavaScript,                     Firebase            ","link":"https://www.upwork.com/jobs/React-Native-Developer-Full-Time_%7E017c5166232f557081?source=rss","processedDate":"2024-03-18T20:19:26.518Z","postedDate":"<b>Posted On</b>: March 12, 2024 13:50 UTC","id":"017c5166232f557081"},{"skillset":["Social Media Lead Generation","Lead Generation Strategy","Lead Generation","Appointment Setting","LinkedIn Campaign Manager","LinkedIn Sales Navigator","LinkedIn Lead Generation","B2B Marketing","LinkedIn Marketing","LinkedIn","LinkedIn Development","Marketing Plan","B2B Lead Generation","LinkedIn Profile","Sales Development"],"title":"LinkedIn Lead Gen Specialist - Upwork","description":"Looking for a LinkedIn Specialist to generate 10 inbound enquires a week, using the the following strategy.\nhttps://www.linkedin.com/pulse/video-how-get-maintain-10-enquiries-per-week-every-jason-squires-4e/?trackingId=nl4hOGNcTBqpKDMuursO0Q%3D%3D<b>Skills</b>:        Social Media Lead Generation,                     Lead Generation Strategy,                     Lead Generation,                     Appointment Setting,                     LinkedIn Campaign Manager,                     LinkedIn Sales Navigator,                     LinkedIn Lead Generation,                     B2B Marketing,                     LinkedIn Marketing,                     LinkedIn,                     LinkedIn Development,                     Marketing Plan,                     B2B Lead Generation,                     LinkedIn Profile,                     Sales Development            ","link":"https://www.upwork.com/jobs/LinkedIn-Lead-Gen-Specialist_%7E01c3ebb776e15edfd0?source=rss","processedDate":"2024-03-18T20:19:26.518Z","postedDate":"<b>Posted On</b>: March 12, 2024 13:41 UTC","id":"01c3ebb776e15edfd0"},{"skillset":["ClickFunnels","Landing Page","Lead Generation"],"title":"Looking for a systeme.io funnel builder... - Upwork","description":"Hi dear funnel builder!\nI created a quick video that explains exactly what I need (for native English speakers only)\nPlease watch it and let me know what you think.\nhttps://drive.google.com/file/d/1ZIqNKuWWCgVZacYtZtKBovi4XYkG7EjQ/view?usp=drivesdk\nThanks!<b>Skills</b>:        ClickFunnels,                     Landing Page,                     Lead Generation            ","link":"https://www.upwork.com/jobs/Looking-for-systeme-funnel-builder_%7E01cc88743c1b654d26?source=rss","processedDate":"2024-03-18T20:19:26.518Z","postedDate":"<b>Posted On</b>: March 12, 2024 10:38 UTC","id":"01cc88743c1b654d26"},{"skillset":["Amazon S3","JavaScript","Amazon EC2"],"title":"Issues with Loading files to S3 (through API) that are larger than 200mb - Upwork","description":"I am having issues (just started happening) uploading files to S3 through our JS Api... When we try with file less than 160 Mb - everything works ok... I suspect there is a setting either on the S3 or ec2 or tomcat (we use tomcat) that does this. HAVE YOU seen such type of problem before? - below is request that is being sent to the server \n:authority:\n......\n:method:\nPOST\n:path:\n/video/save-video-attachment?name=&amp;amp;summary=&amp;amp;description=\n:scheme:\nhttps\nAccept:\napplication/json\nAccept-Encoding:\ngzip, deflate, br\nAccept-Language:\nen-US,en;q=0.9\nCache-Control:\nno-cache\nContent-Length:\n205894783\nContent-Type:\nmultipart/form-data; boundary=----WebKitFormBoundaryUe4LjHUlNaOhhyoM\nCookie:\n....\nSec-Ch-Ua:\n&amp;quot;Chromium&amp;quot;;v=&amp;quot;122&amp;quot;, &amp;quot;Not(A:Brand&amp;quot;;v=&amp;quot;24&amp;quot;, &amp;quot;Google Chrome&amp;quot;;v=&amp;quot;122&amp;quot;\nSec-Ch-Ua-Mobile:\n?0\nSec-Ch-Ua-Platform:\n&amp;quot;macOS&amp;quot;\nSec-Fetch-Dest:\nempty\nSec-Fetch-Mode:\ncors\nSec-Fetch-Site:\nsame-origin\nUser-Agent:\nMozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/122.0.0.0 Safari/537.36\nX-Requested-With:\nXMLHttpRequest<b>Skills</b>:        Amazon S3,                     JavaScript,                     Amazon EC2            ","link":"https://www.upwork.com/jobs/Issues-with-Loading-files-through-API-that-are-larger-than-200mb_%7E0132eaf0778826e01f?source=rss","processedDate":"2024-03-18T20:19:26.518Z","postedDate":"<b>Posted On</b>: March 12, 2024 05:08 UTC","id":"0132eaf0778826e01f"},{"skillset":["Shopify","Shopify Apps","API Integration","Amazon"],"title":"Multiple marketplace integration (printify, amazon, shopify) - Upwork","description":"I sell on amazon and use printify to fulfill the orders. I also have signed up for shopify to help integrate everything.\n I am trying to find a solution for the following:\n1. Push products from shopify to amazon. \n2. Push orders from amazon/shopify to printify for fulfillment.\n3. Update order status and shipping/tracking info from printify to amazon/shopify.\nI have looked into orderdesk and some other apps like marketplace connect. Orderdesk are charging per transaction fees. I would like to possibly avoid the transaction fees and maybe pay a one time charge or even a flat monthly subscription fees.&nbsp;&nbsp;I am also open to building something from scratch. \nI have never attempted this kind of project before so I have no idea what is the scope or cost of something like this. So please send your proposals with as much detail as possible<b>Skills</b>:        Shopify,                     Shopify Apps,                     API Integration,                     Amazon            ","link":"https://www.upwork.com/jobs/Multiple-marketplace-integration-printify-amazon-shopify_%7E0153d80bbee9408ea8?source=rss","processedDate":"2024-03-18T20:19:26.518Z","postedDate":"<b>Posted On</b>: March 12, 2024 02:46 UTC","id":"0153d80bbee9408ea8"},{"skillset":["Virtual Assistance"],"title":"VA for cleaning business - Upwork","description":"\nPLEASE ANSWER QUESTIONS PRIOR TO APPLYING!\nHappy to negotiate pricing and increase to $550 p month, then $550 p month depending on performance.\nPrice is $500 USD p month, 6 hours per day, 5 days a week. \n6 hours per day from Sunday - Thursday. It is really about 4-5 hours of work even when it is busy.\nMUST have availability 9:30am-11:30pm BREAK -1:30pm-5:30pm AEST Australian time. \nBegin on $10 paid trial day.\nLooking for an experienced VA to take charge!\n- Manage basic quoting and estimates (Airtasker)\n- Roster staff for jobs (Deputy)\n- Assign details of jobs to staff\n- Maintain communications with clients\n- Keep track of clients in Google Sheets and remind them if they have upcoming appointments via Clicksend SMS, then book them in\n- Create and send invoices (Zoho Invoices), follow up with them if they haven&#039;t paid\n- Ask clients for reviews\n6 hours per day from Sunday - Thursday. It is really 4 hours of work even when it is busy.\nMUST have availability 9:30am-11:30pm BREAK -1:30pm-5:30pm Australian time. \nHere is a training guide, please let me know if this is doable and if you have any questions: https://docs.google.com/document/d/1F1xDpQ1io7oBv1UoRx2LQyvcN2MRcxP5e6qNXO9YsLU/edit?usp=sharing\n0. Can you work quickly and pay attention to details in the guide?\n1. Are you available to work 9:30am-6pm AEST Sunday-Thursday?\n2. How would you quote a 3 bedroom, 2 bathroom house general clean based off the details in the guide?\n3. How would you quote a 3 bedroom, 2 bathroom house deep clean based off the details in the guide?\n4. How would you quote a 3 bedroom, 2 bathroom house general clean with a set of windows based off the details in the guide?\n5. If a cleaner is located in Hurstville Sydney Australia and there is a job in Caringbah Sydney Australia could this be scheduled in and how long would it take travel?\n6. A regular client wants to rebook, what is the process to book them in?\n7. A new client wants to book, what is the process to book them in?\n8. When are shifts published in Deputy for regular clients?\n9. Anais has a 3 hour job scheduled tomorrow. A client for a 4 hour job requests her to clean tomorrow too. What would need to be done in this situation?\nThank you<b>Skills</b>:        Virtual Assistance            ","link":"https://www.upwork.com/jobs/for-cleaning-business_%7E01868617de9f1929be?source=rss","processedDate":"2024-03-18T20:19:26.518Z","postedDate":"<b>Posted On</b>: March 11, 2024 22:57 UTC","id":"01868617de9f1929be"},{"skillset":["App Design","UI Animation","UX &amp; UI","Interaction Design","Motion Design","Game Consultation"],"title":"UX Motion Consultant - Upwork","description":"I have a SaaS product that is under development and want to enhance the user experience with subtle animations. I am looking for a UX motion consultant to review my non-functioning prototype (in Figma) and make recommendations on where I should add little animations to make the user experience more fun and delightful.\nThe UI has already been professionally designed so I&#039;m not looking for UX/UI recommendations. I&#039;m looking to add the &amp;quot;final layer&amp;quot; of polish, using little animations to make it a more enjoyable experience. I plan to use Lottiefiles. \nThe deliverable that I&#039;m looking for would be screenshots of my screens with an arrow pointing to where you would add a little animation and a description of the animation that you would recommend adding.\nHere are some links that may be useful&hellip;\nWebsite: www.collegeease.com\nFigma Prototype:\nhttps://www.figma.com/proto/qGJqSFTZSXKv9uA885M9Nt/CollegeEase-Final?page-id=121%3A77&amp;amp;type=design&amp;amp;node-id=122-27166&amp;amp;viewport=3167%2C-4493%2C0.25&amp;amp;t=fHsRoPnoS0e3U91j-1&amp;amp;scaling=min-zoom&amp;amp;starting-point-node-id=122%3A27166&amp;amp;show-proto-sidebar=1&amp;amp;mode=design<b>Skills</b>:        App Design,                     UI Animation,                     UX &amp; UI,                     Interaction Design,                     Motion Design,                     Game Consultation            ","link":"https://www.upwork.com/jobs/Motion-Consultant_%7E01fc3a1130641bc087?source=rss","processedDate":"2024-03-18T20:19:26.518Z","postedDate":"<b>Posted On</b>: March 11, 2024 22:07 UTC","id":"01fc3a1130641bc087"},{"skillset":["Notion","Online Instruction","Communications"],"title":"Notion Expert and Personal Coach - Upwork","description":"Job Title: Notion Expert and Personal Coach\nJob Description:\nObjective: Seeking a knowledgeable and experienced Notion Expert and Personal Coach to provide comprehensive, one-on-one training in the use of Notion for team collaboration, personal time organization, and project management.\nThe ideal candidate will offer hands-on guidance through Zoom, demonstrating Notion&rsquo;s features and functionalities tailored to the client&rsquo;s specific needs.\nKey Responsibilities:\n\t1.\tPersonalized Training: Conduct live, interactive Zoom sessions to teach the client the basics and advanced features of Notion.\n\t2.\tScreen Sharing Demonstrations: Utilize screen sharing during Zoom calls to set up and demonstrate various Notion functionalities in real-time.\n\t3.\tTask and Project Management: Guide the client in setting up systems within Notion for effective team collaboration, personal life organization, and project to-do lists, including progress tracking and checklist creation.\n\t4.\tCustomized Solutions: Develop and implement Notion setups that serve as a &ldquo;second brain&rdquo; for the client, aiding in seamless information management and workflow optimization.\n\t5.\tInteractive Q&amp;amp;A: Provide opportunities for the client to ask questions and receive immediate, clear explanations and solutions.\n\t6.\tFeedback Implementation: Regularly assess the client&rsquo;s understanding and usage of Notion, making adjustments to teaching methods and Notion setups based on feedback. \nQualifications:\n\t&bull;\tProven expertise and extensive experience in using and teaching Notion.\n\t&bull;\tStrong communication skills and fluency in English.\n\t&bull;\tAbility to explain complex concepts in an easily understandable manner.\n\t&bull;\tPatience and a customer-centric approach to teaching and problem-solving.\n\t&bull;\tAvailability to begin sessions immediately and flexibility in scheduling.\nEmployment Type: Contractual, with the potential for multiple sessions based on progress and client satisfaction.\nApplication Process: Interested candidates should submit a brief description of their experience with Notion, any relevant certifications, and their availability for Zoom sessions. What&rsquo;s three plus three, please answer this so I know you read everything.\nA short demonstration of their teaching approach via Zoom may be requested as part of the interview process.\nHiring Timeline: Immediate, with selection expected to occur swiftly upon review of qualified candidates.<b>Skills</b>:        Notion,                     Online Instruction,                     Communications            ","link":"https://www.upwork.com/jobs/Notion-Expert-and-Personal-Coach_%7E01d91e4041011c1404?source=rss","processedDate":"2024-03-18T20:19:26.518Z","postedDate":"<b>Posted On</b>: March 11, 2024 21:13 UTC","id":"01d91e4041011c1404"},{"skillset":["Web Development","WooCommerce","Payment Gateway Integration","PayPal","Web Design","Adaptive Web Design","Payment Processing"],"title":"Built website with booking and payment functionalities - Upwork","description":"I need a web site for my coworking activity. The site/landing page will show:\n- the images of the coworking spaces\n- the contacts (telephone number)\n- Q&amp;amp;As\n- the differents services\n- the differents prices and subscription packages\n- the geographical position (google maps)\n- online booking possibilibilites (for a places or for a private office)\n- online payments (local mobile money[orange money, wave], paypal, credit card).<b>Skills</b>:        Web Development,                     WooCommerce,                     Payment Gateway Integration,                     PayPal,                     Web Design,                     Adaptive Web Design,                     Payment Processing            ","link":"https://www.upwork.com/jobs/Built-website-with-booking-and-payment-functionalities_%7E0144cfbeadcaa9c42a?source=rss","processedDate":"2024-03-18T20:19:26.518Z","postedDate":"<b>Posted On</b>: March 11, 2024 15:49 UTC","id":"0144cfbeadcaa9c42a"},{"skillset":["Graphic Design","Infographic","Web Design","Presentation Design","Microsoft PowerPoint","Packaging Design","Logo Design","Adobe InDesign","Figma","User Interface Design","Pitch Deck","Email Template","Label Design","Digital Marketing Materials","Print Marketing Materials"],"title":"Photo Design - Upwork","description":"Hi, \nI came across your portfolio and I&rsquo;m eager to collaborate with a designer for our food company.\nAbout Us: We specialize in offering a variety of food and beverage brands, and we&#039;re looking to enhance our marketing materials with visually appealing ad photos featuring human models. Additionally, we&#039;re in need of engaging videos and gifs to promote our diverse range of products in social media.\nWe value creativity and uniqueness. While we&#039;ve attached some examples of other brands&#039; designs for inspiration, we don&#039;t intend to copy them directly. Feel free to use your design expertise or leverage AI to create original content without any copyright concerns.\nExample Designs: [Attach example designs] \nhttps://www.pinterest.com/pin/70437487606955/\nhttps://www.pinterest.com/pin/AcqKpxxzI_kJj3Xtsrf3AcIdPMcrE03JFfTz9zEsF5RtkMSFFIfe7r340crFCDZq3vTcEHIJT4TjhSToE988Xbs/\nhttps://www.pinterest.com/pin/AeHdHRqwh5qxNSDnZKFlb5Q3NQmaIjUUrsz1Sjc6DDlfpxxG0JUJeVtjZvFAsyU6zMlB2rXkLfmlPEgyaSs7Nek/\nhttps://www.pinterest.com/pin/752312312774811300/\nhttps://www.pinterest.com/pin/970736894668454142/\nhttps://www.pinterest.com/pin/140806231855112/\nhttps://www.pinterest.com/pin/293226625757453181/\nhttps://www.pinterest.com/pin/1053138694095839041/\nhttps://www.pinterest.com/pin/1044412969815326630/\nhttps://www.pinterest.com/pin/Ae1Sakgnpa3J-pOlo88zMcQFmwJI_ykIrvxmP7D7gGSou5K8PsVTuk-GXtCJJaUwLKjacUNXGzI_lynmiSqx7EM/\nDesign Scope:\nAd Photos with Human Models\nVideos and Gifs for Product Promotion\nPlease let us know your thoughts on this project, including your availability, estimated timeline, and any initial ideas you may have.\nIf you have access to AI tools that can assist in the design process without copyright issues, we&#039;re open to exploring those options as well.\nFeel free to reach out with any questions or to discuss further details. Looking forward to your response!\nBest regards,\nAngie<b>Skills</b>:        Graphic Design,                     Infographic,                     Web Design,                     Presentation Design,                     Microsoft PowerPoint,                     Packaging Design,                     Logo Design,                     Adobe InDesign,                     Figma,                     User Interface Design,                     Pitch Deck,                     Email Template,                     Label Design,                     Digital Marketing Materials,                     Print Marketing Materials            ","link":"https://www.upwork.com/jobs/Photo-Design_%7E01cf7430b2d8405ed0?source=rss","processedDate":"2024-03-18T20:19:26.518Z","postedDate":"<b>Posted On</b>: March 11, 2024 17:28 UTC","id":"01cf7430b2d8405ed0"},{"skillset":["Microsoft Excel","Steel Detail Drawing","STAAD","Steel Structure","Structural Engineering","Reinforced Concrete Structures","Finite Element Analysis","Tekla Structures","Structural Detailing","Structural Drawing","Wooden Structure","Structural Dynamics","Residential Design"],"title":"Beam problem - Upwork","description":"Issue&#039;s\n1st. : I would like to ask you to add and display diagrams of bending moments\nand transversal force for the beam.\nSolution of moment is fine &hellip;\n2nd. : Calculate the transversal force as well T(x) and display the diagram\nalong the beam\n3rd. :\nThen you have mistake while starting calculating the beam deflection.\nBecause the equation is\nx1e (0,2l)\ny&rsquo;&rsquo;(x1)=-M(x1)/E*Jz\nand x2(0,l/2) y&rsquo;&rsquo;(x2)=-M(x2)/E*Jz\nso if you substitute moment with negative sign the result must be plus then\n4th:\nSo you must correct results of boundary constants because now they are wrong\nbecause you forgot to change signs while substituting the bending moments.\n5th:\nWhile you calculate the deflaction in the point x2=0 y(x2=0)=? where acc the\nsensor is placed. Now you should be express to bendending moment in this point\nif you con express measured q\nq is loading calculated from measured y(x2=0)= &hellip;. express q= ?\nCause you measure by acc the measured magnitude is acceleration acc y&rsquo;&rsquo;(x2=0)\nso in application you must numerically integrate this two times to be able to\ncalculate you y2(x2) the same you calculated analytically from this you can\nthen calculate current q in app according the equation you developed before.\n6th:\nYou must add calculation of dimensioning the cross-section &hellip; this is missing\nto be able to calculate the bending stress, shear stress and eqvivalent stress\nQall=?\n7th:\nIf you know eqvivalent stress the coeficient of safety is k = Re/Qall = ?<b>Skills</b>:        Microsoft Excel,                     Steel Detail Drawing,                     STAAD,                     Steel Structure,                     Structural Engineering,                     Reinforced Concrete Structures,                     Finite Element Analysis,                     Tekla Structures,                     Structural Detailing,                     Structural Drawing,                     Wooden Structure,                     Structural Dynamics,                     Residential Design            ","link":"https://www.upwork.com/jobs/Beam-problem_%7E017b103b4875d8b0e1?source=rss","processedDate":"2024-03-18T20:19:26.518Z","postedDate":"<b>Posted On</b>: March 11, 2024 15:39 UTC","id":"017b103b4875d8b0e1"},{"skillset":["Shopify","Web Design","Web Development"],"title":"Care instructions Shopify page according to the layout provided. - Upwork","description":"Please see the mockup of the care instructions page I want to update. \nhttps://www.canva.com/design/DAF_LXiNCXw/LNiuQYbx77B5Q0yo_Bd57A/edit?utm_content=DAF_LXiNCXw&amp;amp;utm_campaign=designshare&amp;amp;utm_medium=link2&amp;amp;utm_source=sharebutton \nThis is the current page \nhttps://phenxx.com/pages/care-instructions\nHere is the copy for the FAQs.\nhttps://docs.google.com/document/d/1hNKdF7HHj1q9WefkHVaQZQPH6i1ibFMFMVi5_kLS8A0/edit\nIcons:\nhttps://drive.google.com/drive/folders/1MyGbs3xrLcrS7-OWv8GAuBJEOAR69X7_?usp=drive_link\nBrand Guidelines.\nhttps://docs.google.com/presentation/d/1ZyEjJoQ1v63Te-Padb72OfiGUVCpBMvk/edit<b>Skills</b>:        Shopify,                     Web Design,                     Web Development            ","link":"https://www.upwork.com/jobs/Care-instructions-Shopify-page-according-the-layout-provided_%7E0191b811988ed9801c?source=rss","processedDate":"2024-03-18T20:19:26.518Z","postedDate":"<b>Posted On</b>: March 11, 2024 10:41 UTC","id":"0191b811988ed9801c"},{"skillset":["Project Management"],"title":"Operations Manager (Filipino Applicants Only) - Upwork","description":"Utopia is an online community (theutopia.io) for online entrepreneurs (e.g. freelancers, agency owners, ecom brand owners, etc.). Our platform is currently home to over 3,700 entrepreneurs. And we empower them (Utopians) with the tools, knowledge, and structured paths to build, grow, and scale their businesses. Joining our team means becoming part of a passionate community committed to creating value and transforming the digital marketing space.\nResponsibilities:\nhttps://docs.google.com/document/d/1xYVoGszQ7LMaTtAdRyLFOIPUTnqxm6P8vQFnIRSuZuo/edit?usp=sharing\nDesired Skills and Qualifications:\n- Proven experience in operations management and executive assistance.\n- Strong organizational and project management skills.\n- Excellent communication and interpersonal abilities.\n- Ability to document processes and quickly learn new tools.\n- A problem-solver with a keen eye for process improvements.\n- Proficiency in workflow automation tools (Zapier, Integromat, Google Scripts) is preferred.\n- Knowledge of digital marketing is advantageous.\nThe company offers:\n- A monthly fixed salary of $800\n- A working schedule of 5PM to 1AM PHT\n- Paid holidays and vacation\n- Promotion and bonuses await for the successful hire who will perform well \nApply here: https://forms.gle/eZcwx6Yd3LWS1yp48<b>Skills</b>:        Project Management            ","link":"https://www.upwork.com/jobs/Operations-Manager-Filipino-Applicants-Only_%7E013a01ed22f8a27280?source=rss","processedDate":"2024-03-18T20:19:26.518Z","postedDate":"<b>Posted On</b>: March 11, 2024 08:30 UTC","id":"013a01ed22f8a27280"},{"skillset":["Kubernetes","DevOps","Docker","CI/CD"],"title":"Need a Cloud Engineer to deploy our application on AWS server - Upwork","description":"We are currently seeking a skilled DevOps Engineer with AWS certification to spearhead the deployment of our application. You can find detailed requirements in the document provided here.\nhttps://docs.google.com/document/d/15LdSeKK9q8WAfPFtOiUTmy3Xme_QPLKG0vRZVsz7P_g/edit?usp=sharing\nEssentially, we are aiming to have our automation pipeline to have the application smoothly operational on both Beta and Test environments. We have a preliminary diagram available to facilitate your understanding of the application&#039;s architecture.\nMoreover, we require automated Slack notifications to be sent out upon successful or failed deployments. Additionally, in the event of any issues arising with the new version, a seamless rollback to the previous version is imperative. We emphasize the importance of zero downtime during the deployment process.\nFurthermore, it&#039;s crucial that no deployment occurs if unit testing fails. Ensuring the integrity of our codebase through comprehensive testing is paramount to our deployment strategy. \nAny insights or enhancements you can contribute to optimize our deployment workflow would be highly valued.<b>Skills</b>:        Kubernetes,                     DevOps,                     Docker,                     CI/CD            ","link":"https://www.upwork.com/jobs/Need-Cloud-Engineer-deploy-our-application-AWS-server_%7E012c82091396cc50e1?source=rss","processedDate":"2024-03-18T20:19:26.518Z","postedDate":"<b>Posted On</b>: March 11, 2024 06:06 UTC","id":"012c82091396cc50e1"},{"skillset":["Python","Amazon Web Services","Laravel","Apache Kafka","Serverless Computing","Vue.js","AWS IoT Core","Amazon ECS","Node.js","API Development","Amazon MWS"],"title":"Scalable Backend API Developers - Upwork","description":"Job Details\nTypeScript\nNode.js\nAmazon Web Services (AWS)\nSummary:\nJoin our team as a Back-End Developer and be part of an exciting project developing a social media app with multiple features. In this role, you will work with Typescript and AWS technologies to build a robust back-end infrastructure following a microservices and serverless architecture. The app allows users to earn rewards by watching advertisements, and scalability is a key priority. If you are passionate about developing scalable solutions, leveraging AWS services, and optimizing system performance, this opportunity is perfect for you.\nGeneral Information:\nOur company is developing a social media app that seamlessly integrates shopping services and offers users the ability to earn rewards through advertisement engagement. The back-end architecture follows a microservices and serverless approach, utilizing Typescript and AWS technologies. We prioritize scalability and have a strong focus on infrastructure responsibility, leveraging tools like Terraform for managing our working infrastructure. As a Back-End Developer, you will work in a DevOps environment and collaborate with cross-functional teams to improve and expand the existing product.\nTasks and Deliverables:\nBuild and maintain a scalable and efficient back-end infrastructure using Typescript and AWS technologies.\nDevelop microservices and leverage serverless frameworks to optimize performance and resource utilization.\nImplement the Export Media API using Node.js and TypeScript, ensuring seamless integration with the app&#039;s serverless domain and AWS SDK.\nCollaborate with third-party providers, such as banuba, imgly and byteplus for media processing and AI, to enhance system functionality.\nContinuously improve the system by revamping and refactoring existing components while ensuring compatibility and scalability.\nWork closely with the team to meet the Q1 soft launch deadline, ensuring high-quality code and seamless deployment.\nKeep testing in mind during development, ensuring robustness and reliability of the back-end functionalities.\nRequired Experience:\nStrong proficiency in Typescript and experience working with AWS services.\nFamiliarity with microservices architecture and serverless frameworks.\nSolid understanding of Node.js and experience in developing APIs.\nExperience with CI/CD pipelines, deployment automation, and version control systems.\nAbility to work in a collaborative team environment and communicate effectively.\nNice to Have Experience:\nKnowledge of Okta for authentication and authorization.\nPrevious experience in developing social media or e-commerce platforms.\nFamiliarity with Terraform for infrastructure management.\nExperience with third-party media processing and AI services.\nA strong focus on testing methodologies and ensuring system reliability.<b>Skills</b>:        Python,                     Amazon Web Services,                     Laravel,                     Apache Kafka,                     Serverless Computing,                     Vue.js,                     AWS IoT Core,                     Amazon ECS,                     Node.js,                     API Development,                     Amazon MWS            ","link":"https://www.upwork.com/jobs/Scalable-Backend-API-Developers_%7E0152c8ad100820dcda?source=rss","processedDate":"2024-03-18T20:19:26.518Z","postedDate":"<b>Posted On</b>: March 11, 2024 05:47 UTC","id":"0152c8ad100820dcda"},{"skillset":[],"title":"Data Solution architect  - Upwork","description":"AWS Glue, Redshift, Quicksigh, SageMaker, Kinesis, Amazon Q\nLocation : Kl, Malaysia ","link":"https://www.upwork.com/jobs/Data-Solution-architect_%7E01e2ba3ed226f5f9f2?source=rss","processedDate":"2024-03-18T20:19:26.518Z","postedDate":"<b>Posted On</b>: March 11, 2024 03:23 UTC","id":"01e2ba3ed226f5f9f2"},{"skillset":["Mechanical Engineering","Architectural Design","Mechanical Design"],"title":"Expert for soundproof cupboard Design for Ventilation Unit noise reduction  - Upwork","description":"We are seeking a highly skilled individual with expertise in carpentry or / and ventilation&nbsp;&nbsp;soundproofing to assist us in reducing the noise emitted by our Zehnder Q600 ventilation unit. The goal of this project is to create a serene and quiet environment by minimizing the sound from the ventilation system.\nâ—Deliverablesâ—\n. 1.**Technical Drawing:** A detailed technical drawing of a soundproof enclosure for the Zehnder Q600 ventilation unit. This drawing should include precise dimensions, specifications, and assembly instructions.\n&nbsp;&nbsp;&nbsp;\n2. **Material List:** A comprehensive list of materials required for the soundproof enclosure, focusing on effectivenessavailability, and cost-efficiency.\n&nbsp;&nbsp;&nbsp;\n3. **Additional Soundproofing Recommendations to reduce the noise by decoupling, adding silencers is also welcome \nThanks<b>Skills</b>:        Mechanical Engineering,                     Architectural Design,                     Mechanical Design            ","link":"https://www.upwork.com/jobs/Expert-for-soundproof-cupboard-Design-for-Ventilation-Unit-noise-reduction_%7E01ad7fc4882196cc0b?source=rss","processedDate":"2024-03-18T20:19:26.518Z","postedDate":"<b>Posted On</b>: March 10, 2024 21:41 UTC","id":"01ad7fc4882196cc0b"},{"skillset":["Website","Website Redesign","WordPress"],"title":"Make current draft WordPress site into a professional site - Upwork","description":"I have a draft website that i have already migrated over. I need someone to author content, insert pictures gallery, images and make it professional looking with content related to our line of business.\nhttps://q1k.e39.myftpupload.com/\nI do expect the user to author content related to Shipping and Logistics companies (as the content written is very minimal) by looking up related companies and re-organize the site in a meaningful way. \nThe user should have a great command over the English language (MUST HAVE).<b>Skills</b>:        Website,                     Website Redesign,                     WordPress            ","link":"https://www.upwork.com/jobs/Make-current-draft-WordPress-site-into-professional-site_%7E0198bbdc3d5693b4ef?source=rss","processedDate":"2024-03-18T20:19:26.518Z","postedDate":"<b>Posted On</b>: March 10, 2024 21:31 UTC","id":"0198bbdc3d5693b4ef"},{"skillset":["API Integration","Automation","Business Process Automation","Dashboard","Spreadsheet Automation","Google Sheets Automation","Data Scraping","Google Docs","CSS","API"],"title":"Dashbaord Buildout - Upwork","description":"We need to create a dashboard that extracts data from google calendar, sheets, a weather API, and QuickBooks. Please see the link below for a concept worked up in Canva.\nhttps://www.canva.com/design/DAF-9QF6zO8/BQ_Pkcco3TEIW8Bx_2qC8A/view?utm_content=DAF-9QF6zO8&amp;amp;utm_campaign=designshare&amp;amp;utm_medium=link&amp;amp;utm_source=editor<b>Skills</b>:        API Integration,                     Automation,                     Business Process Automation,                     Dashboard,                     Spreadsheet Automation,                     Google Sheets Automation,                     Data Scraping,                     Google Docs,                     CSS,                     API            ","link":"https://www.upwork.com/jobs/Dashbaord-Buildout_%7E01f9bc24e85f5557a2?source=rss","processedDate":"2024-03-18T20:19:26.518Z","postedDate":"<b>Posted On</b>: March 10, 2024 19:13 UTC","id":"01f9bc24e85f5557a2"},{"skillset":["Data Entry","Content Writing"],"title":"Create training course material for personal assistants - Upwork","description":"We are looking for a talented and creative Virtual Assistant Content Developer to join our team. This individual will be responsible for designing and curating a comprehensive list of questions and answers to serve as a benchmark or quiz for evaluating and training virtual assistants. The ideal candidate should possess a strong understanding of the capabilities and functionalities of virtual assistants, excellent research skills, and the ability to create engaging and informative content.\nResponsibilities:\nDevelop a diverse set of questions and answers covering various aspects of virtual assistant functionalities, including general knowledge, task management, problem-solving, and industry-specific inquiries.\nEnsure the content is accurate, up-to-date, and reflects the latest advancements in virtual assistant technology.\nCreate benchmarks to evaluate the performance of virtual assistants in different scenarios.\nWork closely with technical teams to understand the capabilities and limitations of virtual assistants.\nAnalyze feedback from virtual assistant interactions to identify areas for improvement and update the Q&amp;amp;A list accordingly.\nMaintain a comprehensive database of questions and answers for easy retrieval and updating.<b>Skills</b>:        Data Entry,                     Content Writing            ","link":"https://www.upwork.com/jobs/Create-training-course-material-for-personal-assistants_%7E01febde55ea2d30be4?source=rss","processedDate":"2024-03-18T20:19:26.518Z","postedDate":"<b>Posted On</b>: March 10, 2024 13:45 UTC","id":"01febde55ea2d30be4"},{"skillset":["JavaScript","CSS","HTML","Web Development"],"title":"Urgently need front-end developer to help us fix bugs on an ongoing project with tight deadline - Upwork","description":"IMPORTANT NOTE: Please only apply if you can get the job done in 10 hours from now: 5 hrs max for milestone 1 and 5 hours max for milestone 2.\nWe have this web app with a tree graphic: https://we.tl/t-1CupLEYPGW \nWe have several bugs in this app that we urgently need to fix.\n5 Bugs have to do with the app itself, and 2 bugs have to do with the integration in an R Shiny app.\nOnce Freelancer completes Milestone 1 (bugs that have to do with the app itself), we will integrate the code in an R Shiny app and send the link to Freelancer to debug Milestone 2.\nDebug for Milestone 2 will be enough from the browser dev tool : css at the classes level, and JS in the console.\nYou can find the description of the bugs right here: https://docs.google.com/document/d/1dVrQ-OuZLcL0J26gOS2hwQGsmN2QLouPTIxi8Owif28/edit<b>Skills</b>:        JavaScript,                     CSS,                     HTML,                     Web Development            ","link":"https://www.upwork.com/jobs/Urgently-need-front-end-developer-help-fix-bugs-ongoing-project-with-tight-deadline_%7E014ce85402c1c3b3d1?source=rss","processedDate":"2024-03-18T20:19:26.518Z","postedDate":"<b>Posted On</b>: March 10, 2024 13:24 UTC","id":"014ce85402c1c3b3d1"},{"skillset":["VoIP","Network Administration","System Administration","VoIP Administration","Network Equipment","VoIP Software","Avaya","Cisco Router","Cisco Meraki"],"title":"IP telephony system  - Upwork","description":"The issue is that I want to build IP telephony network in the office , the devices I have is the following:\n-\tInternet connection with ISP and connect via router\n-\tThe router has POST port that connect to PSTN \n-\tMany HP switches and Poe Switch and also Cisco Switch\n-\tMany IP phones from different vendors (Cisco , AVAYA, Huawei, grandstream) and also Polycom SoundStation.\nSide problem: \nWhen I enter the router configuration page it shows me an VOIP ip address but it does not work when I ping it by my command prompt it will not respond\nAnd the ISP say it does not enable the VOIP for us because it is different service need to paid for , if is that the case why the router is preconfigured to have their VOIP dress \nThe questions:\nQ1) could I by this only component establish IP telephony system and if no what the necessary components to be added?\nQ2) should I order SIP trunks from the ISP to establish the IP telephony system or it is not necessary and the system could work without it\nQ3) could the IP phones from different vendors connect to each other?\nQ4) is IP PBX necessary to be used for the system to work\nQ5) could I&nbsp;&nbsp;use IP PBX to connect my IP phones to the PTSN&nbsp;&nbsp;network via POTS port in the router\nQ6) could I use the cloud to handle my calls without ISP like VOIP server not related to the ISP and what service providers are the best in such solution specially in the middle east <b>Skills</b>:        VoIP,                     Network Administration,                     System Administration,                     VoIP Administration,                     Network Equipment,                     VoIP Software,                     Avaya,                     Cisco Router,                     Cisco Meraki            ","link":"https://www.upwork.com/jobs/telephony-system_%7E01e084585ba731c8dd?source=rss","processedDate":"2024-03-18T20:19:26.518Z","postedDate":"<b>Posted On</b>: March 10, 2024 06:07 UTC","id":"01e084585ba731c8dd"},{"skillset":["Node.js","React","JavaScript","Next.js"],"title":"Team of 2-4 Next.JS, Node.JS , React.JS developers (working on the same place) - Upwork","description":"Seeking a dynamic team of 2-4 developers for an intensive week-long project to enhance and refine my application. Ideal candidates will have experience working collaboratively and efficiently to meet tight deadlines, with a bonus for those familiar with POS applications.\nOur project involves a Next.js application, equipped with a comprehensive Material-UI kit, primarily focused on a Digital Menu and Backoffice Management CMS. \n**Key Objectives:**\n1. Optimize performance by removing unnecessary libraries and packages.\n2. Update existing libraries to their latest versions.\n3. Clean up the codebase by discarding unused elements.\n4. Implement a complete rebranding according to new brand guidelines.\n5. Enhance and refine the mobile interface for better responsiveness.\n6. Develop a self-onboarding process complemented by a walkthrough guide.\n7. Redesign the order module interface to improve aesthetics and usability.\n8. Integrate a comprehensive POS feature as specified by the project requirements.\nThis role demands a high level of technical skill, an eye for design, and the ability to work under pressure. If you are ready to tackle this challenge and make a significant impact on our application, we want to hear from you.<b>Skills</b>:        Node.js,                     React,                     JavaScript,                     Next.js            ","link":"https://www.upwork.com/jobs/Team-Next-Node-React-developers-working-the-same-place_%7E01966da632c91f8d17?source=rss","processedDate":"2024-03-18T20:19:27.470Z","postedDate":"<b>Posted On</b>: March 18, 2024 14:56 UTC","id":"01966da632c91f8d17"},{"skillset":["Proofreading","Vietnamese"],"title":"Proofreaders needed for Vietnamese audio transcript - Upwork","description":"Hi, we are Weavlog, a localization service provider based out of Japan: www.weavlog.com\nWe&#039;re seeking skilled proofreaders fluent in Vietnamese to review transcripts for audio files. \nWe are particularly looking for linguists who are familiar with North, South, and Central Vietnamese accents/dialects. (ONLY APPLY IF YOU MEET THIS REQUIREMENT)\nSince this is a long-term opportunity, we are looking for someone who can work at $10 per 60 minutes of audio.\nStart your application with &amp;quot;EMPOWER&amp;quot;\nHappy bidding!\nPS: We value your time, so here is a small gift! https://youtu.be/dwmJvFnU_40<b>Skills</b>:        Proofreading,                     Vietnamese            ","link":"https://www.upwork.com/jobs/Proofreaders-needed-for-Vietnamese-audio-transcript_%7E01c4da1728dbbf5892?source=rss","processedDate":"2024-03-18T20:19:27.470Z","postedDate":"<b>Posted On</b>: March 18, 2024 08:50 UTC","id":"01c4da1728dbbf5892"},{"skillset":["Food &amp; Beverage","Business with 1-9 Employees","Production Planning","Logistics Management","Business Operations","Third-Party Logistics","Supply Chain Management"],"title":"Operations and Logistics Manager - Upwork","description":"Looking for an operations manager for a beverage startup.&nbsp;&nbsp;Key responsibilities would include \n1. Maintain inventory of raw goods and finished goods counts\n2. Forecast demand of goods and raw materials based on current and future PO&#039;s \n3. Follow up and track delivery of raw goods to ensure no gaps in ordering \n4. Schedule tastings for Sales team\n5. Submit monthly reports for state filings \nSkills needed\n1. Previous supply chain and logistics management \n2. Strong use of excel and/or other business intelligence software \n3. Familiarity with alcohol distribution is a plus \n4. Available during U.S hours in order to follow up with our U.S based vendors <b>Skills</b>:        Food &amp; Beverage,                     Business with 1-9 Employees,                     Production Planning,                     Logistics Management,                     Business Operations,                     Third-Party Logistics,                     Supply Chain Management            ","link":"https://www.upwork.com/jobs/Operations-and-Logistics-Manager_%7E01dae66f9c36116dd0?source=rss","processedDate":"2024-03-18T20:19:27.470Z","postedDate":"<b>Posted On</b>: March 18, 2024 11:14 UTC","id":"01dae66f9c36116dd0"},{"skillset":["React","Node.js","JavaScript","API"],"title":"Full stack developer with strong Node and React/MaterialUI experience - Upwork","description":"We are looking to add a seasoned full-stack developer who can operate in a fast moving environment, plays well with others, is comfortable with ambiguity, and can self-manage while delivering kick-ass code.\nFor context, we are building a SaaS staff scheduling application using Node/PostgreSQL on the back-end, React/MaterialUI/Typescript on the front-end, and a Rest API in between. We have U.S.-based developers as well non-U.S. developers all using Github, Jira and Slack to get things done.<b>Skills</b>:        React,                     Node.js,                     JavaScript,                     API            ","link":"https://www.upwork.com/jobs/Full-stack-developer-with-strong-Node-and-React-MaterialUI-experience_%7E014b169e2267a12c31?source=rss","processedDate":"2024-03-18T20:19:27.470Z","postedDate":"<b>Posted On</b>: March 18, 2024 10:38 UTC","id":"014b169e2267a12c31"},{"skillset":["English","Chinese to English Translation","Subtitles","Caption","Chinese"],"title":"Are you a good Chinese to English subtitler? New on Upwork struggling to find clients? - Upwork","description":"Hi, we are a localization service provider based out of Japan\nWe regularly work on transcription, translation, &amp;amp; subtitling projects in several languages.\nOur founder started as a freelancer on Upwork. So we prioritize hiring newly joined freelancers on Upwork to help them get their first jobs, we know how hard it is!\nWe are looking for good quality Chinese talent who is struggling to get regular clients on Upwork.\nRequirements:\n1) New on Upwork. (zero or few projects)\n2) You have native fluency in Chinese and English.\n3) You have experience in translation and subtitling.\nIf you qualify above 3 steps, send us a short application with the number &amp;quot;333&amp;quot;\n**If your profile doesn&#039;t qualify for the 3 requirements you will not be considered.\nPS: We know you spent your hard earned money to apply for this job, we want to give back something valuable in return because honestly it is impossible to hire each one of you! :)\nHere are some tips to get quality clients on Upwork easily: https://youtu.be/dwmJvFnU_40<b>Skills</b>:        English,                     Chinese to English Translation,                     Subtitles,                     Caption,                     Chinese            ","link":"https://www.upwork.com/jobs/Are-you-good-Chinese-English-subtitler-New-Upwork-struggling-find-clients_%7E0128d44c7c4e0d0a67?source=rss","processedDate":"2024-03-18T20:19:27.470Z","postedDate":"<b>Posted On</b>: March 18, 2024 06:33 UTC","id":"0128d44c7c4e0d0a67"},{"skillset":["WordPress","Divi","Web Development","CSS"],"title":"WordPress DIVI Expert - Upwork","description":"I&#039;m looking for a WordPress developer who is proficient in DIVI. I have a straightforward project and all the guidelines with a reference will be provided.\nThe required page layout is clear and it has only 2-3 sections and most of the pages will use the same templates.\nOne of the required pages: Commercial HVAC Services\nhttps://docs.google.com/document/d/1Mwif7UM6BW-ht0PUrRg3If7X33uGSS1lYwcrKXwfu5E/edit?usp=sharing\nPlease apply only if you can\n- Start today\n- Provide your DIVI examples\n- Work fast to meet the deadline\nIf this project goes well I&#039;ll have more DIVI projects for you.<b>Skills</b>:        WordPress,                     Divi,                     Web Development,                     CSS            ","link":"https://www.upwork.com/jobs/WordPress-DIVI-Expert_%7E014fcbfb2edd53ff2d?source=rss","processedDate":"2024-03-18T20:19:27.470Z","postedDate":"<b>Posted On</b>: March 18, 2024 08:52 UTC","id":"014fcbfb2edd53ff2d"},{"skillset":["Communications","Project Scheduling","Project Management","Executive Support","Administrative Support","Project Timelines"],"title":"Project Manager &amp; Executive Assistant to CEO - Upwork","description":"Job Title: Project Manager &amp;amp; Executive Assistant to CEO\nOverview:\nWe are seeking an exceptionally talented and proactive Project Manager &amp;amp; Executive Assistant to the CEO. This position, with flexible hours ranging from 20 hours per week, potentially to be full-time in the future, requires a candidate with a minimum of 4 years of extensive project management experience. The ideal candidate will also possess a strong background in tech, creativity, and UI/UX design. \nAt Jubilee Media, we thrive on pushing boundaries, tackling taboos, and breaking the rules to create meaningful human connections. As a Project Manager and an Executive Assistant, you will play a pivotal role in managing our projects, ensuring seamless communication with clients, and supporting the CEO in achieving our company&#039;s goals.\nTasks:\nServe as the master timeline manager, overseeing all projects within the company.\nProactively track and manage project tasks and client needs to ensure timely delivery.\nCoordinate internal and external resources to ensure projects adhere to scope, schedule, and budget.\nMaintain quality control throughout project development to uphold our high standards.\nManage the CEO&#039;s calendar and inbox, ensuring timely and efficient communication.\nProvide comprehensive support to the CEO to accomplish business objectives.\nRequirements:\nFluent English communication skills (near-native proficiency).\nExceptional organizational skills with a keen eye for detail.\nExtensive experience setting up and managing project management tools like ClickUp, Upgrade to see actual info, etc.\nExcellent customer service skills and ability to communicate effectively with clients.\nProficient in using Slack for communication and available on WhatsApp.\nAvailability during U.S. business hours.\nMinimum of 4 years of experience as a Project Manager.\nExperienced researcher with a knack for problem-solving and creativity.\nStrong analytical skills.\nTech-savvy with experience in UI/UX design.\nNote to Candidates:\nIf you are a dynamic individual who thrives in a fast-paced environment, shares our passion for innovation, and is eager to make a meaningful impact, we encourage you to apply. \nJoin us in our mission to create content that sparks conversations and fosters empathy in today&#039;s digital landscape.<b>Skills</b>:        Communications,                     Project Scheduling,                     Project Management,                     Executive Support,                     Administrative Support,                     Project Timelines            ","link":"https://www.upwork.com/jobs/Project-Manager-amp-Executive-Assistant-CEO_%7E014256aa45beba9fac?source=rss","processedDate":"2024-03-18T20:19:27.470Z","postedDate":"<b>Posted On</b>: March 18, 2024 07:34 UTC","id":"014256aa45beba9fac"},{"skillset":["Android","Android App Development","iOS","API","Firebase"],"title":"Android App For Jobs Portal - Upwork","description":"we need to develop jobs portal android app. similar like below site\nSkillbee.com\napna.co\nworkex.jobs\nplease reply if u able to make android app as same .<b>Skills</b>:        Android,                     Android App Development,                     iOS,                     API,                     Firebase            ","link":"https://www.upwork.com/jobs/Android-App-For-Jobs-Portal_%7E01407814ea6ce4cb5e?source=rss","processedDate":"2024-03-18T20:19:27.470Z","postedDate":"<b>Posted On</b>: March 18, 2024 07:12 UTC","id":"01407814ea6ce4cb5e"},{"skillset":["WordPress","Elementor","Figma","Landing Page","Search Engine Optimization","Website Customization","Ecommerce Website","Web Design","Responsive Design","Page Speed Optimization","Web Development","Website","WordPress e-Commerce","PSD to WordPress","WordPress Development"],"title":"Website design  - Upwork","description":"\nI have an existing website. I want u to design a theme, work on the SEO and AdSense.\nPlease let me know if u can and when u r available <b>Skills</b>:        WordPress,                     Elementor,                     Figma,                     Landing Page,                     Search Engine Optimization,                     Website Customization,                     Ecommerce Website,                     Web Design,                     Responsive Design,                     Page Speed Optimization,                     Web Development,                     Website,                     WordPress e-Commerce,                     PSD to WordPress,                     WordPress Development            ","link":"https://www.upwork.com/jobs/Website-design_%7E01b31ae854b5292bb3?source=rss","processedDate":"2024-03-18T20:19:27.470Z","postedDate":"<b>Posted On</b>: March 18, 2024 07:08 UTC","id":"01b31ae854b5292bb3"},{"skillset":["C#","Java","Kotlin","Android","C++","Smartphone","Mobile App","Mobile App Development"],"title":"Open source browser for mobile  - Upwork","description":" i need a custom web browser for mobile taken from any open source that works good ! \nu should take the&nbsp;&nbsp;open source and make it in&nbsp;&nbsp;away i can add my name on it \nyour offer must write the open source you will use and the time will take u to make me the apk \n&nbsp;&nbsp;<b>Skills</b>:        C#,                     Java,                     Kotlin,                     Android,                     C++,                     Smartphone,                     Mobile App,                     Mobile App Development            ","link":"https://www.upwork.com/jobs/Open-source-browser-for-mobile_%7E016cd0cb0061011a78?source=rss","processedDate":"2024-03-18T20:19:27.470Z","postedDate":"<b>Posted On</b>: March 18, 2024 06:35 UTC","id":"016cd0cb0061011a78"},{"skillset":["macOS","Microsoft Windows","System Automation","DevOps Engineering","Business with 1-9 Employees","Amazon Web Services","API","Machine Learning","DevOps"],"title":"Setting up AWS for Algorithmic Trading - Upwork","description":"We are looking for an expert on AWS and Algorithmic Trading to help us setup AWS for our Algorithmic Trading System Development and trading.\nWe are a growing Hedge Fund and see AWS Hosting as a big opportunity for us, but we are not aware of the many possibilities of it.<b>Skills</b>:        macOS,                     Microsoft Windows,                     System Automation,                     DevOps Engineering,                     Business with 1-9 Employees,                     Amazon Web Services,                     API,                     Machine Learning,                     DevOps            ","link":"https://www.upwork.com/jobs/Setting-AWS-for-Algorithmic-Trading_%7E01ab5fff99bac6d82d?source=rss","processedDate":"2024-03-18T20:19:27.470Z","postedDate":"<b>Posted On</b>: March 18, 2024 06:22 UTC","id":"01ab5fff99bac6d82d"},{"skillset":["Network Monitoring","VMWare","Virtual LAN","Network Equipment","Business with 1-9 Employees","Network Administration","Network Design"],"title":"Networking issue - Upwork","description":"are u good at networking: connecting computers to switches with vlan and the-like?\nI need help correcting an issue somewhere in the network. This network has 2 switches, and a vCenter with 4 esxi host servers and i need to add a physical host to the vCenter. If u have good experience i can show u the issue<b>Skills</b>:        Network Monitoring,                     VMWare,                     Virtual LAN,                     Network Equipment,                     Business with 1-9 Employees,                     Network Administration,                     Network Design            ","link":"https://www.upwork.com/jobs/Networking-issue_%7E016f34cf9c7fd54e29?source=rss","processedDate":"2024-03-18T20:19:27.470Z","postedDate":"<b>Posted On</b>: March 18, 2024 05:25 UTC","id":"016f34cf9c7fd54e29"},{"skillset":["Asana","Gantt Chart","Project Management","Communications","Virtual Assistance","Research &amp; Strategy","Critical Thinking Skills","Client Management","Calendar Management","Email"],"title":"Project Manager &amp; assistant to CEO - Upwork","description":"Our team is searching for a talented and proactive Project Manager (10 - 30 hours per week) with 4+ years of previous project management experience to serve as the CEO&rsquo;s executive assistant.\nWe are looking only for THE TOP 1% of talent!\nTASKS:\n-Be the master timeline manager of our company.\n-Keep track of every single project, task, need from our clients and be VERY proactive in making sure everyone will get what they need on time.\n-Coordinate internal and external resources to ensure that projects adhere to scope, schedule, and budget.\n-Perform quality control on the project throughout development to maintain the standards expected.\n-Calendar &amp;amp; Inbox management for the CEO, make sure communications are handled in a very timely manner.\n-Doing anything that needs to be done to support the CEO in accomplishing his goals.\nREQUIREMENTS:\n-Speak &amp;amp; write FLUENT (almost native) English\n-You are super organized\n-VERY experienced setting up and managing project management tools like ClickUp, Monday.com, etc.\n-Be amazing at customer service and communicating with clients\n-Experienced using Slack for communication\n-Available to communicate via WhatsApp\n-Work U.S. business hours\n-At least 4 years of experience as a Project Manager\n-Experienced Researcher\n-Available for at least 10 hours per week\n-Proven ability to solve problems creatively\n-Excellent analytical skills\nHOURS: AT LEAST 10 hours/week\nRATE: $13.00 / hour - $22 / hour, depending on level of experience\nHOW TO RESPOND:\nReply to this job posting with a link to your resume and example of relevant work you have done.\nInclude the word &ldquo;watermelon&rdquo; in your response. Why? This lets us see who is actually paying attention.<b>Skills</b>:        Asana,                     Gantt Chart,                     Project Management,                     Communications,                     Virtual Assistance,                     Research &amp; Strategy,                     Critical Thinking Skills,                     Client Management,                     Calendar Management,                     Email            ","link":"https://www.upwork.com/jobs/Project-Manager-amp-assistant-CEO_%7E01a506d433330a057a?source=rss","processedDate":"2024-03-18T20:19:27.470Z","postedDate":"<b>Posted On</b>: March 18, 2024 04:37 UTC","id":"01a506d433330a057a"},{"skillset":["Online Research","Media Monitoring"],"title":"Media Monitoring Services  - Upwork","description":"We are looking for an analyst to provide media monitoring services for U.S. Embassy Belgrade. Work week will be from Monday-Sunday, and you must be fluent in both Serbian and English.\nExamples of your duties will be: \n-Accessing a searchable database of transcripts of major newscasts, morning shows, and interview/talk shows as identified in the appendix, extending back at least 3 months, and providing a summary by 21:00 nightly.\n-Digesting top news stories in primetime news programs broadcast between 17:00 and 20:00 in the form of transcripts of intro segments in Serbian (Latin) delivered by messenger (WhatsApp) as soon as available and in a summary e-mail by 21:00 nightly.\n-Monitor both digital and print Serbian media <b>Skills</b>:        Online Research,                     Media Monitoring            ","link":"https://www.upwork.com/jobs/Media-Monitoring-Services_%7E019999a5a93baf9537?source=rss","processedDate":"2024-03-18T20:19:27.470Z","postedDate":"<b>Posted On</b>: March 18, 2024 03:32 UTC","id":"019999a5a93baf9537"},{"skillset":["Online Research","Contact List","Market Analysis","Pricing Research","Market Research"],"title":"Pricing Research for Agency Packages  - Upwork","description":"*** Only contact us through Upwork please don&rsquo;t reach out directly or through LinkedIn or email or any other method, or else you&rsquo;ll be disqualified***\nJob Description:\nWe are a full-service digital marketing agency, specializing in services for home improvement and home services companies. To stay competitive and understand the landscape, we are seeking a skilled Pricing Research Assistant to conduct comprehensive pricing research on SEO and paid advertising services offered by other digital marketing agencies within the United States, specifically those that align closely with our niche and service offerings.\nResponsibilities:\n\t&bull;\tSecret Shopping: You will engage in secret shopping to gather detailed pricing information. This will involve contacting digital marketing agencies under the guise of a potential client to request rate cards and pricing details for SEO and paid advertising services.\n\t&bull;\tMarket Analysis: Identify and analyze the 200 largest and most relevant digital marketing agencies across diverse regions in the U.S., including the Midwest, New England, South, East Coast, and West Coast. Your methodology for determining relevancy and size must be clear and systematic.\n\t&bull;\tData Organization: Organize and present your findings in an Excel spreadsheet, including the agency&rsquo;s website and any relevant supporting information. A separate system or folder for storing supporting documents for the prices obtained will be required.\n\t&bull;\tCommunication: You may need to have limited interactions with the sales teams of these agencies to gather necessary information. It is crucial to devise strategies to obtain as much relevant information as possible without committing to lengthy sales pitches or calls, preferably through email.\nRequirements:\n\t&bull;\tProven experience in market research or similar roles, particularly in pricing research and competitive analysis.\n\t&bull;\tStrong communication and negotiation skills, with the ability to engage effectively and discreetly with sales teams.\n\t&bull;\tProficiency in Excel and data organization.\n\t&bull;\tAbility to work independently and meet tight deadlines &ndash; specifically, to deliver the research findings within 5 working days.\n\t&bull;\tKnowledge of the digital marketing industry, especially in the home services and improvement sectors, is a plus.\nDeliverables:\n\t&bull;\tA comprehensive Excel sheet with detailed pricing information of SEO and paid advertising services from the 200 identified agencies.\n\t&bull;\tA methodical approach for collecting and organizing supporting documents or evidence for the prices obtained.\nIf you have the expertise and are ready to dive into an intensive market research task with a focus on delivering actionable insights within a tight timeframe, we&rsquo;d love to hear from you.<b>Skills</b>:        Online Research,                     Contact List,                     Market Analysis,                     Pricing Research,                     Market Research            ","link":"https://www.upwork.com/jobs/Pricing-Research-for-Agency-Packages_%7E01aab5b1f5dfa287a6?source=rss","processedDate":"2024-03-18T20:19:27.471Z","postedDate":"<b>Posted On</b>: March 18, 2024 00:55 UTC","id":"01aab5b1f5dfa287a6"},{"skillset":["Web Development","App Development"],"title":"Build a platform like apphive  - Upwork","description":"\n**Job Title: Platform Development Project - Similar to AppHive**\n**Description:**\nWe are seeking an experienced and skilled developer/team to assist us in building a platform similar to AppHive. AppHive is a low-code app development platform that allows users to create mobile applications without extensive coding knowledge. We aim to create a similar platform tailored to our specific needs and requirements.\n**Responsibilities:**\n1. Collaborate with our team to understand the project requirements thoroughly.\n2. Design and develop a user-friendly platform that allows users to create mobile applications using a low-code approach.\n3. Implement necessary features and functionalities similar to AppHive, including drag-and-drop interface, pre-built templates, and integration with popular APIs.\n4. Ensure the platform&#039;s scalability, security, and performance meet industry standards.\n5. Provide regular updates on the project progress and actively communicate any challenges or roadblocks encountered.\n**Requirements:**\n1. Proven experience in developing web-based platforms or applications, preferably in the low-code/no-code space.\n2. Proficiency in relevant programming languages and frameworks, such as JavaScript, React, Node.js, etc.\n3. Familiarity with cloud platforms and services for hosting and deployment.\n4. Strong problem-solving skills and attention to detail.\n5. Excellent communication skills and ability to work collaboratively in a team environment.\n6. Previous experience with similar projects or platforms like AppHive would be a plus.\n**Duration:** Flexible, depending on the complexity of the project and mutual agreement.\n**How to Apply:**\nIf you&#039;re interested in taking on this exciting project and have the necessary skills and experience, please submit your proposal along with relevant portfolio examples demonstrating your previous work in platform development. Additionally, include any insights or ideas you may have for enhancing the proposed platform.\nWe look forward to reviewing your proposals and discussing the project further with qualified candidates.\nand finely if u have an ready source code tell me please <b>Skills</b>:        Web Development,                     App Development            ","link":"https://www.upwork.com/jobs/Build-platform-like-apphive_%7E0166f801d6e0bd8d98?source=rss","processedDate":"2024-03-18T20:19:27.471Z","postedDate":"<b>Posted On</b>: March 18, 2024 00:04 UTC","id":"0166f801d6e0bd8d98"},{"skillset":["Business with 1-9 Employees","Gorgias","Monetization","Claude","Google Workspace","ClickUp","Project Management","Data Privacy","Continuing Professional Development","KPI Metric Development"],"title":"Virtual Assistant &amp; Market Research Assistant for Expanding Consulting LLC - Upwork","description":"Virtual Assistant &amp;amp; Market Research Assistant for Expanding Consulting LLC\n**Job Description:**\nWe are on the lookout for a dynamic individual to fill a hybrid role encompassing both Virtual Assistant and Market Research Assistant duties within our innovative consulting LLC. As we advance with a significant Customer Experience (CX) consulting project for an upscale e-commerce client, your dual role will be instrumental in supporting our operations on multiple fronts. This position offers a unique opportunity to contribute to the structural and client-facing aspects of our business, playing a key role in ensuring efficient workflows and the successful execution of our projects, especially within our rapidly evolving research and development department.\n**Key Responsibilities:**\n- Efficiently utilize a suite of applications including Outlook, Shopify, Gorgias, ChatGPT / Sider, Notion, WhatsApp, and ClickUp, adhering to strict security protocols with secure VPN and Edge private browser setup.\n- Coordinate with clients and vendor partners for regular administrative tasks and manage backend organizational duties.\n- Spearhead the development of a compelling online presence to effectively showcase our consulting services and test projects for revenue potential.\n- Uphold strict compliance with U.S. and international regulations and client confidentiality, including the execution of non-disclosure agreements and completion of secure browsing practices training.\n- Facilitate clear, concise, and comprehensive communication across all channels.\n- Develop workflow maps to enhance internal efficiency, identify, and implement processes to streamline operations and boost productivity.\n- Conduct research and compile reports on market trends and strategic opportunities at regular intervals, providing timely and insightful updates.\n- Exercise creative thinking and resourcefulness in tackling complex challenges, contributing to the creation of innovative solutions and strategic initiatives.\n**Requirements:**\n- Proficient in or capable of quickly mastering the specified digital platforms and tools.\n- Exceptional organizational skills, acute attention to detail, and a solid grasp of strategic objectives.\n- Committed to data integrity and the continuous adoption of best practices for precise outcomes.\n- Skilled in identifying monetization strategies for services and in developing templates for future products and revenue streams.\n- Able to adapt to rapid shifts in industry practices and remain informed about market changes.\n**Offer:**\n- Starting pay of $5.55 per hour, with a guaranteed annual increase of at least 7%.\n- A minimum commitment of 18 work hours per week, with potential for increased involvement based on business growth and individual performance.\n- Access to paid educational opportunities to support professional growth, covering course fees and compensating time for course completion.\n- A prime opportunity for individuals looking to make a significant impact in the early stages of a consulting firm poised for substantial growth.\n**Application Process:**\nWe are eager to connect with highly capable, detail-oriented individuals passionate about contributing to a small but rapidly expanding business. If you demonstrate a capacity for significant contribution and growth, and are excited by the prospect of shaping the future of our consulting philosophy and business infrastructure from its inception, we encourage you to apply.<b>Skills</b>:        Business with 1-9 Employees,                     Gorgias,                     Monetization,                     Claude,                     Google Workspace,                     ClickUp,                     Project Management,                     Data Privacy,                     Continuing Professional Development,                     KPI Metric Development            ","link":"https://www.upwork.com/jobs/Virtual-Assistant-amp-Market-Research-Assistant-for-Expanding-Consulting-LLC_%7E0196ead8f054735da9?source=rss","processedDate":"2024-03-18T20:19:27.471Z","postedDate":"<b>Posted On</b>: March 17, 2024 21:17 UTC","id":"0196ead8f054735da9"},{"skillset":["Unity","C#","Animation","Blender","Figma"],"title":"Senior Technical Artist for Mobile Game in Unity - Upwork","description":"Are you a gamer? Are you a sports fan? Are you technical artist with Unity experience?\nGriple is a startup developing a mobile game surrounding sports.&nbsp;&nbsp;We are looking for a Senior Technical Artist who specializes in Unity.&nbsp;&nbsp;The core hours are 10am-2pm PST.&nbsp;&nbsp;Our tech stack is Unity, Firebase, and GCP.\nRequired Skills:\n- Unity (3+ years experience minimum)\n- Blender\n- C#\n- Fluent English\n- Fun Person\nPreferred Skills:\n- Firebase\n- Systems Design\n- Sports Fan<b>Skills</b>:        Unity,                     C#,                     Animation,                     Blender,                     Figma            ","link":"https://www.upwork.com/jobs/Senior-Technical-Artist-for-Mobile-Game-Unity_%7E012d65eacef8af5054?source=rss","processedDate":"2024-03-18T20:19:27.471Z","postedDate":"<b>Posted On</b>: March 17, 2024 19:49 UTC","id":"012d65eacef8af5054"},{"skillset":["Java"],"title":"Java Expert for Small Problem - Upwork","description":"A small java code need help for 1-2 hrs max , and if u available now<b>Skills</b>:        Java            ","link":"https://www.upwork.com/jobs/Java-Expert-for-Small-Problem_%7E01cd3822c8c9927ebc?source=rss","processedDate":"2024-03-18T20:19:27.471Z","postedDate":"<b>Posted On</b>: March 17, 2024 16:13 UTC","id":"01cd3822c8c9927ebc"},{"skillset":["C#"],"title":"Xamarin Developer Wanted (Re Advertised) - Upwork","description":"This is a position for some one looking for part time Xamarin Development work. You would be working from a figma file... You will have good coding skills...with commenting your code through out... Pay to be fixed but it would be based on Indian Rates...To make a clear understanding... the rate will not exceed 3 Lacs INR for 6mths. The expected number of hrs is 150/mth. YOU would be working for 6 mths at this rate\nNOT ON ONE APP.... pls read carefully... if u dont understand Ask&nbsp;&nbsp;OK&nbsp;&nbsp;&nbsp;\nSo people from US need not apply as it would be a waste of time talking with u...Hope you understand. Thank you for reading this post.<b>Skills</b>:        C#            ","link":"https://www.upwork.com/jobs/Xamarin-Developer-Wanted-Advertised_%7E015ed61127c0155586?source=rss","processedDate":"2024-03-18T20:19:27.471Z","postedDate":"<b>Posted On</b>: March 17, 2024 15:01 UTC","id":"015ed61127c0155586"},{"skillset":["Android","Mobile App Development","Java","Kotlin"],"title":"Android app that opens browser - Upwork","description":"i have an andorid app that&nbsp;&nbsp;opens&nbsp;&nbsp;openapi&nbsp;&nbsp;website&nbsp;&nbsp;(check screen shot)\nas u can see it reject the browser that the developer made on my app \ni need to fix it \n i need a browser comtrol that is not blocked by&nbsp;&nbsp;openapi and bing<b>Skills</b>:        Android,                     Mobile App Development,                     Java,                     Kotlin            ","link":"https://www.upwork.com/jobs/Android-app-that-opens-browser_%7E0156598b2badfa6a02?source=rss","processedDate":"2024-03-18T20:19:27.471Z","postedDate":"<b>Posted On</b>: March 17, 2024 14:41 UTC","id":"0156598b2badfa6a02"},{"skillset":["PCB Design","Electronic Design","Embedded System","Altium Designer"],"title":"Design a PCB for a sensor node - Upwork","description":"Hello Upwork! I need a PCB designed for a project that I am working on myself. The major components that I envision to be used in the PCB are:\n1. A microcontroller that preferably has both BLE and WiFi capability. Probable candidates are one of the ESP32 or nordic variants but I am open to suggestions\n2. A PPG sensor. The one I am looking at is the MAX30101 but again I am open to suggestions if you have a cheaper/better option\n3. An integrated battery. This PCB will be used to acquire medical data and should not have any dangling wires, hence the need for a battery. I am open to making this as simple as just popping in one of those small lithium ion batteries used in car remotes etc and replacing them when needed. OR if its not too much of a difference, I am also open to something where the battery can be recharged\n4. This last requirement is not about the PCB itself. I want the PCB to be enclosed in some sort of plastic container to make it a little more presentable in the setting that I will use it in to acquire data\nThese are the major requirements I have. I am basically looking for someone who can first finalize the components and associated circuitry (around the uC or for the battery). And then design a neat double sided PCB with a minimal footprint which can then be sent to some online PCB manufacturer or which I can give to someone locally to have a few copies made.\nWe will probably do a few iterations of this PCB by adding more components and trying to do size reduction and other optimization. I am also open to some support on the microcontroller programming if you are interested but the current description is the starting point. In your proposal to me, please include some details of your plan in terms of what components you are thinking, the estimated timeline and any prior projects which showcase your abilities.\nStudents and new freelancers are welcome to apply as long as they are confident in their ability to handle the above requirements. Cheers! <b>Skills</b>:        PCB Design,                     Electronic Design,                     Embedded System,                     Altium Designer            ","link":"https://www.upwork.com/jobs/Design-PCB-for-sensor-node_%7E01a2613abefcdad99c?source=rss","processedDate":"2024-03-18T20:19:27.471Z","postedDate":"<b>Posted On</b>: March 17, 2024 10:22 UTC","id":"01a2613abefcdad99c"},{"skillset":["Python","GIS","Remote Sensing"],"title":"GIS developer familiar with GEE python api to develop solution based on open source library - Upwork","description":"I need a developer familiar with python, GEE api for python and remote sensing to use this model https://github.com/Open-ET/openet-ssebop from the OpenET project and feed it my own weather data (Reference ET, temp etc.) from weather stations to calculate ET for regions outside of the U.S.<b>Skills</b>:        Python,                     GIS,                     Remote Sensing            ","link":"https://www.upwork.com/jobs/GIS-developer-familiar-with-GEE-python-api-develop-solution-based-open-source-library_%7E01e3a968fff78e4c9b?source=rss","processedDate":"2024-03-18T20:19:27.471Z","postedDate":"<b>Posted On</b>: March 17, 2024 05:12 UTC","id":"01e3a968fff78e4c9b"},{"skillset":["Ecommerce Website","Landing Page","Web Development"],"title":"Simple E-Commerce Site with Landing Page - Upwork","description":"I am looking for an e-commerce website that is gated behind a customer login.&nbsp;&nbsp;I want this customer account to be setup by me with an email to the customer to complete the setup.&nbsp;&nbsp;I will have a couple dozen items available.&nbsp;&nbsp;The backend needs to be easy and we should be able to track order fulfillment. I am open to whatever platform.&nbsp;&nbsp;Monthly cost is a factor and we want to keep the cost down.&nbsp;&nbsp;No shipping options are necessary. I want something that looks similar to this:\nhttps://shop.fls2u.com/home\nhttps://shop.fls2u.com/guest-productlist<b>Skills</b>:        Ecommerce Website,                     Landing Page,                     Web Development            ","link":"https://www.upwork.com/jobs/Simple-Commerce-Site-with-Landing-Page_%7E01eb5747dd99e0e251?source=rss","processedDate":"2024-03-18T20:19:27.471Z","postedDate":"<b>Posted On</b>: March 17, 2024 04:44 UTC","id":"01eb5747dd99e0e251"},{"skillset":["Amazon FBA","Market Research","Amazon Webstore","Amazon Web Services","Marketing Strategy","Amazon PPC","Search Engine Optimization","SEO Keyword Research","Amazon Seller Central","Amazon"],"title":"Amazon FBA specialist  - Upwork","description":"we are looking for an amazon expert to help us to build our fba company in the u.s<b>Skills</b>:        Amazon FBA,                     Market Research,                     Amazon Webstore,                     Amazon Web Services,                     Marketing Strategy,                     Amazon PPC,                     Search Engine Optimization,                     SEO Keyword Research,                     Amazon Seller Central,                     Amazon            ","link":"https://www.upwork.com/jobs/Amazon-FBA-specialist_%7E01f36f854fb4c64245?source=rss","processedDate":"2024-03-18T20:19:27.471Z","postedDate":"<b>Posted On</b>: March 17, 2024 03:57 UTC","id":"01f36f854fb4c64245"},{"skillset":["React","Python","Web Application","HTML"],"title":"Create a minimized React Frontend, for an existing small Python server - Upwork","description":"Background:\nI currently have a simple local client-server solution: a backend in plain Python (Uvicorn web server), and a Jinja2 UI template that has 2-3 pages.\nHere is a ~30 second video that demonstrates everything I have: https://drive.google.com/file/d/1wArWFH4Le9U7ugA8SMaRF_gLeoJJskaR/view?usp=sharing\nNote that at the end you see that for each text that returns from the server (every 4 seconds), there is also a printout to the console with additional data from the server for each text: (a) Color, (b) Title, (c) Image URL\nObjective:\nI would like you to implement a different Frontend for this simple server.\nNo logic changes are required at the backend side. It should work as it is today, but with a proper React Frontend framework and better look.\nFigma screens are provided, and so will the design assets.\nDetailed Requirements in the attached 1-pager.<b>Skills</b>:        React,                     Python,                     Web Application,                     HTML            ","link":"https://www.upwork.com/jobs/Create-minimized-React-Frontend-for-existing-small-Python-server_%7E01fdbbaf455efbe935?source=rss","processedDate":"2024-03-18T20:19:27.471Z","postedDate":"<b>Posted On</b>: March 16, 2024 23:58 UTC","id":"01fdbbaf455efbe935"},{"skillset":["ESP32","Firmware","Arduino","Firmware Programming","Embedded System","Assembler","Assembly Language"],"title":"ESP32 ULP coprocessor firmware - Upwork","description":"Looking for ESP32 developer that has experience with ESP32-WROOM-32 microcontroller and its ULP coprocessor. Firmware implementation is required in Arduino IDE, target Arduino Core 2.0.4 (stable release). There will be used ulptool from Github user duff2013. Easy implementation I will be able to change later.\nThe goal is to have ESP32 main CPU in deep sleep and it will be possible to wake it up using ULP coprocessor only. Coprocessor itself will execute its code once per 15 minutes and will perform measurement using ultrasonic distance sensor.\nAfter measurement is performed, it will wake up the main PCB and will pass these data to the main ESP32 CPU using RTC_SLOW memory.\nCoprocessor needs to use 2 RTC_GPIO pins for HC-SR04 (or any other such as JSN-SR04T) sensor with Trigger and Echo signals.\nBasically pseudo code, ULP coprocessor needs to execute:\n&nbsp;&nbsp;trigPin = RTC_GPIO_XX\n echoPin = RTC_GPIO_XY\n&nbsp;&nbsp;pinMode(trigPin, OUTPUT);\n&nbsp;&nbsp;pinMode(echoPin, INPUT);\n&nbsp;&nbsp;digitalWrite(trigPin, HIGH);\n&nbsp;&nbsp;delayMicroseconds(10); //10 uS pulse\n&nbsp;&nbsp;digitalWrite(trigPin, LOW);\n&nbsp;&nbsp;duration = pulseIn(echoPin, HIGH); //count milliseconds until on that pin is HIGH, timeout 1 second, if nothing measured, save 0 and pass this data to the main CPU\n&nbsp;&nbsp;distance = duration * 0.034 / 2;<b>Skills</b>:        ESP32,                     Firmware,                     Arduino,                     Firmware Programming,                     Embedded System,                     Assembler,                     Assembly Language            ","link":"https://www.upwork.com/jobs/ESP32-ULP-coprocessor-firmware_%7E01c0e4555cdd045bea?source=rss","processedDate":"2024-03-18T20:19:27.471Z","postedDate":"<b>Posted On</b>: March 16, 2024 23:47 UTC","id":"01c0e4555cdd045bea"},{"skillset":["C++","C","Encryption","Microsoft Windows","Assembly Language"],"title":"PE Packer x86 x64 for protection and anti reverse - Upwork","description":"I require a proficient programmer to develop a PE packer primarily focused on implementing anti-reversing techniques and compression. This tool must be compatible and functional with Windows operating systems. That tool can protect x86 also x64 executable files also be fully compatible with .net 3.5+ also native. I prefer only C++ or C with asm.Simple CLI without GUI which can accept a few params.\nAlso i need two stubs one public one private.\nKey Requirements:\n- Excellent understanding of PE files\n- Extensive experience with anti-reversing techniques\n- Polymorphic or Metamorphic stub for better protection\n&nbsp;&nbsp;(every build need be unique = Poly or meta engine)\n- Pure clear native windows apis + indirect syscall&nbsp;&nbsp;\n- Dont use 3rd libs exception for zlib,lzma etc for compression \n- Final output executable must be run under win 7+ and higher\nIdeal Skills:\n- Previous work with PE packers\n- Proficiency in relevant programming languages, for example C++,C,ASM\n- Detail oriented to ensure the efficiency of the packer&#039;s code virtualization feature\n- Compression + encryption based on key \nThis project, though challenging, promises the software&#039;s robustness and security against reversing efforts - an asset in today&#039;s technology ecosystem.\n+ Full Source code\n+ Simple Documentation\n+ F U D\n+ Full VS Project which i can compile or with your helping maybe other IDE\nPlease send me a offer only if u have a briliant skills on PE format and Programing.This tool will be used for protection our own client executables\nThanks and send me a your portfolio.... <b>Skills</b>:        C++,                     C,                     Encryption,                     Microsoft Windows,                     Assembly Language            ","link":"https://www.upwork.com/jobs/Packer-x86-x64-for-protection-and-anti-reverse_%7E01a6b3095da57911cd?source=rss","processedDate":"2024-03-18T20:19:27.471Z","postedDate":"<b>Posted On</b>: March 15, 2024 18:15 UTC","id":"01a6b3095da57911cd"},{"skillset":["Figma","WordPress","WooCommerce","Divi","CSS","Responsive Design","Elementor","Website Customization","WordPress e-Commerce","WordPress Development","Virtual Assistance","Website Builder","Ecommerce Website","Website Migration","Website Optimization"],"title":"Copy a web site - Upwork","description":"I need someone with the skills to copy a site can u do that ?<b>Skills</b>:        Figma,                     WordPress,                     WooCommerce,                     Divi,                     CSS,                     Responsive Design,                     Elementor,                     Website Customization,                     WordPress e-Commerce,                     WordPress Development,                     Virtual Assistance,                     Website Builder,                     Ecommerce Website,                     Website Migration,                     Website Optimization            ","link":"https://www.upwork.com/jobs/Copy-web-site_%7E017f9b4c244d2ecb94?source=rss","processedDate":"2024-03-18T20:19:27.471Z","postedDate":"<b>Posted On</b>: March 16, 2024 15:35 UTC","id":"017f9b4c244d2ecb94"},{"skillset":["C#"],"title":"Xamarin Developer Wanted - Upwork","description":"This is a position for some one looking for part time Xamarin Development work. You would be working from a figma file... You will have good coding skills...with commenting your code through out... Pay to be fixed but it would be based on Indian Rates...To make a clear understanding... the rate will not exceed 3 Lacs INR for 6mths. The expected number of hrs is 150/mth.&nbsp;&nbsp;\nSo people from US need not apply as it would be a waste of time talking with u...Hope you understand. Thank you for reading this post.<b>Skills</b>:        C#            ","link":"https://www.upwork.com/jobs/Xamarin-Developer-Wanted_%7E0125b0d83662e27a19?source=rss","processedDate":"2024-03-18T20:19:27.471Z","postedDate":"<b>Posted On</b>: March 16, 2024 14:40 UTC","id":"0125b0d83662e27a19"},{"skillset":["WordPress Multisite","JavaScript","PHP","CMS Development","AWS Systems Manager","Full-Stack Development","LearnDash","WordPress Theme","WordPress Plugin","WordPress Malware Removal","Website Redesign","WooCommerce","jQuery","WordPress","Web Hosting","Ecommerce Website Development"],"title":"PodrÅ¡ka za Word Press i WooCommerce - Upwork","description":"Zdravo Milo&scaron;e,\ntrenunto smo u izgradnji web prodavnice. Potrebna nam je podr&scaron;ka oko pode&scaron;avanja Word Pressa i WooCommerca. Ukoliko si zainterosavan moÅ¾emo da dogovorimo sastanak gde bih mogao da ti vi&scaron;e informacija.\nDragan ManojloviÄ‡<b>Skills</b>:        WordPress Multisite,                     JavaScript,                     PHP,                     CMS Development,                     AWS Systems Manager,                     Full-Stack Development,                     LearnDash,                     WordPress Theme,                     WordPress Plugin,                     WordPress Malware Removal,                     Website Redesign,                     WooCommerce,                     jQuery,                     WordPress,                     Web Hosting,                     Ecommerce Website Development            ","link":"https://www.upwork.com/jobs/Podr-Word-Press-WooCommerce_%7E016ef10e65bf18fa02?source=rss","processedDate":"2024-03-18T20:19:27.471Z","postedDate":"<b>Posted On</b>: March 16, 2024 12:57 UTC","id":"016ef10e65bf18fa02"},{"skillset":["Ecommerce","Digital Marketing","Virtual Assistance","Research &amp; Strategy","Competitive Analysis"],"title":"Marketing Assistant For Agency Owner (A Player at following and optimising SOPs)  - Upwork","description":"Im looking for a high energy, great communicative Virtual assistant that can help me apply for jobs on upwork and create a specific type of content for my linkedin. \nI will of course provide SOPs for both tasks, that will enable you to follow a step by step process to complete both tasks efficiently.&nbsp;&nbsp;\nI have 2 agencies, both help e-commerce brands, one is more specific to the fitness niche, while the other is general e-commerce. \nI will link both below. \nTask 1:&nbsp;&nbsp;Will require you to look for jobs on upwork that qualify as a potential client (instructions included in SOP), then apply to the job role, using the Messaging from the SOP. \nTask 2:&nbsp;&nbsp;Will require you to select successful e-com brands from a list (guide to select will be included in SOP) then use a competitor analysis tool (Access will be shared) to collect screenshots of their ads, emails and landing page, and add these to a digital white board such as Milanote (another tool), so that it ultimately shows the marketing funnel of the brand.&nbsp;&nbsp;\nExample: https://miro.com/app/board/uXjVN5ygwpk=/?utm_campaign=Landing%20Page%20or%20Form%20-%206295410&amp;amp;utm_medium=email&amp;amp;utm_source=convertkit\n(dont worry about the green insights I will be writing those, you main task is collecting and mappign so i can focus on analysing and providing insight. \nDeliverables will be: \n1. Apply to 10+ jobs on upwork per day. (task 1)\n2. Create 7+ Competitor Funnel Maps\n3. LinkedIn scheduling (future task to be added) \nIf this sounds like a job you&#039;ll excel in, apply and lets chat further <b>Skills</b>:        Ecommerce,                     Digital Marketing,                     Virtual Assistance,                     Research &amp; Strategy,                     Competitive Analysis            ","link":"https://www.upwork.com/jobs/Marketing-Assistant-For-Agency-Owner-Player-following-and-optimising-SOPs_%7E012b66cdb5e4b89311?source=rss","processedDate":"2024-03-18T20:19:27.471Z","postedDate":"<b>Posted On</b>: March 16, 2024 10:43 UTC","id":"012b66cdb5e4b89311"},{"skillset":[".NET Framework","Python","C++","Java","API Integration","Node.js"],"title":"High-Frequency Trading Software Developer for Centralized Exchange Integration - Upwork","description":"Description:\nWe are in need of a skilled and experienced developer to create a high-frequency trading tool that seamlessly integrates with centralized exchanges via API keys. The goal is to enable automated buy/sell orders programming without significantly impacting the market price. This project requires expertise in high-frequency trading algorithms, API integration, real-time data processing, and optimization for rapid execution.\nResponsibilities:\n1. Develop a high-frequency trading tool that integrates with centralized exchanges via API keys.\n2. Implement high-frequency trading algorithms and strategies to execute buy/sell orders efficiently.\n3. Ensure the tool&#039;s performance is optimized for low-latency execution and high throughput.\n4. Integrate APIs for seamless connectivity with the targeted centralized exchange.\n5. Design and implement features to minimize market impact while executing trades.\n6. Collaborate with team members to design, test, and deploy new features and enhancements.\nRequirements:\n1. Proven experience in developing high-frequency trading tools or similar trading software.\n2. Proficiency in programming languages such as Python, C++, or Java.\n3. Strong understanding of financial markets, trading concepts, and order types.\n4. Experience with API integration and exchange protocols (REST, WebSocket, etc.).\n5. Knowledge of data structures, algorithms, and system design principles.\n6. Excellent problem-solving skills and ability to troubleshoot complex issues.\n7. Effective communication skills and ability to work collaboratively in a team environment.<b>Skills</b>:        .NET Framework,                     Python,                     C++,                     Java,                     API Integration,                     Node.js            ","link":"https://www.upwork.com/jobs/High-Frequency-Trading-Software-Developer-for-Centralized-Exchange-Integration_%7E01e43988b86abe23d1?source=rss","processedDate":"2024-03-18T20:19:27.471Z","postedDate":"<b>Posted On</b>: March 16, 2024 05:39 UTC","id":"01e43988b86abe23d1"},{"skillset":["Communications","Market Research","English","Communication Skills","Customer Acquisition","Consumer Research","Travel &amp; Hospitality","Travel","Nonprofit Organization","Cold Email","Finnish"],"title":"Charity Scout for U.K. wanted ðŸ¤  - Upwork","description":"We are seeking adventurous and dedicated freelancers who would like to work as Charity Scouts for Sobbatical Impact Travel (https://sobbatical.com) for the U.K.. Sobbatical is the world&#039;s first one-stop-shop for cross-border volunteering. Breaking away from the daily grind, traveling, experiencing exciting countries, cultures and passionate individuals, personal growth, and making a positive contribution to our future &ndash; that&#039;s Sobbatical. Do you want to be part of our journey to become Europe&#039;s leading platform for volunteering across borders?\nFor this job, you will:\n- Research and identify nonprofit organisations as business partners based in the U.K. in the areas of Social Commitment, Animal Welfare, Environmental Protection, Art &amp;amp; Culture and Diversity &amp;amp; Inclusion.\n- Proactively approach potential partner organisations and persuade them to become Sobbatical&#039;s partners. No worries, Sobbatical is a completely free of charge service for charities - no shady sales techniques required, just the right portion of kindness and persuasiveness! \n- You will embody and radiate our company values of Inclusion, Collaboration and Service when interacting with potential partner organisations.\n- Main tasks will be: online (or offline) research, cold contact via e-mail, answering questions. Sobbatical supports with a range of templates, FAQs and a 24/7 contact. \nYou bring to the table:\n- A passion for travel and charitable work.\n- Effective communication skills and persuasiveness to convince potential NPOs of the benefits of our platform.\n- An independent and proactive approach to identifying and approaching NPOs.\nWhat&#039;s in it for you?\n- Commission for each successfully recruited nonprofit organisation for Sobbatical Impact Travel plus a bonus once a defined amount of acquisitions has been achieved.\n- You define your pace! After a quick onboarding, you will get equipped with all relevant tools to start. You define your time investment and schedule. \n- The opportunity to become part of a dedicated Scouts Team, composed of travel-enthusiastic world improvers, to assist in building the largest network for cross-border volunteer work, for a better world-life balance.\nIf you are interested in an exciting role as a Charity Scout at Sobbatical Impact Travel and would like to combine your passion for social engagement with your adventurous spirit, drop a message! <b>Skills</b>:        Communications,                     Market Research,                     English,                     Communication Skills,                     Customer Acquisition,                     Consumer Research,                     Travel &amp; Hospitality,                     Travel,                     Nonprofit Organization,                     Cold Email,                     Finnish            ","link":"https://www.upwork.com/jobs/Charity-Scout-for-wanted_%7E0113674926ef0214a7?source=rss","processedDate":"2024-03-18T20:19:27.471Z","postedDate":"<b>Posted On</b>: March 15, 2024 21:38 UTC","id":"0113674926ef0214a7"},{"skillset":[],"title":"Puppeteer  &amp; aws lambda - Upwork","description":"Install Puppeteer in aws lambda\nand manage to open a webpage and copy it code\nwebpage has alot javascript execution\nnewcomes welcome, will leave u good review for this job.","link":"https://www.upwork.com/jobs/Puppeteer-amp-aws-lambda_%7E01ec66edd1799daca1?source=rss","processedDate":"2024-03-18T20:19:27.471Z","postedDate":"<b>Posted On</b>: March 15, 2024 21:30 UTC","id":"01ec66edd1799daca1"},{"skillset":["Accuracy Verification","Data Mining","Data Entry","Google Search","Microsoft Excel"],"title":"3/21 Deadline: Railroad Headquarter Addresses - Upwork","description":"We have a list of 349 railroad companies in the U.S. that we would like to gather Headquarter Addresses for. We will need to make sure that the addresses are physical addresses and not Post Office Box numbers. We will also need to verify that these are the actual addresses of the railroads HQ. There is a chance that there will be more than 1 address, if you come across this, please include all addresses you find. \nPlease keep track of this in an excel spreadsheet with the following Column Headings (in this order):\nCompany Name, Address 1, Address 2, etc.<b>Skills</b>:        Accuracy Verification,                     Data Mining,                     Data Entry,                     Google Search,                     Microsoft Excel            ","link":"https://www.upwork.com/jobs/Deadline-Railroad-Headquarter-Addresses_%7E01ed36a2d23231a2ed?source=rss","processedDate":"2024-03-18T20:19:27.472Z","postedDate":"<b>Posted On</b>: March 15, 2024 19:57 UTC","id":"01ed36a2d23231a2ed"},{"skillset":["OpenAI API","Python"],"title":"Build endpoint that uses OpenAI to anonymize resumes  - Upwork","description":"Write a Google Colab notebook in Python using the OpenAI API. \nThe notebook must allow you to pass in a LinkedIn URL and then return an anonymized version of the LinkedIn profile in plain text. \nUse this structure for anonymizing the profile: https://docs.google.com/document/d/16KBKpQNlI5MUaV5xQa2YjDoZ7BP4VJsHlChNyU7gn1I/edit?usp=sharing<b>Skills</b>:        OpenAI API,                     Python            ","link":"https://www.upwork.com/jobs/Build-endpoint-that-uses-OpenAI-anonymize-resumes_%7E013bd9c74629e90747?source=rss","processedDate":"2024-03-18T20:19:27.472Z","postedDate":"<b>Posted On</b>: March 15, 2024 19:54 UTC","id":"013bd9c74629e90747"},{"skillset":["jQuery","WordPress","JavaScript"],"title":"Quick task in Jquery &amp; Wordpress - Upwork","description":"Hi,\ni want to add this jquery library &amp;quot;http://www.croppic.net/&amp;quot; that crap and retate an image before upload it to my wordpress page.\ni need it asap.\nThank u<b>Skills</b>:        jQuery,                     WordPress,                     JavaScript            ","link":"https://www.upwork.com/jobs/Quick-task-Jquery-amp-Wordpress_%7E01f0848508dd5cfc36?source=rss","processedDate":"2024-03-18T20:19:27.472Z","postedDate":"<b>Posted On</b>: March 15, 2024 14:10 UTC","id":"01f0848508dd5cfc36"},{"skillset":["Ecommerce Website","Shopify","WooCommerce","Graphic Design","Front-End Development","Back-End Development"],"title":"ÐžÐ±Ð½Ð¾Ð²Ð»ÐµÐ½Ð¸Ðµ Ð²ÐµÐ±ÑÐ°Ð¹Ñ‚Ð° Ð±Ñ€ÐµÐ½Ð´Ð° Eternal - Upwork","description":"Ð’ Ñ€Ð°Ð¼ÐºÐ°Ñ… Ð¾Ð±Ð½Ð¾Ð²Ð»ÐµÐ½Ð¸Ñ Ð²Ð¸Ð·ÑƒÐ°Ð»ÑŒÐ½Ð¾Ð¹ ÐºÐ¾Ð½Ñ†ÐµÐ¿Ñ†Ð¸Ð¸ Ð±Ñ€ÐµÐ½Ð´Ð° Eternal Ð±Ñ‹Ð»Ð¾ Ð¿Ñ€Ð¸Ð½ÑÑ‚Ð¾ Ñ€ÐµÑˆÐµÐ½Ð¸Ðµ Ð¾ Ñ€Ð°Ð·Ñ€Ð°Ð±Ð¾Ñ‚ÐºÐµ Ð¾Ð±Ð½Ð¾Ð²Ð»ÐµÐ½Ð½Ð¾Ð¹ Ð²ÐµÑ€ÑÐ¸Ð¸ ÑÐ°Ð¹Ñ‚Ð°, ÐºÐ¾Ñ‚Ð¾Ñ€Ð°Ñ Ð±ÑƒÐ´ÐµÑ‚ Ð¾Ñ‚Ð²ÐµÑ‡Ð°Ñ‚ÑŒ ÑÐ¾Ð²Ñ€ÐµÐ¼ÐµÐ½Ð½Ñ‹Ð¼ &amp;quot;ÐºÐ°Ð½Ð¾Ð½Ð°Ð¼&amp;quot; ecommerce ÑÐ°Ð¹Ñ‚Ð¾Ð² Ð² Fashion ÑÐµÐ³Ð¼ÐµÐ½Ñ‚Ðµ. \nÐžÐ·Ð½Ð°ÐºÐ¾Ð¼Ð¸Ñ‚ÑŒÑÑ Ñ ÐºÐ¾Ñ€Ð¾Ñ‚ÐºÐ¸Ð¼ Ñ‚ÐµÑ…Ð½Ð¸Ñ‡ÐµÑÐºÐ¸Ð¼ Ð·Ð°Ð´Ð°Ð½Ð¸ÐµÐ¼ Ð¼Ð¾Ð¶Ð½Ð¾ Ð¿Ð¾ ÑÑ‚Ð¾Ð¹ ÑÑÑ‹Ð»ÐºÐµ:\nhttps://docs.google.com/document/d/1g5uzzXyMKvqVDmLQLYlHZIrY9EAvU-T8KpfLMczg10Y/edit?usp=sharing<b>Skills</b>:        Ecommerce Website,                     Shopify,                     WooCommerce,                     Graphic Design,                     Front-End Development,                     Back-End Development            ","link":"https://www.upwork.com/jobs/Eternal_%7E014246f58bc27b92de?source=rss","processedDate":"2024-03-18T20:19:27.472Z","postedDate":"<b>Posted On</b>: March 15, 2024 11:09 UTC","id":"014246f58bc27b92de"},{"skillset":["UIKit","Apple Xcode","iOS","SwiftUI"],"title":"Expert to create MCQ challenges on iOS - Upwork","description":"Requirement: Create high-quality MCQs on SwiftUI, UIKit and Xcode. Areas of the challenge could be - https://docs.google.com/document/d/13Hx-9QlLuuICeYZxAX46i37dKgGgYIY7uC_ZRVORqsE/edit#heading=h.qhnmnwsst6nt\nGeneral Overview:\nHackerRank is a SaaS business company that powers technical recruiting. We are inviting talented freelancers to join our team as members of HackerRank&#039;s External Talent.\nProject Overview:\nWe are the market-leading technical interview platform to identify and hire developers with the right skills. Opportunity with our organization means you get the chance to...\n1. Develop questions on the latest tools and technologies in the software industry\n2. Be part of the beta testing team (try questions and provide feedback before they launch)\n3. Build your resume and experience with unique opportunities specific to HackerRank needs\nProject Specifics:\nCreate MCQ challenges on SwiftUI, UIKit and Xcode. You need to be an expert in iOS with good experience in working on all aspects of it.\nRequirements:\nMinimum 3 years of work experience\nProficient English Fluency and writing skills\nPart-time Availability\nPlease note: This job requires you to work with HackerRank using tools such as the following\n1. HackerRank for work\n2. Microsoft Teams&nbsp;&nbsp;\n3. Github<b>Skills</b>:        UIKit,                     Apple Xcode,                     iOS,                     SwiftUI            ","link":"https://www.upwork.com/jobs/Expert-create-MCQ-challenges-iOS_%7E01a4c748901ae62685?source=rss","processedDate":"2024-03-18T20:19:27.472Z","postedDate":"<b>Posted On</b>: March 15, 2024 09:35 UTC","id":"01a4c748901ae62685"},{"skillset":["WordPress","PHP","Web Development","CSS","Web Design","HTML5","Theme Customization"],"title":"Create website by changing code of  WordPress theme as per requirement. - Upwork","description":"********&nbsp;&nbsp;BUDGET IS FIXED,&nbsp;&nbsp;&nbsp;NO BARGAIN ********\ni have purchased WordPress theme purchased&nbsp;&nbsp;from themeforest.\nTheme :\nhttps://sample.realhomes.io/modern02/\nTask is\n1. ui changes/customization. (as per mentioned in requirement document)\n2. change backend as per requirement.\n3. Consider customization for (Backend + frontend )\n4. Code is already deployed , u need to do the changes directly on server.\n5. after all changes setup local copy at my computer and get it running.\n6. It requires a ot of customization. If you know coding then only apply for this.\n********&nbsp;&nbsp;BUDGET IS FIXED,&nbsp;&nbsp;&nbsp;NO BARGAIN ********\n********&nbsp;&nbsp;BUDGET IS FIXED,&nbsp;&nbsp;&nbsp;NO BARGAIN ********\n I have attached requirement document\n please go through it&nbsp;&nbsp;before bidding on this project.<b>Skills</b>:        WordPress,                     PHP,                     Web Development,                     CSS,                     Web Design,                     HTML5,                     Theme Customization            ","link":"https://www.upwork.com/jobs/Create-website-changing-code-WordPress-theme-per-requirement_%7E01a22859352b45e0b7?source=rss","processedDate":"2024-03-18T20:19:27.472Z","postedDate":"<b>Posted On</b>: March 15, 2024 08:43 UTC","id":"01a22859352b45e0b7"},{"skillset":["Smartphone","Tablet","Android App Development","Mobile App Bug Fix","Mobile App Development","Android","Kotlin"],"title":"Poznavanje rada u Android Studio i editovanje aplikacije napisane u Kotlin-u - Upwork","description":"Pozdrav, imam aplikaciju koja je napisana i Kotlinu i sada mi treba neke sitnice izmijeniti. <b>Skills</b>:        Smartphone,                     Tablet,                     Android App Development,                     Mobile App Bug Fix,                     Mobile App Development,                     Android,                     Kotlin            ","link":"https://www.upwork.com/jobs/Poznavanje-rada-Android-Studio-editovanje-aplikacije-napisane-Kotlin_%7E01e34d0e590698ed23?source=rss","processedDate":"2024-03-18T20:19:27.472Z","postedDate":"<b>Posted On</b>: March 15, 2024 08:12 UTC","id":"01e34d0e590698ed23"},{"skillset":["Automation","Software Development","Software Integration","Industrial Automation","Electronics","Modbus","Electrical Engineering","ESP32","Internet of Things Solutions Design","Hardware Design","Raspberry Pi","Python","PLC Programming","C++","Arduino"],"title":"Integration VMC - Cashless Device  - Upwork","description":"Hi, May u know about Mdb protocolo, Raspberry and things like that? I&#039;m kind Of lost. I have a Vending Machine TCN brand, but My cashless device is TCP/IP New5310 Newpos Brand, people told me buy Quibix or Raspberry or something similar and develope a software, could u Help me?<b>Skills</b>:        Automation,                     Software Development,                     Software Integration,                     Industrial Automation,                     Electronics,                     Modbus,                     Electrical Engineering,                     ESP32,                     Internet of Things Solutions Design,                     Hardware Design,                     Raspberry Pi,                     Python,                     PLC Programming,                     C++,                     Arduino            ","link":"https://www.upwork.com/jobs/Integration-VMC-Cashless-Device_%7E017bd258f7513e456f?source=rss","processedDate":"2024-03-18T20:19:27.472Z","postedDate":"<b>Posted On</b>: March 15, 2024 06:51 UTC","id":"017bd258f7513e456f"},{"skillset":["Linux System Administration","System Administration","Linux","Network Administration","Debian"],"title":"Install and configure edbjca on debian 12 - Upwork","description":"I need someone to install the package edbjca on my debian 12 server. I need you to configure it to work as a CA and configure all the related requirements such as installing and configuring an application server like wildly and a database like maria db\nI will need u to write a detailed instruction about installation so that I carry the same to production<b>Skills</b>:        Linux System Administration,                     System Administration,                     Linux,                     Network Administration,                     Debian            ","link":"https://www.upwork.com/jobs/Install-and-configure-edbjca-debian_%7E01024dfdbe952aa752?source=rss","processedDate":"2024-03-18T20:19:27.472Z","postedDate":"<b>Posted On</b>: March 15, 2024 06:18 UTC","id":"01024dfdbe952aa752"},{"skillset":["Civil Engineering"],"title":"I want to do the Hec Hms project in the river basin in Thailand. - Upwork","description":"HEC-HMS (Hydrologic Engineering Center - Hydrologic Modeling System) is a widely-used hydrological modeling software developed by the Hydrologic Engineering Center of the U.S. Army Corps of Engineers. This powerful tool is designed to simulate the hydrologic processes within watersheds and evaluate the response of various components, such as rainfall, runoff, infiltration, and streamflow. HEC-HMS offers a comprehensive framework for hydrological analysis, allowing engineers, hydrologists, and researchers to model complex water systems and assess the potential impacts of land use changes, climate variability, and engineering interventions. With its user-friendly interface and robust simulation capabilities, HEC-HMS facilitates the development of accurate flood forecasts, water resources management strategies, and floodplain mapping, making it an indispensable tool in the field of hydrology and water resources engineering.\nHec Hms modeling for the river basin in Thailand<b>Skills</b>:        Civil Engineering            ","link":"https://www.upwork.com/jobs/want-the-Hec-Hms-project-the-river-basin-Thailand_%7E017c1e892431043bee?source=rss","processedDate":"2024-03-18T20:19:27.472Z","postedDate":"<b>Posted On</b>: March 15, 2024 05:51 UTC","id":"017c1e892431043bee"},{"skillset":["Interactive Design","User Flow","Figma"],"title":"Figma designer required for web application - Upwork","description":"We are SwapU.com.au.&nbsp;&nbsp;We help people swap goods.\nWe are making an update to the site and require a designer to help us transfer the current desktop designs in to mobile layouts.&nbsp;&nbsp;We have a few pages to redesign as well.&nbsp;&nbsp;\nYou will be assisting with the user flow and ensuring best practice is followed. <b>Skills</b>:        Interactive Design,                     User Flow,                     Figma            ","link":"https://www.upwork.com/jobs/Figma-designer-required-for-web-application_%7E010119e23e806e2464?source=rss","processedDate":"2024-03-18T20:19:27.472Z","postedDate":"<b>Posted On</b>: March 15, 2024 02:55 UTC","id":"010119e23e806e2464"},{"skillset":["RESTful API","CSS","HTML","Quasar Framework","Vue.js","JavaScript","Web Application","Firebase","Progressive Web App"],"title":"Long term full stack Vue.js/Firebase/Quasar developer needed - Upwork","description":"We have SwapU.com.au.&nbsp;&nbsp;We help people swap goods. \nIt is a web application built on Vue.js and Firebase. We are making updates and are looking for a long term developer to assist.&nbsp;&nbsp;\nYou will be working from Figma and GitHub.&nbsp;&nbsp;There is a mentor available who can help when you get stuck.&nbsp;&nbsp;\nFront-End Skills (Vue.js):\nStrong understanding of Vue.js fundamentals: This includes components, templates, data binding, directives, lifecycles, and the Vue ecosystem (Vue Router, Vuex).\nBuilding interactive user interfaces: Proficiency in creating reusable components, handling user interactions, and building dynamic and responsive UIs.\nJavaScript best practices: Knowledge of modern JavaScript features (ES6+), writing clean and maintainable code, and following best practices for code organization and testing.\nHTML and CSS: Solid understanding of HTML structure and CSS for styling web applications.\nBack-End Skills (Firebase):\nFirebase expertise: In-depth knowledge of Firebase products like Firestore (database), Authentication, Cloud Functions, Storage, and familiarity with their functionalities.\nData modeling and querying: Understanding how to structure data in Firestore, efficiently fetching and manipulating data using queries.\nUser authentication and authorization: Implementing secure user logins, role-based access control, and managing user data in Firebase Authentication.\nServerless functions: Ability to write and deploy Firebase Cloud Functions to handle backend logic and interact with other Firebase services.\nQuasar experience is essential as it is specific to this project. \nAdditional Skills:\nVersion control systems: Git for version control and collaboration.\nDeployment strategies: Deploying Vue.js applications with Firebase Hosting or other platforms.\nTesting: Writing unit and integration tests for both front-end and back-end code.\nProblem-solving and debugging: Ability to identify and fix issues in both the front-end and back-end of the application.\nBonus Skills:\nVue.js advanced features: Familiarity with Vuex (state management), Vue Router (routing), and server-side rendering with Nuxt.js.\nRESTful APIs: Understanding of RESTful APIs for potential integrations with external services.<b>Skills</b>:        RESTful API,                     CSS,                     HTML,                     Quasar Framework,                     Vue.js,                     JavaScript,                     Web Application,                     Firebase,                     Progressive Web App            ","link":"https://www.upwork.com/jobs/Long-term-full-stack-Vue-Firebase-Quasar-developer-needed_%7E011ec6b279ebd4e684?source=rss","processedDate":"2024-03-18T20:19:27.472Z","postedDate":"<b>Posted On</b>: March 15, 2024 01:59 UTC","id":"011ec6b279ebd4e684"},{"skillset":["Web Development","Website Redesign","Visual Communication","Style Guide","Mockup","GoDaddy","Web Design","Graphic Design","Web Analytics","Infographic"],"title":"Web Designer needed to help with website redesign and implementation - Upwork","description":"National Consulting Partners is looking for an experienced graphic designer/web designer with robust experience in website design to help our organization redesign its website. We already have newly redesigned brand guidelines including a logo and color scheme, 90% of the technical content written for the website, and a layout of the web pages and content we&#039;re looking for on each web page to assist the graphic designer with this effort. \nOur previous graphic designer had to step away for health reasons, so we are looking for someone who can pick up where she left off. In other words, we aren&#039;t starting from scratch. We use GoDaddy for our existing website and would like to maintain that if possible. \nIn this role, you will be interacting frequently with the Director of Operations and the Director of Business Development to provide mockups, updates on work progress, and design review sessions. We operate on ET, but aside from meetings, you are free to work on hours convenient for you. This is a 100% remote opportunity. \nWe are a U.S. Federal Government consulting agency similar to companies like IBM, Booz Allen, Accenture, etc. (only smaller). While not required, an ideal candidate would have robust experience working with consulting agencies.\nDeliverables (in order of priority):\n* Website redesign\n* Creating PP and Word templates by leveraging leadership guidance and technical content available for slide decks, pitch sheets, proposals, past performance write-ups, white papers, etc. \n* LinkedIn Editorial Calendar\n* LinkedIn Personal Profile design (i.e., how we can incorporate a subtle element of the NCP LinkedIn profile into our personal LinkedIn pages)\n* Website analytics (traffic, clicks, etc.)\n* Business card design\n* SEO (nice to have if time, but not required)\nRequired Skills/Experience\n* 5+ years of graphic design experience working with medium/large organizations\n* Strong experience with GoDaddy\n* Experience with iterative design \n* Experience producing mock-ups and presenting to non-technical audiences - including leadership\n* Experience with infographic and icon design\n* Landing page optimization skills\n* Webpage analytics\n* Familiarity with MS Teams\n* Must be fluent in English or native English speaker\nPreferred Skills/Experience:\n* Experience working with U.S. Federal Government agencies or consulting agencies like ourselves supporting Federal Government agencies\n* Strong technical writing skills\n* Social Media experience - especially LinkedIn\n* SEO experience<b>Skills</b>:        Web Development,                     Website Redesign,                     Visual Communication,                     Style Guide,                     Mockup,                     GoDaddy,                     Web Design,                     Graphic Design,                     Web Analytics,                     Infographic            ","link":"https://www.upwork.com/jobs/Web-Designer-needed-help-with-website-redesign-and-implementation_%7E01009f4627b7ccc046?source=rss","processedDate":"2024-03-18T20:19:27.472Z","postedDate":"<b>Posted On</b>: March 15, 2024 01:04 UTC","id":"01009f4627b7ccc046"},{"skillset":["Customer Satisfaction Research","Customer Experience Research","Brand Research","Market Research","Mobile App Testing","Market Analysis"],"title":"Mystery Shopper for Harvey Norman in New Zealand - Upwork","description":"(Note: you don&#039;t have to BUY to complete this task)\nWe&#039;re seeking enthusiastic individuals in New Zealand to conduct mystery shopping missions at Harvey Norman stores using the Snooper App, available on both the App Store and Google Play. As a Mystery Shopper, you&#039;ll play an important role in evaluating the Microsoft display areas within these stores.\nYou&#039;ll get paid $40 NZD per mission.\nðŸ›’\nWHAT IS SNOOPER\nSnooper is much more than just a Mystery Shopper app.\nWith Snooper, you get paid in cash to complete easy missions in stores arounds you: take a few photos of products on shelves, find a promotional display, play the role of a mystery shopper, provide product feedback and much more. Making money in your free time or while shopping has never been so easy.\nWe analyze the images and feedback you provide so brands and retailers can get real-time visibility on their brands and products in-store.\nYou&rsquo;ll find more information on our website (snooper-app.com)\nðŸ›’\nSTORE TO VISIT (Google map)\nhttps://www.google.com/maps/d/u/0/edit?mid=1cMJLblMRuWfzTbNLChZsHCxJknuhE6o&amp;amp;usp=sharing\nðŸ›’\nMYSTERY SHOPPER MISSION:\nAs part of this mission, you&#039;ll visit a specific Harvey Norman store and head Microsoft branded display tables. \n There are 2 Microsoft missions per store:\nðŸ’» Microsoft Display Check - find the Microsoft branded display tables (this mission)\nðŸ’» Microsoft Staff Advocacy - follow a mystery shopper scenario and answer a few questions about the staff (other mission) \nAll details of the mission are in the App, and we will be there to assist you in case you have any problem.\nðŸ›’\nWHAT YOU HAVE TO DO NEXT\n- Download the Snooper App\n- Create your account and find your &#039;ðŸ’» Microsoft Display Check ðŸ“ Harvey Norman&#039; and &#039;ðŸ“ Microsoft Staff AdvocacyðŸ“ Harvey Norman&#039; missions on the App\n- Use the App and Complete the mystery shopper missions in the venues you selected\nðŸ›’\nHOW MUCH YOU WILL GET PAID\nThis task pays $40 NZD per successfully completed mission (1 mission = 1 milestone). We will pay you per milestones so you can complete as many missions as you want.\nThis task is advertised for 5 missions.\nImportant: Upwork displays payments in $USD. We will make sure that you receive $40NZD, per successfully completed mission as per the description here above.\nðŸ›’\nONLY ACCEPT THIS TASK IF\n- You&#039;re more than 18 years old\n- You are able to visit some of the participating venues\n- You have a recent mobile phone with a high-definition camera\n- You are used taking high quality photos (not blurry)\n- You are able to install and use a mobile app\n- You are comfortable playing the role of a mystery shopper in store\nðŸ›’\nYou&#039;ll see many more missions on the Snooper App. You can complete them, and you will be paid in the Snooper App for every mission you complete successfully. However, as part of this Upwork contract you must complete the &#039;&#039;ðŸ’» Microsoft Display Check ðŸ“ Harvey Norman&#039; and &#039;ðŸ“ Microsoft Staff AdvocacyðŸ“ Harvey Norman&#039; allocated close to you and you will get paid on Upwork for that specific mission.<b>Skills</b>:        Customer Satisfaction Research,                     Customer Experience Research,                     Brand Research,                     Market Research,                     Mobile App Testing,                     Market Analysis            ","link":"https://www.upwork.com/jobs/Mystery-Shopper-for-Harvey-Norman-New-Zealand_%7E0159f7dad811875327?source=rss","processedDate":"2024-03-18T20:19:27.472Z","postedDate":"<b>Posted On</b>: March 15, 2024 01:04 UTC","id":"0159f7dad811875327"},{"skillset":["Data Entry","Staffing Needs","Project Management","Leadership Skills"],"title":"Marketing Assistant for Marketing Company - Upwork","description":"We&#039;re an emerging U.S.-based marketing agency on the lookout for a Marketing Assistant. This role is designed to support our Founder by taking over client and project management, team communication, operations, and recruiting tasks. The ideal candidate will enable our Founder to concentrate on sales and marketing, leveraging their expertise in the digital marketing space to manage other key areas of the business.\nResponsibilities:\nManage client relationships and project timelines to ensure outstanding service and delivery.\nOversee day-to-day operations, streamlining processes for efficiency.\nFacilitate clear and effective communication across teams.\nLead recruiting efforts to build a talented and creative team.\nAssist in developing and executing marketing strategies.\nConduct market research, and analyze trends to support strategic decisions.\nHandle scheduling, including meetings, appointments, and travel arrangements.\nDraft communications and manage social media interactions on behalf of the Founder.\nQualifications:\nBachelor&rsquo;s degree in Marketing, Business, or related field.\nExperience in marketing, project management, and operations within a digital space.\nStrong organizational, analytical, and interpersonal skills.\nSystems thinker with an eye for detail and innovation.<b>Skills</b>:        Data Entry,                     Staffing Needs,                     Project Management,                     Leadership Skills            ","link":"https://www.upwork.com/jobs/Marketing-Assistant-for-Marketing-Company_%7E019d9cd3937d4f2d95?source=rss","processedDate":"2024-03-18T20:19:27.472Z","postedDate":"<b>Posted On</b>: March 14, 2024 22:15 UTC","id":"019d9cd3937d4f2d95"},{"skillset":["Daily Deposits","Data Entry","LinkedIn"],"title":"Collecting contact information using LinkedIn and other sources - Upwork","description":"Gather contact information for people who meet ALL of the following criteria:\n1. U.S. resident excluding California (i.e., no California residents)\n2. C-Suite executive or business owner\n3. Business has 11 employees or more.\n4. Person has at least 10 years of experience\n5. EXCLUDE the following industries: Financial Services, Investment Advice, Investment Management, Insurance, Public Safety, Public Health, Public Policy Offices, Public Assistance Programs, Government Administration, Government Relations Services, Law Enforcement, Courts of Law, Housing Programs, Housing and Community Development, Family Planning Centers, Higher Education, Education Administration Programs, Primary and Secondary Education, Community Services, Armed Forces,&nbsp;&nbsp;Legislative Offices, Administration of Justice, International Affairs, Executive Offices, Emergency and Relief Services, Individual and Family Services, Religious Institutions, Civic and Social Organizations, Non-profit Organizations, Fundraising, Museums, Zoos and Botanical Gardens, Philanthropic Fundraising Services, Education, Correctional Institutions, Fine Art Schools [and anything else that looks like it is government or non-profit-related]\nAll of these criteria can be found on LinkedIn or Sales Navigator. All criteria must be met. The contact information I need for those who meet the criteria is:\n1. First Name\n2. Last Name\n3. Job Title\n4. Verified email address only\n5. LinkedIn profile link\nAll five data items must be available.\nI&#039;m looking for at least 1,500 verified emails per week (checked with sources such as ZeroBounce, Hunter, etc.).&nbsp;&nbsp;I will double check and verify the emails myself.&nbsp;&nbsp;If a significant portion (say over 10%) comes back as &amp;quot;accept all&amp;quot; or otherwise unverified it will lead to contact cancellation..\nEach batch should have no duplicates with prior batches you&#039;ve sent me. You should have your own data sources (LinkedIn, Sales Navigator, ZoomInfo, etc.).\nPlease quote me a weekly price for 1,500 contacts per week.<b>Skills</b>:        Daily Deposits,                     Data Entry,                     LinkedIn            ","link":"https://www.upwork.com/jobs/Collecting-contact-information-using-LinkedIn-and-other-sources_%7E010c9fa52a6c742c1d?source=rss","processedDate":"2024-03-18T20:19:27.472Z","postedDate":"<b>Posted On</b>: March 14, 2024 20:49 UTC","id":"010c9fa52a6c742c1d"},{"skillset":["Android","Artificial Intelligence","Mobile App Development","iOS"],"title":"Mobile app with AI voice generation - Upwork","description":"Hi! We&#039;re looking for developers (ideally part of an agency or team) with experience in no-code or low-code solutions, as well as AI. We would like you to have team members with different expertises, or have experience sub-contracting some specific components of the app so it all integrates smoothly.\nThe basic idea of the app is that someone can answer a quiz-style conversation with AI, and using the answers from the quiz, the custom AI model will generate a personalized meditation for that person.\nThe meditation will be converted to audio with text-to-speech AI in real time (that&#039;s the only component that will be generated in real time). The text-to-speach audio will then be paired with a music background from an existent library, and an option to hear the resulting meditation using a VR headset and a 360 background like this: https://momento360.com/e/u/6c58864ab2314d758d386ab60125b87f\nI have researched the separate components needed for the app to work, and how much would they cost based on good rated fixed projects here on Upwork. This is the estimated list of costs for the elements I came up with:\nProject management - 200usd\nApp design from no-code template - 300 usd\nCustom (trainable) AI model to generate meditation texts - 350 usd\n33 AI generated music backgrounds - 50 usd\n7 AI customized voices for text-to-speech - 70 usd\nAI voice integration for real-time audio generation within the app - 200 usd\n33 AI generated 360 images for VR visualization - 50 usd\nAndroid VR conversion to upload a version of the app to Meta Quest Appstore, or... and audio embedder and QR generator for the option to listen to meditations on external website that supports 360 background view with a VR headset: 100-300 usd\nApp upload to stores: 100 usd\nExtra debugging or software license costs: 180 usd\nTotal: 1,800 usd\nIt&#039;s all about working with pre-existing technologies, so we&#039;re not looking for expert builders of original code, rather creative and pro-active project managers, who can integrate different components and outsource what their own team can&#039;t do.\nWe&#039;re looking at a timeline of 8-12 weeks once the contract starts.\nBut if you want to propose a higher cost in any category, or you need more time, we&#039;re open to it. We are willing to pay more if you show us you or your agency are extremely efficient and can get this done in whatever timeline that you commit to do so.\nThanks for your proposals!<b>Skills</b>:        Android,                     Artificial Intelligence,                     Mobile App Development,                     iOS            ","link":"https://www.upwork.com/jobs/Mobile-app-with-voice-generation_%7E018c972b6cf138d2be?source=rss","processedDate":"2024-03-18T20:19:27.472Z","postedDate":"<b>Posted On</b>: March 14, 2024 20:07 UTC","id":"018c972b6cf138d2be"},{"skillset":["Online Research","Contact List","Data Entry","Company Research","Data Scraping","Data Collection","Zoho CRM"],"title":"Conference Research Specialist - Upwork","description":"We seek a detail-oriented and highly organized freelance researcher to compile a comprehensive list of U.S.-based conferences across several industries and themes. The focus areas include private equity operator conferences, U.S. CEO conferences, leadership &amp;amp; association conferences, MLM conferences, and conferences related to the travel, hospitality, luxury, renewable, and solar industries.\nKey Responsibilities:\n**Research and Identification: Conduct thorough research to identify relevant conferences within the specified industries and themes. Utilize various sources, including industry publications, professional networks, and conference directories.\n**Data Compilation: For each conference identified, compile detailed information, including the event&#039;s name, target audience, event dates, location, and contact information for the person responsible for hiring speakers, as well as instructions to submit RFP if relevant. \n**Verification: Ensure the accuracy and currency of all information gathered by verifying details through multiple sources.\n**Reporting: Organize the compiled data into a clear, accessible format (e.g., spreadsheet or database) and provide regular updates on research progress. \nSkills and Qualifications:\n**Proven Research Skills: Demonstrated ability to conduct comprehensive research and gather detailed information efficiently.\n**Attention to Detail: Exceptional attention to detail to ensure the accuracy of collected data.\n**Organizational Skills: Strong organizational skills to manage and categorize information effectively.\n**Communication Skills: Excellent written communication skills for reporting and summarizing findings.\n**Experience: Previous experience in research, event planning, or a related field is preferred.\nAdditional Requirements:\n**Tools Proficiency: Using online research tools, databases, and office software (e.g., Microsoft Excel or Google Sheets) for data compilation and reporting.\n**Confidentiality: Must maintain confidentiality of sensitive information.\n**Zoho CRM Experience a plus\nProject Duration and Compensation:\nDuration: This is a project-based, freelance position. In your proposal, please indicate your availability and estimated time frame for project completion.\nWe want to negotiate a flat rate to locate 250 new conferences/contacts per week. <b>Skills</b>:        Online Research,                     Contact List,                     Data Entry,                     Company Research,                     Data Scraping,                     Data Collection,                     Zoho CRM            ","link":"https://www.upwork.com/jobs/Conference-Research-Specialist_%7E0149c1e7c667fd2f5e?source=rss","processedDate":"2024-03-18T20:19:27.472Z","postedDate":"<b>Posted On</b>: March 14, 2024 19:49 UTC","id":"0149c1e7c667fd2f5e"},{"skillset":["Amazon FBA","Inventory Management","Microsoft Excel","Amazon Seller Central"],"title":"Amazon Inventory File Specialist Required for Private Label FBA Company - Upwork","description":"IMPORTANT: Your efficiency and promptness are crucial in this role. To be considered for it, you MUST estimate the time required to prepare and upload each set of two spreadsheets to our Amazon UK and US SellerCentral accounts.\nDescription:\nOur Private Label FBA Company is seeking an Amazon Inventory File Specialist to consistently manage the upload of inventory files for our new products on both our Amazon UK and US SellerCentral accounts.\nThe sheet below contains all pertinent information for our products, including Brand, SKU data, barcodes, and more. Additionally, it includes links to similar products currently listed on Amazon to assist in identifying the appropriate category for downloading the Amazon Product Spreadsheet.\nhttps://docs.google.com/spreadsheets/d/1tOBuwkQJmEsoHQ0MNb4-Jd1d6PTAQ6Uad_w-u5em2B4/edit?usp=sharing<b>Skills</b>:        Amazon FBA,                     Inventory Management,                     Microsoft Excel,                     Amazon Seller Central            ","link":"https://www.upwork.com/jobs/Amazon-Inventory-File-Specialist-Required-for-Private-Label-FBA-Company_%7E014642f5d0d36e06d5?source=rss","processedDate":"2024-03-18T20:19:27.472Z","postedDate":"<b>Posted On</b>: March 14, 2024 19:12 UTC","id":"014642f5d0d36e06d5"},{"skillset":["List Building","Online Research","Contact List","Microsoft Excel"],"title":"Real Estate Hedge Fund Research - Upwork","description":"I&#039;m looking for someone to research and build a list of U.S.-based hedge funds who are actively purchasing single family homes.&nbsp;&nbsp;\nThis is a common list - if you already have one, please let me know.&nbsp;&nbsp;\nBuilding it would include research to: \n1. Find out what companies are buying single family homes\n2. Finding a contact at that company \n3. Verifying the company&#039;s investment parameters\n4.&nbsp;&nbsp;Documenting everything.&nbsp;&nbsp;\nWe&#039;re looking for someone who:\n1.&nbsp;&nbsp;Works fast with extreme accuracy\n2.&nbsp;&nbsp;Is very proficient with research and data entry.\nYou MUST:\n1.&nbsp;&nbsp;Have reliable computer equipment\n2. Have a web cam with video and speech capability.\n3.&nbsp;&nbsp;Have advanced English skills\nPlease describe, list, or show examples of what similar work you&#039;ve done.&nbsp;&nbsp;\nPlease send a video or audio recording of yourself.<b>Skills</b>:        List Building,                     Online Research,                     Contact List,                     Microsoft Excel            ","link":"https://www.upwork.com/jobs/Real-Estate-Hedge-Fund-Research_%7E012cadac7278ab1b7d?source=rss","processedDate":"2024-03-18T20:19:27.472Z","postedDate":"<b>Posted On</b>: March 14, 2024 18:39 UTC","id":"012cadac7278ab1b7d"},{"skillset":["WordPress","PHP","Web Development","CSS","Web Design","HTML5","Theme Customization"],"title":"Create website by changing code of  WordPress theme as per requirement. - Upwork","description":"********&nbsp;&nbsp;BUDGET IS FIXED,&nbsp;&nbsp;&nbsp;NO BARGAIN ********\ni have purchased WordPress theme purchased&nbsp;&nbsp;from themeforest.\nTheme :\nhttps://sample.realhomes.io/modern02/\nTask is\n1. ui changes/customization. (as per mentioned in requirement document)\n2. change backend as per requirement.\n3. Consider customization for (Backend + frontend )\n4. Code is already deployed , u need to do the changes directly on server.\n5. after all changes setup local copy at my computer and get it running.\n6. It requires a ot of customization. If you know coding then only apply for this.\n**** BUDGET IS FIXED,&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;IF YOU THINK IT IS LESS,&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nPLEASE DO NOT APPLY ****\n I have attached requirement document\n please go through it&nbsp;&nbsp;before bidding on this project.<b>Skills</b>:        WordPress,                     PHP,                     Web Development,                     CSS,                     Web Design,                     HTML5,                     Theme Customization            ","link":"https://www.upwork.com/jobs/Create-website-changing-code-WordPress-theme-per-requirement_%7E0162d0d8f6acbe5088?source=rss","processedDate":"2024-03-18T20:19:27.472Z","postedDate":"<b>Posted On</b>: March 14, 2024 18:25 UTC","id":"0162d0d8f6acbe5088"},{"skillset":["Adobe Photoshop","CapCut","ChatGPT","Google Sheets","Canva","Virtual Assistance","Social Media Marketing","Social Media Management","Instagram","Facebook"],"title":"Looking for a virtual assistant with a social media background - Upwork","description":"I am looking for a virtual assistant to replace my current assistant, as she is moving on to other things in her career. You need to be able to use Canva to create posts for social media and also need to be able to schedule posts for the various social media pages I manage. You will also need to be able to do research and be able to utilize things like Adobe, Capcut, Microsoft Office, and some project management softwares such as Notion. My Current assistant will train you until her last day if need be.<b>Skills</b>:        Adobe Photoshop,                     CapCut,                     ChatGPT,                     Google Sheets,                     Canva,                     Virtual Assistance,                     Social Media Marketing,                     Social Media Management,                     Instagram,                     Facebook            ","link":"https://www.upwork.com/jobs/Looking-for-virtual-assistant-with-social-media-background_%7E01411e6a9c81de3151?source=rss","processedDate":"2024-03-18T20:19:27.472Z","postedDate":"<b>Posted On</b>: March 14, 2024 18:01 UTC","id":"01411e6a9c81de3151"},{"skillset":["Online Research","Data Entry","Microsoft Excel","Google Docs"],"title":"Public Records Research and Data Entry - Upwork","description":"We collect information from U.S. public records sources from various data bases.&nbsp;&nbsp;\nI need someone to go into these databases on a daily basis and look for the specific information we need.&nbsp;&nbsp;Typically we&#039;re searching court filings, so the information will be on scanned image documents.&nbsp;&nbsp;\nWe need this done on a daily basis.&nbsp;&nbsp;Ideally before 9:00 am EST but we can discuss that.&nbsp;&nbsp;\nAttached are two examples of public records and a snapshot of our database.&nbsp;&nbsp;\nWe&#039;re looking for someone who: \n1.&nbsp;&nbsp;Works fast with extreme accuracy\n2.&nbsp;&nbsp;Is VERY proficient with data entry in Excel and/or Google docs.&nbsp;&nbsp;\nYou MUST: \n1.&nbsp;&nbsp;Have reliable computer equipment\n2. Have a web cam with video and speech capability. \n3.&nbsp;&nbsp;Have advanced English skills\nPlease describe, list, or show examples of what similar work you&#039;ve done.&nbsp;&nbsp;\nPlease send a video or audio recording of yourself. <b>Skills</b>:        Online Research,                     Data Entry,                     Microsoft Excel,                     Google Docs            ","link":"https://www.upwork.com/jobs/Public-Records-Research-and-Data-Entry_%7E01ad2738d51295ca66?source=rss","processedDate":"2024-03-18T20:19:27.472Z","postedDate":"<b>Posted On</b>: March 14, 2024 17:59 UTC","id":"01ad2738d51295ca66"},{"skillset":["React","Microsoft Word","JavaScript"],"title":"Word  Office AddIn - Redline Changes - Upwork","description":"I&#039;m looking to implement a tracking feature in word-addin\nIf I have a paragraph which contains text, and I copy in a new paragraph where only one word has changed, it still shows like the whole paragraph has been deleted, instead of the only edit\nInstead, we want to be able to say specifically what has changed\nHere&#039;s an example video:\nhttps://youtu.be/J7Zerey-7rU?si=ol4lX5gOTenw6Nyj<b>Skills</b>:        React,                     Microsoft Word,                     JavaScript            ","link":"https://www.upwork.com/jobs/Word-Office-AddIn-Redline-Changes_%7E0157f2daf21aa7c52c?source=rss","processedDate":"2024-03-18T20:19:27.472Z","postedDate":"<b>Posted On</b>: March 14, 2024 17:24 UTC","id":"0157f2daf21aa7c52c"},{"skillset":["Data Entry","Administrative Support","Proofreading","Quality Assurance","Content Editing"],"title":"Admin &amp; Quality Assurance Assistant - Upwork","description":"Reporting to the Administrative Services Manager, your primary responsibilities include:\n&bull;\tProofread: video captions, website copy, creative images, PowerPoint presentations, and other documents.\n&bull;\tQuality Assurance: ensure videos and PowerPoint presentations are formatted properly against an SOP checklist.\n&bull;\tData Entry: spreadsheets, Monday.com, Harvest, Upwork, and other online platforms.\n&bull;\tUpdate Content: WordPress websites and YouTube.\n&bull;\tUpload videos after the quality control and approval process.\nRequired skills:\n&bull;\tFluent in English (reading, writing, speaking)\n&bull;\tExcellence in writing and proofreading.\n&bull;\tProficiency in creating and editing Google and Microsoft documents, spreadsheets, and PowerPoint presentations.\nPreferred Skills:\n&bull;\tExperience editing closed captions for videos in Adobe Premier and Descript.\n&bull;\tPDF editing.\n&bull;\tExperience updating content on WordPress.\n&bull;\tAbility to transcribe heavily accented English audio.\nBonus:\n&bull;\tFluency in Japanese, Chinese, Mandarin, Hindi, or Bengali.\n&bull;\tFlexibility with schedule.\nIf you are passionate about communication and proper grammar and want to join a supportive team, we look forward to your proposal.<b>Skills</b>:        Data Entry,                     Administrative Support,                     Proofreading,                     Quality Assurance,                     Content Editing            ","link":"https://www.upwork.com/jobs/Admin-amp-Quality-Assurance-Assistant_%7E019bb588623babfbdf?source=rss","processedDate":"2024-03-18T20:19:27.472Z","postedDate":"<b>Posted On</b>: March 14, 2024 17:22 UTC","id":"019bb588623babfbdf"},{"skillset":["MATLAB"],"title":"Real time Digital signal processing - Upwork","description":"I need someone with REAL-TIME Digital signal processing to help me with a project. The person needs to have the Cypress FM4 board and be very good understanding of the different types of filters<b>Skills</b>:        MATLAB            ","link":"https://www.upwork.com/jobs/Real-time-Digital-signal-processing_%7E01cdff906a9863e249?source=rss","processedDate":"2024-03-18T20:19:27.472Z","postedDate":"<b>Posted On</b>: March 14, 2024 17:00 UTC","id":"01cdff906a9863e249"},{"skillset":["AngularJS","JavaScript","ASP.NET","Python","PHP"],"title":"Custom Crawler For Expired/Expiring Domains - Upwork","description":"Hi,\nI&#039;m looking to build a custom crawler that can crawl expired domains (for SEO purposes) \nPlease watch this video: \nhttps://komododecks.com/recordings/u4HaLHxmP6QzEnadR1om\nOnly looking for devs or teams that have worked on similar projects. \nThank you <b>Skills</b>:        AngularJS,                     JavaScript,                     ASP.NET,                     Python,                     PHP            ","link":"https://www.upwork.com/jobs/Custom-Crawler-For-Expired-Expiring-Domains_%7E0110165b01bdebd444?source=rss","processedDate":"2024-03-18T20:19:27.472Z","postedDate":"<b>Posted On</b>: March 14, 2024 16:52 UTC","id":"0110165b01bdebd444"},{"skillset":["Flutter","Android","Smartphone","Android App Development","Mobile App Development"],"title":"Development of 2 simple Flutter  games &quot;Mindful Packaging&quot; and &quot;Crystals Mining&quot;   - Upwork","description":"Need to develop 2 small Flutter games.\nA full description of the task is in the attachment. Please read it carefully. I will give more details and recommendations after we discuss the main points of the concept and idea of the app.\nThere is a design and concept of app: \nhttps://docs.google.com/document/d/1G6ziWKQcozueHtJnoNkvABZKUJpUHBHI/edit?usp=sharing&amp;amp;ouid=114793339580266061503&amp;amp;rtpof=true&amp;amp;sd=true\nhttps://docs.google.com/document/d/1x1u0MOQRTB1eX30VA1w3FQha1Zpn4h4R/edit?usp=sharing&amp;amp;ouid=114793339580266061503&amp;amp;rtpof=true&amp;amp;sd=true<b>Skills</b>:        Flutter,                     Android,                     Smartphone,                     Android App Development,                     Mobile App Development            ","link":"https://www.upwork.com/jobs/Development-simple-Flutter-games-quot-Mindful-Packaging-quot-and-quot-Crystals-Mining-quot_%7E01aee819256c057ece?source=rss","processedDate":"2024-03-18T20:19:27.472Z","postedDate":"<b>Posted On</b>: March 14, 2024 16:00 UTC","id":"01aee819256c057ece"},{"skillset":["Real Estate","Canva","Google Sheets","Administrative Support","Customer Service","Data Entry","Email Communication","Virtual Assistance","Customer Support","Communications"],"title":"Full Time Remote Assistant For Real Estate Agent / Entrepreneur - Upwork","description":"I need a right-hand man/woman to help organize, manage, and grow my real estate business (and other online businesses).\nI&rsquo;m a busy real estate agent in the United States looking for a full-time virtual assistant.\nI&rsquo;m becoming too busy so I need someone to help manage transactions, respond to leads, do some social media marketing, and more. \nI&rsquo;m in the Central Time Zone in the United States which is GMT-5 or GMT-6 depending on daylight savings time. I can be a little flexible on hours, but would usually like someone available from 9-5 or maybe 10-6 my time. Monday through Friday.\nDepending on experience, I&#039;m willing to pay between $600 - $900 per month. Maybe more.\nA little about me...\nMy desk is covered with stacks of papers - if you&rsquo;re the right fit for this opening, your desk is clutter-free.\nI have to search to find anything (either electronic or paper) - if you&rsquo;re the right fit for this opening, you know where everything is in your life.\nI regularly don&rsquo;t reply in a timely way to correspondence, and it costs me money. And I hate checking email (but I have to). \nDo you love standard operating procedures? Great, because I don&rsquo;t. Not only do I need help following them, but I also need help creating them.\nYou should be one of those who doesn&rsquo;t feel right if all correspondence is not replied to the same day it comes in. \n&hellip; all this being said, I&rsquo;m a pretty successful real estate agent by many definitions. \nNot only am I a real estate agent, but also have a few successful websites. You will be occasionally asked to help out on those websites. Experience with Wordpress would be amazing, but I&rsquo;m happy to train the right candidate. \nI&rsquo;m an ideas person and would love to find someone that can help me execute on my ideas. And sometimes it might be helping launch a new business or website.\nJob Requirements\nA little more about the job...\nIn this job, you will wear many hats. \nYour most IMPORTANT responsibility will be helping my buyers/sellers get from contract to close. \nWhat does that mean? I, as the real estate agent, will get the client under contract, and that&rsquo;s when you take the lead. Documents and contracts are very important. You should be able to handle sending documents, reviewing them for accuracy, and making sure they get where they need to be. \nThere are many important tasks with specific deadlines that need to be followed - you will make sure they are added to the calendar and completed. You will collaborate with clients as well as vendors and other real estate agents to ensure things are on track. \nYour top priority is to provide exceptional customer service throughout the entire closing process, not only our clients, but also to all parties involved. \nAnother daily task is managing new leads into the website. The website gets about 3-7 leads per day. You will use the CRM to process the lead and set it up in our system. That involves categorizing it and setting up the lead to automatically receive real estate listings that match what they are looking for. You will be trained on all of this. \nMarketing will be another important responsibility. You will help me grow my business - whether it be updating websites, pulling lists of people to mail to, preparing newsletters, and more. \nYou may be asked to write content. And you may be asked to design some flyers in Canva. \nOther common tasks include paying bills, adding transactions to Xero, updating status and info of existing leads in the CRM, and preparing listing appointment notes.\nI don&rsquo;t have a big social media presence but I&rsquo;m open to finding someone that help me with that aspect of the business.\nWhat does the ideal candidate look like?\nThe ideal candidate must be adaptable to change and be solutions-oriented. This individual must provide a &ldquo;can-do&rdquo; attitude and will demonstrate initiative in problem-solving.\nYou have a strong sense of urgency, but not at the expense of quality. \nIn addition, you demonstrate on a daily basis the knowledge, attitudes, skills, and habits of a high achiever who is committed to putting clients first, doing the right thing.\nStrong English skills - speaking and writing are critical. You will occasionally be asked to have conversations with agents, clients, and leads.\nSome of the software I use\n(if you don&rsquo;t have experience with some of these programs, don&rsquo;t worry. I will provide training).\nSlack\nGmail\nGoogle Docs / Sheets\nToDoist\nMicrosoft Word / Excel\nAirTable\nDropbox\nNotion\nDotLoop - similar to DocuSign\nCanva\nWordPres\nXero\nDaily Communication:\nWe will mainly communicate via Slack. I&rsquo;m very busy so I don&rsquo;t do daily check-ins. If you are looking for a boss that is checking in with you several times a day, I&rsquo;m not that person. I need someone that can work on there own and knows what needs to be done (once you are trained of course).\nIn your application, please mention your favorite fruit.\nBenefits \nPaid U.S. Holidays\nPaid Vacation / Sick Days<b>Skills</b>:        Real Estate,                     Canva,                     Google Sheets,                     Administrative Support,                     Customer Service,                     Data Entry,                     Email Communication,                     Virtual Assistance,                     Customer Support,                     Communications            ","link":"https://www.upwork.com/jobs/Full-Time-Remote-Assistant-For-Real-Estate-Agent-Entrepreneur_%7E01b83f38b7b913a22c?source=rss","processedDate":"2024-03-18T20:19:27.473Z","postedDate":"<b>Posted On</b>: March 14, 2024 15:30 UTC","id":"01b83f38b7b913a22c"},{"skillset":["C#","API"],"title":"To Convert a Spot Trading BOT to an Options Trading BOT - Upwork","description":"I have a proven and tested c# desktop BOT for Spot trading thru rest API on the Binance Exchange.\nI want to convert this BOT to trade Options on Binance. \nThe API documentation is here: https://binance-docs.github.io/apidocs/spot/en/\nThe current spot trading BOT and the Spec changes are here: https://drive.google.com/drive/folders/1vx236271PiWxnEakhpP2fU4huGlqGgl6?usp=drive_link<b>Skills</b>:        C#,                     API            ","link":"https://www.upwork.com/jobs/Convert-Spot-Trading-BOT-Options-Trading-BOT_%7E01aa68f61d1a7d70ba?source=rss","processedDate":"2024-03-18T20:19:27.473Z","postedDate":"<b>Posted On</b>: March 14, 2024 12:50 UTC","id":"01aa68f61d1a7d70ba"},{"skillset":["Web Design","API Integration","Wix","Payoneer","PayPal","Shopify","Ecommerce Website"],"title":"Shopify Web Developer  - Upwork","description":"I need a simple, minimal and sales-generating website design that will display 10 women&#039;s belt products, and the completion of the relevant Instagram and Meta, WhatsApp business and shopify marketplace integration steps for sales.\nWe have all the content related to this. We request that the products be uploaded and sales integrations in the existing Shopify account be provided.\nTOTAL BUDGET: is 200$, \nWork to be completed within 10 days.\nApplications that do not start with &amp;quot;Tansu&amp;quot; will not be evaluated.<b>Skills</b>:        Web Design,                     API Integration,                     Wix,                     Payoneer,                     PayPal,                     Shopify,                     Ecommerce Website            ","link":"https://www.upwork.com/jobs/Shopify-Web-Developer_%7E017f9db4dd67cad382?source=rss","processedDate":"2024-03-18T20:19:27.473Z","postedDate":"<b>Posted On</b>: March 14, 2024 12:35 UTC","id":"017f9db4dd67cad382"},{"skillset":["Autodesk Fusion 360"],"title":"Modify 3d model files for customization project - Upwork","description":"This is an initial job to try out for an ongoing contract to do this work on a weekly basis. \nSummary: Modify an STL file I will provide in Fusion 360 and load it into Prusa Slicer. Then output the gcode files for Prusa Slicer into folders for 3d printing.\nFull instructions can be found here: https://docs.google.com/spreadsheets/d/1-28S3BkyeXVYms0VFR1KmH8fPAEc3zSVqYgfS9hHDdU/edit<b>Skills</b>:        Autodesk Fusion 360            ","link":"https://www.upwork.com/jobs/Modify-model-files-for-customization-project_%7E01d61e09a7db6277ad?source=rss","processedDate":"2024-03-18T20:19:27.473Z","postedDate":"<b>Posted On</b>: March 14, 2024 12:29 UTC","id":"01d61e09a7db6277ad"},{"skillset":["SAP"],"title":"SAP SRM Functionalities - Upwork","description":"We are looking for the candidate having more than 8 years of experience in below technologies, with Good Communication Skills , Maintain Pace in Communication, Have Extensive Knowledge in coding using various languages\nSkills - SAP SRM , SAP ECC, Workflow,Webdynpro, FPM, OOABAP,U15\nTiming&nbsp;&nbsp;: Flexible\nDuration : 1 hr\nBudget - 1k/2k\nWork type -Remote Work Via Zoom call<b>Skills</b>:        SAP            ","link":"https://www.upwork.com/jobs/SAP-SRM-Functionalities_%7E015ade88b2cbcdcde6?source=rss","processedDate":"2024-03-18T20:19:27.473Z","postedDate":"<b>Posted On</b>: March 14, 2024 11:12 UTC","id":"015ade88b2cbcdcde6"},{"skillset":["Microsoft Excel","Data Entry","English"],"title":"Sales Agent in U.S. - Upwork","description":"\nWe&#039;re looking for an experienced Sales Agent with expertise in precision machining, hydraulic spare parts components, and valves to join our team for an exciting new project. This opportunity involves identifying and pursuing new avenues for growth while enhancing customer engagement.\nDeliver comprehensive technical product sales presentations to customers across all levels, including engineering, maintenance, and procurement teams.\nKey Skills:\n- Sales experience in precision machining, hydraulic spare parts, or valves\n- Ability to build and maintain client relationships\nIf you&#039;re a motivated salesperson who loves precision machining, hydraulic spare parts, and valves, we&#039;d love to see your application.<b>Skills</b>:        Microsoft Excel,                     Data Entry,                     English            ","link":"https://www.upwork.com/jobs/Sales-Agent_%7E01a7078e283369171e?source=rss","processedDate":"2024-03-18T20:19:27.473Z","postedDate":"<b>Posted On</b>: March 14, 2024 10:54 UTC","id":"01a7078e283369171e"},{"skillset":["Smart Contract","Solana","Rust"],"title":"Solana program developer - Upwork","description":"I need a rust smart contract developer who can calculate price from Raydium AMM Pool.\nCan you implement this on-chain so we can use it to calculate the coefficient and the contest result?\n1. Grab mints (tokenA, tokenB) from Raydium Pool Address\n2. Get the tokenA worth in tokenB\nPlease send a proposal with correct answer if u have experience in this field.<b>Skills</b>:        Smart Contract,                     Solana,                     Rust            ","link":"https://www.upwork.com/jobs/Solana-program-developer_%7E01547c09d8b90e4157?source=rss","processedDate":"2024-03-18T20:19:27.473Z","postedDate":"<b>Posted On</b>: March 14, 2024 08:51 UTC","id":"01547c09d8b90e4157"}]