[{"skillset":["Market Research","Data Entry","Company Research","Market Analysis","Research Methods","Microsoft Excel","Data Analysis","Data Mining"],"title":"&quot;Summoning Analytical Wizards: Dive into Research Analyst Positions Today!&quot; - Upwork","description":"&amp;quot;Empower Decision-Making: Research Analyst Agency Wanted!&amp;quot;\nKey Responsibilities:\n&bull;\tConduct research on various topics, including market trends, competitor analysis, and customer behavior.\n&bull;\tCollect and analyze data from multiple sources, such as databases and surveys.\n&bull;\tInterpret data to identify patterns and trends for strategic decision-making.\n&bull;\tPrepare reports and presentations to communicate findings to stakeholders.\n&bull;\tCollaborate with teams to support business initiatives and research objectives.\n&bull;\tDevelop and implement research methodologies and tools for efficiency.\n&bull;\tMaintain data integrity and accuracy throughout the research process.\nQualifications:\n&bull;\tBachelor&#039;s degree in Economics, Statistics, Business, or Finance (Master&#039;s preferred).\n&bull;\t2+ years of experience in research or analytics, preferably in a corporate setting.\n&bull;\tProficiency in data analysis tools like Excel, SPSS, SAS, R, or Python.\n&bull;\tStrong analytical skills with attention to detail and accuracy.\n&bull;\tExcellent communication skills for conveying complex findings.\n&bull;\tAbility to work independently and manage multiple projects.\n&bull;\tProblem-solving skills and proactive approach to challenges.\n&bull;\tFamiliarity with research methodologies and statistical concepts.\n&bull;\tJoin us in our dynamic team!\nPlease Note:\n1.\tFixed rate per milestone, typically 1-2 weeks.\n2.\tProject duration less than one month.\n3.\tSeeking agencies with expertise; individuals need not apply.\n4.\tAsian agencies encouraged to apply.<b>Skills</b>:        Market Research,                     Data Entry,                     Company Research,                     Market Analysis,                     Research Methods,                     Microsoft Excel,                     Data Analysis,                     Data Mining            ","link":"https://www.upwork.com/jobs/quot-Summoning-Analytical-Wizards-Dive-into-Research-Analyst-Positions-Today-quot_%7E01c5d6b3cafac3fe22?source=rss","processedDate":"2024-03-18T20:19:18.245Z","postedDate":"<b>Posted On</b>: March 18, 2024 16:30 UTC","id":"01c5d6b3cafac3fe22"},{"skillset":["Qualitative Research","Data Analysis","Market Analysis","Market Research","Report","Data Entry","Data Mining"],"title":"Hiring Research Analysts to Drive Innovation - Upwork","description":"\nWe are on the lookout for a highly motivated and detail-oriented Research Analyst agency. The selected agency will play a crucial role in gathering, analyzing, and interpreting data to offer actionable insights and recommendations that support decision-making processes within our organization.\nThe ideal candidate will possess:\n&bull; Strong analytical skills\n&bull; A keen eye for detail\n&bull; The ability to work effectively both independently and as part of a team\nKey Responsibilities:\n&bull; Conduct research on various topics, including market trends, industry developments, competitor analysis, and customer behavior.\n&bull; Collect and analyze data from multiple sources, such as databases, surveys, interviews, and secondary research materials.\n&bull; Interpret data to identify patterns, trends, and correlations that inform strategic decision-making.\n&bull; Prepare reports, presentations, and other materials to effectively communicate research findings and recommendations to key stakeholders.\n&bull; Collaborate with cross-functional teams to support business initiatives and address specific research objectives.\n&bull; Assist in the development and implementation of research methodologies and tools to enhance efficiency and effectiveness.\n&bull; Maintain data integrity and accuracy throughout the research process to ensure the reliability of findings.\nQualifications:\n&bull; Bachelor&#039;s degree in a related field such as Economics, Statistics, Business, or Finance; Master&#039;s degree preferred.\n&bull; 2+ years of experience in a research or analytical role, preferably in a corporate or consulting environment.\n&bull; Proficiency in data analysis tools and software, such as Excel, SPSS, SAS, R, or Python.\n&bull; Strong analytical skills with the ability to collect, organize, analyze, and present significant amounts of information with attention to detail and accuracy.\n&bull; Excellent written and verbal communication skills, capable of effectively communicating complex concepts and findings to diverse audiences.\n&bull; Proven ability to work independently and manage multiple projects simultaneously, meeting tight deadlines.\n&bull; Strong problem-solving skills and a proactive approach to identifying and addressing research challenges.\n&bull; Familiarity with research methodologies, quantitative and qualitative data analysis techniques, and statistical concepts.\nPlease Note:\n1. Payment is based on fixed rates per milestone, with each milestone typically lasting 1 to 2 weeks.\n2. The project duration will be less than one month.\n3. We are specifically seeking agencies with expertise as described; individual applications will not be considered.\n4. We encourage agencies from Asia to apply and be part of our dynamic team.\nIf you believe your agency is the best fit for this role and meets the qualifications above, we invite you to apply and join us in our exciting journey!<b>Skills</b>:        Qualitative Research,                     Data Analysis,                     Market Analysis,                     Market Research,                     Report,                     Data Entry,                     Data Mining            ","link":"https://www.upwork.com/jobs/Hiring-Research-Analysts-Drive-Innovation_%7E01c470b88659870cd8?source=rss","processedDate":"2024-03-18T20:19:18.246Z","postedDate":"<b>Posted On</b>: March 18, 2024 16:20 UTC","id":"01c470b88659870cd8"},{"skillset":["API Integration","Python","API","Python Script","Binance Coin","Cryptocurrency"],"title":"Binance script in python - Upwork","description":"I have a python script made by a talent on this platform but it couldn&#039;t be finished correctly, I need someone who has time and fixes what&#039;s missing (not many things)<b>Skills</b>:        API Integration,                     Python,                     API,                     Python Script,                     Binance Coin,                     Cryptocurrency            ","link":"https://www.upwork.com/jobs/Binance-script-python_%7E01625b0b6990f646bc?source=rss","processedDate":"2024-03-18T20:19:18.246Z","postedDate":"<b>Posted On</b>: March 18, 2024 16:20 UTC","id":"01625b0b6990f646bc"},{"skillset":["Google Ads","Google Analytics"],"title":"Google Ads script developer - Upwork","description":"We are an AI company that is working on the next-generation marketing campaign strategies. \nWe are looking for a Google Ads Script Developer to \n- Design, develop, and maintain Google Ads scripts to automate routine tasks, including bid adjustments, budget allocation, and ad scheduling.\n- Create custom scripts to generate reports and dashboards that provide insights into campaign performance.\nAn ideal candidate should have\n- Proven experience in developing Google Ads scripts.\n- Strong proficiency in JavaScript and familiarity with Google Ads API.\n- Deep understanding of Google Ads campaign management and optimization techniques.\n- Ability to analyze complex data and translate insights into actionable script strategies.<b>Skills</b>:        Google Ads,                     Google Analytics            ","link":"https://www.upwork.com/jobs/Google-Ads-script-developer_%7E0149eba6cdcb7c2e5c?source=rss","processedDate":"2024-03-18T20:19:18.246Z","postedDate":"<b>Posted On</b>: March 18, 2024 12:46 UTC","id":"0149eba6cdcb7c2e5c"},{"skillset":["Python","Linux","Ubuntu","Server Administration"],"title":"All-in-one Ubuntu server metrics collection script - Upwork","description":"I am looking for a single script to run periodically on servers, that will report as much information as possible about the machine&#039;s status and activity, such as:\n- CPU information\n- CPU load, overall and per-core\n- System load\n- RAM total/used/cached\n- Network adapters and in/out activity\n- List of network peers using more than 100Kbps\n- Storage devices and usage (space, R/W speed and IOPS)\nIf Nvidia GPU(s) are detected:\n- GPU name/info\n- Utilization according to nvidia-smi (encoder, decoder, memory, etc).\nThis should then be compiled into a JSON text and POSTed to another server\nThis script should be able to run once per 10-15 seconds without increasing system load too much<b>Skills</b>:        Python,                     Linux,                     Ubuntu,                     Server Administration            ","link":"https://www.upwork.com/jobs/All-one-Ubuntu-server-metrics-collection-script_%7E01416668227321fb64?source=rss","processedDate":"2024-03-18T20:19:18.246Z","postedDate":"<b>Posted On</b>: March 18, 2024 08:46 UTC","id":"01416668227321fb64"},{"skillset":["Automation","Scrapy","R"],"title":"Urgent R script Bug fixed  - Upwork","description":"I have an working R script try to scrape symbols based on company name and their prices, however, some international exchange cannnot find the corresponding symbols. Please try to find all of them.\nI also need return institutional holders for each of the companies on the list. Also return total amount of shares and total value held by each institutional holder. This will require you to query 13-F filings and indicate who has institutional holdings of any of the companies listed on the HFCAA webpage.<b>Skills</b>:        Automation,                     Scrapy,                     R            ","link":"https://www.upwork.com/jobs/Urgent-script-Bug-fixed_%7E019a5676f696f1a131?source=rss","processedDate":"2024-03-18T20:19:18.246Z","postedDate":"<b>Posted On</b>: March 17, 2024 19:04 UTC","id":"019a5676f696f1a131"},{"skillset":["Python","Java","API"],"title":"POC development using robot framework, camunda - Upwork","description":"We are building a poc using open source rpa tools. The person who will be hired should be able to provide examples of using different open source rpa tools such as robot framework, camunda, selenium, etc\nThis is a long term project if we find the right resource. \nMust be outcome based and agile. This is more of a r&amp;amp;d project till we finalise the solution approach.\nThank you. <b>Skills</b>:        Python,                     Java,                     API            ","link":"https://www.upwork.com/jobs/POC-development-using-robot-framework-camunda_%7E0113e44a5f1a8afc2f?source=rss","processedDate":"2024-03-18T20:19:18.246Z","postedDate":"<b>Posted On</b>: March 16, 2024 04:02 UTC","id":"0113e44a5f1a8afc2f"},{"skillset":["MATLAB","Economics"],"title":"Verify code for Hansen's RBC model with indivisible labour. (code provided)  - Upwork","description":"I need my matlab code that is recreating a version of Hansen&#039;s RBC model with indivisible labour to be verified and checked for mistakes. I don&#039;t know if my results are correct. <b>Skills</b>:        MATLAB,                     Economics            ","link":"https://www.upwork.com/jobs/Verify-code-for-Hansen-RBC-model-with-indivisible-labour-code-provided_%7E019aaeb0f37c1b4f2d?source=rss","processedDate":"2024-03-18T20:19:18.246Z","postedDate":"<b>Posted On</b>: March 16, 2024 02:12 UTC","id":"019aaeb0f37c1b4f2d"},{"skillset":["Google Sheets","ChatGPT","ChatGPT API","JavaScript","Google Apps Script","Google Docs","API","Spreadsheet Software","Data Entry","Microsoft Excel"],"title":"Incorporate ChatGPT into Google Sheets - Upwork","description":"To use ChatGPT with Google Sheets, you can follow these steps:\n1. Open Google Sheets and navigate to &amp;quot;Extensions ~ Add-ons ~ Get add-ons&amp;quot; to open the Google Workspace Marketplace.\n2. Search for &amp;quot;ChatGPT&amp;quot; in the marketplace and install the ChatGPT add-on for Google Sheets.\n3. After installation, activate ChatGPT integration in Google Sheets.\n4. Obtain an API key from OpenAI&#039;s portal and input it into the ChatGPT add-on in Google Sheets to enable API access.\n5. Use specific ChatGPT functions in your spreadsheet, like generating text, translations, and applying formulas.\nFor more detailed instructions, including setting up API access and using specific functions, visit the original guide on Analytics Vidhya: [How to Use ChatGPT for Google Sheets](https://www.analyticsvidhya.com/blog/2023/09/how-to-use-chat-gpt-for-google-sheets/)<b>Skills</b>:        Google Sheets,                     ChatGPT,                     ChatGPT API,                     JavaScript,                     Google Apps Script,                     Google Docs,                     API,                     Spreadsheet Software,                     Data Entry,                     Microsoft Excel            ","link":"https://www.upwork.com/jobs/Incorporate-ChatGPT-into-Google-Sheets_%7E01ece770ad5d03989f?source=rss","processedDate":"2024-03-18T20:19:18.246Z","postedDate":"<b>Posted On</b>: March 15, 2024 08:34 UTC","id":"01ece770ad5d03989f"},{"skillset":["PDF","Google Sheets","Ebook File Format","Ebook Formatting"],"title":"Convert Google Sheets to Formatted PDF Report - Upwork","description":"Create a process by which we can take google sheet links and submit them to return us a report with the information in each row placed specifically as requested, one per page as a PDF report with the ability to alter all aspects of stylization including font, size, placement and margins. \nThank you<b>Skills</b>:        PDF,                     Google Sheets,                     Ebook File Format,                     Ebook Formatting            ","link":"https://www.upwork.com/jobs/Convert-Google-Sheets-Formatted-PDF-Report_%7E015839291b438a2b07?source=rss","processedDate":"2024-03-18T20:19:18.246Z","postedDate":"<b>Posted On</b>: March 15, 2024 08:26 UTC","id":"015839291b438a2b07"},{"skillset":["Selenium","Data Scraping","Scrapy","Python"],"title":"Linkedin company website scraping - Upwork","description":"need to create a very simple scraping tool to get me the Company Website , from the Linkedin Profile or Linkedin Sales Navigator profile\nthe process is following \ni can provide json formated or csv formated data as in attached example and in a return i need to get company URL\ni&nbsp;&nbsp;can provide linkedin sales session cookie also\nhere are some urls examples:\nhttps://www.linkedin.com/in/ACwAAAeMB_gBtkBggmf6o9DtHyNzqcdbEb7JtZ0\nand \nhttps://www.linkedin.com/sales/people/ACwAAAeMB_gBtkBggmf6o9DtHyNzqcdbEb7JtZ0,NAME_SEARCH,aXtc\ni need to get \nhttps://www.creagroupevents.com/en-US/\nOR&nbsp;&nbsp;here is another example\nhttps://www.linkedin.com/sales/lead/ACwAAAiEQLYBapjaZhFUp4_a4c6eD6A3yBLG13M,NAME_SEARCH,pDS-\nhttps://www.linkedin.com/in/ACwAAAiEQLYBapjaZhFUp4_a4c6eD6A3yBLG13M\ni need to get\nhttps://ags-expo.com/\nnot looking for a service i am looking for a tool<b>Skills</b>:        Selenium,                     Data Scraping,                     Scrapy,                     Python            ","link":"https://www.upwork.com/jobs/Linkedin-company-website-scraping_%7E01b3dbb9d6d43b449f?source=rss","processedDate":"2024-03-18T20:19:18.246Z","postedDate":"<b>Posted On</b>: March 14, 2024 10:57 UTC","id":"01b3dbb9d6d43b449f"},{"skillset":["Microsoft Azure","Microsoft Azure SQL Database","DevOps","Azure DevOps","Microsoft Power BI","ETL Pipeline"],"title":"Azure DevOps / Power BI Engineer - Upwork","description":"Job Summary:\nWe are seeking an experienced Azure DevOps/Power BI Engineer to join our team. In this role, you will be responsible for managing and creating data visualizations, dashboards, and reports using Power BI and other business intelligence tools. You will work closely with stakeholders to understand their data analysis requirements, transform, and analyze data from various sources, and create insightful presentations to communicate findings and recommendations.\nResponsibilities:\n&bull;\tDashboard and Report Development:\n-\tDesign, develop, and maintain interactive Power BI dashboards, reports, and data visualizations to provide actionable insights to business users.\n-\tCollaborate with stakeholders to understand their reporting needs and translate them into intuitive and user-friendly dashboards.\n-\tImplement best practices for data visualization, layout, and user experience to ensure effective communication of insights\n&bull;\tData Transformation and Analysis:\n-\tExtract, transform, and load data from various sources (databases, APIs, flat files, etc.) into a data model optimized for reporting and analysis.\n-\tPerform data cleansing, transformation, and integration tasks using Power Query, DAX, and other data manipulation tools.\n-\tConduct advanced data analysis, including statistical analysis, data mining, and predictive modeling, to uncover insights and patterns\n&bull;\tAzure DevOps and Automation:\n-\tLeverage Azure DevOps for efficient deployment, versioning, and lifecycle management of Power BI solutions.\n-\tImplement continuous integration and deployment (CI/CD) pipelines for automated testing, building, and releasing Power BI artifacts.\n-\tAutomate data refresh and update processes to ensure timely and accurate data delivery\n&bull;\tPresentation and Communication:\n-\tCreate compelling data-driven presentations and reports to communicate insights, recommendations, and findings to stakeholders and decision-makers.\n-\tCollaborate with cross-functional teams to understand business requirements and translate data insights into actionable strategies.\n-\tConduct training sessions and knowledge-sharing activities to upskill team members on Power BI and data analysis techniques.\nQualifications:\n&bull;\tProven experience with Power BI, DAX, Power Query, and other data visualization and manipulation tools\n&bull;\tStrong understanding of data warehousing, ETL processes, and data modeling best practices\n&bull;\tExperience with Azure DevOps\n&bull;\tProficiency in SQL and scripting languages (e.g., Python, R) for data transformation and analysis\n&bull;\tExcellent communication and presentation skills, with the ability to convey complex data insights to technical and non-technical audiences.\n&bull;\tAnalytical and problem-solving skills, with a focus on data-driven decision-making\n&bull;\tFamiliarity with agile methodologies and project management practices<b>Skills</b>:        Microsoft Azure,                     Microsoft Azure SQL Database,                     DevOps,                     Azure DevOps,                     Microsoft Power BI,                     ETL Pipeline            ","link":"https://www.upwork.com/jobs/Azure-DevOps-Power-Engineer_%7E01a82182c162282d90?source=rss","processedDate":"2024-03-18T20:19:18.246Z","postedDate":"<b>Posted On</b>: March 14, 2024 10:49 UTC","id":"01a82182c162282d90"},{"skillset":["Genomics","Sequence Analysis","Bioinformatics","Data Science","Python","R","Genomic Data Analysis","Jupyter Notebook"],"title":"BioInformatics Expert - Upwork","description":"Looking for an experienced Sr. Bioinformaticist to help guide and implement components of our new application. Ideally, you are&nbsp;&nbsp;an expert in popular Bioinformatic pipelines like RNA-Seq and Amplicon-Seq. Understanding the different tools available to perform research and subsequent graphs, charts, plots for each of those pipelines is critical. Hands-on experience with Nextflow and pipelines available through the nf-core community is also required.<b>Skills</b>:        Genomics,                     Sequence Analysis,                     Bioinformatics,                     Data Science,                     Python,                     R,                     Genomic Data Analysis,                     Jupyter Notebook            ","link":"https://www.upwork.com/jobs/BioInformatics-Expert_%7E01c407e2a190be1029?source=rss","processedDate":"2024-03-18T20:19:18.246Z","postedDate":"<b>Posted On</b>: March 14, 2024 07:46 UTC","id":"01c407e2a190be1029"},{"skillset":["JavaScript","Python","JSON","C#","Data Extraction","Data Scraping"],"title":"Help finish JSON files and metadata for NFT collection on Solana - Upwork","description":"i will copy paste the instructions here. then i can share art with you. there are many traits that have different color versions because the skin of the NFT is different color versions too.\nexamples: \nPNG/JPEG/GIF Metadata\nhttps://drive.google.com/drive/folders/1OfqHtbR1oBw2hTcLGHXpxOMnEU7GEmxV?usp=sharing\nMP4 Metadata\nhttps://drive.google.com/drive/folders/1GMIRpAA45zsh8w4YTPKQkLBZg-U59fh1?usp=sharing\nPlease make sure the following are done in your metadata:\nFile Names : Files should start at an index of 0. First file names should be 0.json/0.png\nPOINTS : With the introduction of cmv2, all json files will have to point to their respective png/jpeg/gif/mp4 files. Please check the examples.\n&amp;quot;image&amp;quot;: &amp;quot;image.png&amp;quot;, &amp;amp; &amp;quot;uri&amp;quot;: &amp;quot;image.png&amp;quot;, ❌ \n&amp;quot;image&amp;quot;: &amp;quot;0.png&amp;quot;, &amp;amp; &amp;quot;uri&amp;quot;: &amp;quot;0.png&amp;quot;, ✅ \nTRAITS&nbsp;&nbsp;: All attributes and traits are strings. This means they do not have to point to any files. Attributes should look like this: Red Hat ; not like this: red_hat_012.png\nGood Practices:\nAlthough not required, please make sure your mp4 falls back on a png/jpg/gif file. This prevents the NFT from breaking visually or buffering errors. JSONs with mp4&#039;s should always have a png/jpg/gif counterpart inside. Please look at the mp4 example metadata for reference.\nPlease make sure files are 5-10mb per unique image<b>Skills</b>:        JavaScript,                     Python,                     JSON,                     C#,                     Data Extraction,                     Data Scraping            ","link":"https://www.upwork.com/jobs/Help-finish-JSON-files-and-metadata-for-NFT-collection-Solana_%7E0109014627f1937fb3?source=rss","processedDate":"2024-03-18T20:19:18.246Z","postedDate":"<b>Posted On</b>: March 12, 2024 21:36 UTC","id":"0109014627f1937fb3"},{"skillset":["Forex Trading","MetaTrader 5","Automation","MQL 5"],"title":"Creating EA for Metatrader 5 - Upwork","description":"Looking forward to have someone on board to make EAs for MT5. <b>Skills</b>:        Forex Trading,                     MetaTrader 5,                     Automation,                     MQL 5            ","link":"https://www.upwork.com/jobs/Creating-for-Metatrader_%7E01bf668b9a3c8c6c8b?source=rss","processedDate":"2024-03-18T20:19:18.246Z","postedDate":"<b>Posted On</b>: March 12, 2024 15:57 UTC","id":"01bf668b9a3c8c6c8b"},{"skillset":["BigQuery","Big Data","MySQL","SQL"],"title":"Big query expert - Upwork","description":"## BigQuery Analyst/Engineer\n**Company:** [Your Company Name]\n**About Us:**\n[Insert a brief description of your company and its use of BigQuery]\n**Summary:**\nWe are searching for a talented BigQuery Analyst/Engineer to join our team and play a key role in leveraging the power of Google BigQuery for data analysis and insights.&nbsp;&nbsp;\n**Responsibilities:**\n* Design, develop, and execute complex SQL queries to extract and transform data from BigQuery datasets.\n* Build and maintain data pipelines for efficient data loading and transformation.\n* Collaborate with data scientists and business stakeholders to understand data requirements and translate them into actionable insights.\n* Develop and document data quality checks and procedures to ensure data accuracy and consistency.\n* Optimize BigQuery queries for performance and cost-efficiency.\n* Stay up-to-date on the latest features and functionalities of BigQuery.\n* May involve creating dashboards and visualizations to communicate insights to stakeholders (depending on the specific role).\n* Participate in the development and implementation of data governance strategies for BigQuery.\n**Qualifications:**\n* Proven experience working with SQL and relational databases.\n* Experience with BigQuery or a similar cloud data warehouse solution (preferred).\n* Strong analytical and problem-solving skills.\n* Excellent communication and collaboration skills.\n* Ability to work independently and as part of a team.\n* Familiarity with data modeling concepts is a plus.\n* Experience with scripting languages like Python or R (a plus). \n**Benefits:**\n[List your company&#039;s benefits package highlights here]\n**To Apply:**\nPlease submit your resume and cover letter to [email protected]\n**Note:**\n* You can tailor this description to be more specific to your company&#039;s needs. \n*&nbsp;&nbsp;For example, if the role requires experience with specific BigQuery features or data visualization tools, you can mention those in the qualifications section.\n*&nbsp;&nbsp;You can also specify whether the role is focused more on data analysis or data engineering.<b>Skills</b>:        BigQuery,                     Big Data,                     MySQL,                     SQL            ","link":"https://www.upwork.com/jobs/Big-query-expert_%7E01ecf1ae24f1a4c2a6?source=rss","processedDate":"2024-03-18T20:19:18.246Z","postedDate":"<b>Posted On</b>: March 12, 2024 14:12 UTC","id":"01ecf1ae24f1a4c2a6"},{"skillset":["Market Research","Data Entry","Company Research","Market Analysis","Research Methods","Microsoft Excel","Data Analysis","Data Mining"],"title":"&quot;Calling All Analytical Wizards: Research Analyst Positions Await!&quot; - Upwork","description":"&amp;quot;Empower Decision-Making: Research Analyst Agency Wanted!&amp;quot;\nKey Responsibilities:\n&bull;\tConduct research on various topics, including market trends, competitor analysis, and customer behavior.\n&bull;\tCollect and analyze data from multiple sources, such as databases and surveys.\n&bull;\tInterpret data to identify patterns and trends for strategic decision-making.\n&bull;\tPrepare reports and presentations to communicate findings to stakeholders.\n&bull;\tCollaborate with teams to support business initiatives and research objectives.\n&bull;\tDevelop and implement research methodologies and tools for efficiency.\n&bull;\tMaintain data integrity and accuracy throughout the research process.\nQualifications:\n&bull;\tBachelor&#039;s degree in Economics, Statistics, Business, or Finance (Master&#039;s preferred).\n&bull;\t2+ years of experience in research or analytics, preferably in a corporate setting.\n&bull;\tProficiency in data analysis tools like Excel, SPSS, SAS, R, or Python.\n&bull;\tStrong analytical skills with attention to detail and accuracy.\n&bull;\tExcellent communication skills for conveying complex findings.\n&bull;\tAbility to work independently and manage multiple projects.\n&bull;\tProblem-solving skills and proactive approach to challenges.\n&bull;\tFamiliarity with research methodologies and statistical concepts.\n&bull;\tJoin us in our dynamic team!\nPlease Note:\n1.\tFixed rate per milestone, typically 1-2 weeks.\n2.\tProject duration less than one month.\n3.\tSeeking agencies with expertise; individuals need not apply.\n4.\tAsian agencies encouraged to apply.<b>Skills</b>:        Market Research,                     Data Entry,                     Company Research,                     Market Analysis,                     Research Methods,                     Microsoft Excel,                     Data Analysis,                     Data Mining            ","link":"https://www.upwork.com/jobs/quot-Calling-All-Analytical-Wizards-Research-Analyst-Positions-Await-quot_%7E01d5b1dc3fa4e44365?source=rss","processedDate":"2024-03-18T20:19:18.246Z","postedDate":"<b>Posted On</b>: March 11, 2024 15:02 UTC","id":"01d5b1dc3fa4e44365"},{"skillset":["Statistics","R","Time Series Analysis","Time Series Forecasting","RStudio","Data Analysis"],"title":"Time Series Forecasting - Upwork","description":"Task Specifications\nTask: Choose time series data with at least 60 time points from data in the Gulf region and do appropriate analysis and forecasting on this time series data.\n1) Introduction: Introduce the problem you are investigating.\n2) Literature review: What does the literature says about your problem.\n3) Data: Choose time series data with at least 60 time points from data in the Gulf region\n4) Model building: Based on a training data, use the model building strategies&nbsp;&nbsp;to defend a model that you can use further for forecasting\n5) Forecasting: Using a hold-out sample (or testing data), to check the accuracy of your forecast from the model you selected earlier in (4).\n6) Results: explain important analysis results from your work on the time series data\n7) Summary: summarize all the work you have done in this paper\n8) Conclusion: provide the summary of your work in relations to the existing literature.\n9) Appendix: Must include data, output, and time series R command file\nFormat:\n12 point font with 1 inch margins. The report must not be more than 5 pages. If it needs to be more, please ask permission first before submitting.<b>Skills</b>:        Statistics,                     R,                     Time Series Analysis,                     Time Series Forecasting,                     RStudio,                     Data Analysis            ","link":"https://www.upwork.com/jobs/Time-Series-Forecasting_%7E01dfbb43cf2530cbe6?source=rss","processedDate":"2024-03-18T20:19:18.246Z","postedDate":"<b>Posted On</b>: March 11, 2024 16:20 UTC","id":"01dfbb43cf2530cbe6"},{"skillset":["AI Trading","Data Extraction","Cryptocurrency","API","Bitcoin","Bot Development","Market Research","Data Scraping","Python"],"title":"Crypto Arbitrage Bot in The Netherlands - Upwork","description":"I want you to make a crypto arbitrage trading bot.\nIt would be optimal if this bot trades by itself, but if this is impossible, it is also fine if it only states the arbitrages. \nI prefer a Dutch developer, because I live here and I want a trading bot for the Dutch crypto &#039;bookies&#039;. \nSomething like this would be great: https://youtu.be/7jZI7SBmTRU?si=YB4o4FO7QocJ1r2D <b>Skills</b>:        AI Trading,                     Data Extraction,                     Cryptocurrency,                     API,                     Bitcoin,                     Bot Development,                     Market Research,                     Data Scraping,                     Python            ","link":"https://www.upwork.com/jobs/Crypto-Arbitrage-Bot-The-Netherlands_%7E01c5e045b17adcb85f?source=rss","processedDate":"2024-03-18T20:19:18.246Z","postedDate":"<b>Posted On</b>: March 11, 2024 15:55 UTC","id":"01c5e045b17adcb85f"},{"skillset":["Ruby","Ruby on Rails","PostgreSQL","PostgreSQL Programming","API"],"title":"Ruby on Rails Developer - Upwork","description":"We are seeking a skilled Ruby on Rails developer to join our team. As a RoR developer, you will be responsible for designing, coding, and modifying our web applications. Your primary focus will be developing high-quality, scalable, and maintainable code using Ruby on Rails framework. You should have a strong understanding of the full stack development process and be able to work collaboratively with our team to ensure successful project completion.\nSkills required:\n- Ruby on Rails\n- HTML/CSS\n- JavaScript\n- SQL\n- Git\nThis is a medium-sized project with an estimated duration of 1 to 3 months. We are looking for an intermediate-level developer with a solid understanding of Ruby on Rails and web development principles.<b>Skills</b>:        Ruby,                     Ruby on Rails,                     PostgreSQL,                     PostgreSQL Programming,                     API            ","link":"https://www.upwork.com/jobs/Ruby-Rails-Developer_%7E010d11a035ace6c503?source=rss","processedDate":"2024-03-18T20:19:18.246Z","postedDate":"<b>Posted On</b>: March 11, 2024 11:24 UTC","id":"010d11a035ace6c503"},{"skillset":["Qualitative Research","Data Analysis","Market Analysis","Market Research","Report","Data Entry","Data Mining"],"title":"Seeking Experienced Research Analysts to Drive Innovation - Upwork","description":"Join Our Team as a Research Analyst Agency\nWe are on the lookout for a highly motivated and detail-oriented Research Analyst agency. The selected agency will play a crucial role in gathering, analyzing, and interpreting data to offer actionable insights and recommendations that support decision-making processes within our organization.\nThe ideal candidate will possess:\n&bull; Strong analytical skills\n&bull; A keen eye for detail\n&bull; The ability to work effectively both independently and as part of a team\nKey Responsibilities:\n&bull; Conduct research on various topics, including market trends, industry developments, competitor analysis, and customer behavior.\n&bull; Collect and analyze data from multiple sources, such as databases, surveys, interviews, and secondary research materials.\n&bull; Interpret data to identify patterns, trends, and correlations that inform strategic decision-making.\n&bull; Prepare reports, presentations, and other materials to effectively communicate research findings and recommendations to key stakeholders.\n&bull; Collaborate with cross-functional teams to support business initiatives and address specific research objectives.\n&bull; Assist in the development and implementation of research methodologies and tools to enhance efficiency and effectiveness.\n&bull; Maintain data integrity and accuracy throughout the research process to ensure the reliability of findings.\nQualifications:\n&bull; Bachelor&#039;s degree in a related field such as Economics, Statistics, Business, or Finance; Master&#039;s degree preferred.\n&bull; 2+ years of experience in a research or analytical role, preferably in a corporate or consulting environment.\n&bull; Proficiency in data analysis tools and software, such as Excel, SPSS, SAS, R, or Python.\n&bull; Strong analytical skills with the ability to collect, organize, analyze, and present significant amounts of information with attention to detail and accuracy.\n&bull; Excellent written and verbal communication skills, capable of effectively communicating complex concepts and findings to diverse audiences.\n&bull; Proven ability to work independently and manage multiple projects simultaneously, meeting tight deadlines.\n&bull; Strong problem-solving skills and a proactive approach to identifying and addressing research challenges.\n&bull; Familiarity with research methodologies, quantitative and qualitative data analysis techniques, and statistical concepts.\nPlease Note:\n1. Payment is based on fixed rates per milestone, with each milestone typically lasting 1 to 2 weeks.\n2. The project duration will be less than one month.\n3. We are specifically seeking agencies with expertise as described; individual applications will not be considered.\n4. We encourage agencies from Asia to apply and be part of our dynamic team.\nIf you believe your agency is the best fit for this role and meets the qualifications above, we invite you to apply and join us in our exciting journey!<b>Skills</b>:        Qualitative Research,                     Data Analysis,                     Market Analysis,                     Market Research,                     Report,                     Data Entry,                     Data Mining            ","link":"https://www.upwork.com/jobs/Seeking-Experienced-Research-Analysts-Drive-Innovation_%7E01ddb8ff4da0b65f07?source=rss","processedDate":"2024-03-18T20:19:18.246Z","postedDate":"<b>Posted On</b>: March 11, 2024 07:11 UTC","id":"01ddb8ff4da0b65f07"},{"skillset":["Application Integration","ChatGPT API Integration","Lead Generation","Data Scraping","Marketing Automation","Customer Relationship Management","Email Marketing","Data Mining","Sales"],"title":"AI Engineer - B2B Sales Process Automation Specialist - Upwork","description":"The Role:\nAs an AI Engineer specializing in B2B sales process automation, you will play a pivotal role in developing and implementing AI-driven solutions to streamline our sales operations, enhance customer engagement, and drive revenue growth. Your expertise in machine learning, data science, and AI technologies will enable us to automate complex sales tasks, predict customer behaviors, and personalize sales strategies. You will work closely with our sales, marketing, and IT teams to design, develop, and deploy scalable AI solutions that transform our sales processes.\nKey Responsibilities:\nDesign and develop AI models and algorithms to automate various stages of the sales process, including lead generation, qualification, and follow-ups.\nImplement machine learning and data analytics techniques to analyze sales data, predict customer behaviors, and identify sales opportunities.\nDevelop and deploy chatbots and virtual assistants to enhance customer interaction and support sales teams with real-time information.\nCollaborate with the IT and sales teams to integrate AI solutions into our existing sales platforms and CRM systems, ensuring seamless data flow and functionality.\nMonitor and evaluate the performance of AI-driven sales processes, making adjustments and improvements as necessary to optimize results.\nStay updated with the latest advancements in AI, machine learning, and sales technology trends, applying innovative solutions to keep our sales processes at the cutting edge.\nQualifications:\nProven experience as an AI Engineer, with a strong background in B2B sales process automation.\nExpertise in machine learning, natural language processing, and AI technologies, with a track record of implementing successful AI projects.\nStrong programming skills in languages such as Python, R, or Java.\nExperience with AI development frameworks and tools (e.g., TensorFlow, PyTorch).\nKnowledge of CRM systems and sales automation tools.\nExcellent analytical and problem-solving abilities, with a keen eye for detail and a creative approach to tackling challenges.\nStrong communication skills, with the ability to translate complex technical concepts into clear, actionable insights for non-technical team members.\nBachelor&rsquo;s or Master&rsquo;s degree in Computer Science, AI, Data Science, or a related field.<b>Skills</b>:        Application Integration,                     ChatGPT API Integration,                     Lead Generation,                     Data Scraping,                     Marketing Automation,                     Customer Relationship Management,                     Email Marketing,                     Data Mining,                     Sales            ","link":"https://www.upwork.com/jobs/Engineer-B2B-Sales-Process-Automation-Specialist_%7E01e7d6ca0940a8a51d?source=rss","processedDate":"2024-03-18T20:19:18.246Z","postedDate":"<b>Posted On</b>: March 11, 2024 04:13 UTC","id":"01e7d6ca0940a8a51d"},{"skillset":["Data Analysis","SurveyMonkey","R","Survey Design","Online Research","Qualtrics","QuestionPro","Data Scraping","RStudio","SurveyGizmo","JavaScript","R Shiny","Survey","Front-End Development","Internet Survey","jQuery"],"title":"Help with prolific - Upwork","description":"I need someone to setup my longitudinal study on prolific.com. i am only using Prolific to obtain participants. i will be conducting the study using the Qualtrics.com website.<b>Skills</b>:        Data Analysis,                     SurveyMonkey,                     R,                     Survey Design,                     Online Research,                     Qualtrics,                     QuestionPro,                     Data Scraping,                     RStudio,                     SurveyGizmo,                     JavaScript,                     R Shiny,                     Survey,                     Front-End Development,                     Internet Survey,                     jQuery            ","link":"https://www.upwork.com/jobs/Help-with-prolific_%7E017e06ac41f3a9a9e6?source=rss","processedDate":"2024-03-18T20:19:18.246Z","postedDate":"<b>Posted On</b>: March 10, 2024 22:49 UTC","id":"017e06ac41f3a9a9e6"},{"skillset":["R","Finance","Web Scraping"],"title":"R code, scrape single web page, ticker symbol, return market cap and institutional holdings - Upwork","description":"Retrieve the entire company list from the SEC&#039;s Holding Foreign Companies Accountable Act HFCAA Page: https://www.sec.gov/hfcaa\nConvert the company list to stock ticker symbols. The companies are traded on several US exchanges. Modify company names as required to ensure complete return of ticker symbols. There is a stack overflow discussion on some of the challenges to work through this step. This step could be challenging if you are not familiar with R finance.\nAnnotate which exchange each company is trading on in the US.\nOutput a complete list of HFCAA&nbsp;&nbsp;company names and ticker symbols.\nTake the list of ticker symbols and return stock prices, market cap, and total daily trading volume.\nI&#039;d also like total market cap for the entire portfolio.\nPlease be familiar with finance and understand market cap calculations if you bid on this job.\nReturn institutional holders for each of the companies on the list. Also return total amount of shares and total value held by each institutional holder. This will require you to query 13-F filings and indicate who has institutional holdings of any of the companies listed on the HFCAA webpage.\nThe deliverable is:\n1) working R code that accesses the Internet and scrapes required web pages.\n2) output as a PDF where the top page is an overview of the HFCAA portfolio and the subsequent pages are specific details for each company.<b>Skills</b>:        R,                     Finance,                     Web Scraping            ","link":"https://www.upwork.com/jobs/code-scrape-single-web-page-ticker-symbol-return-market-cap-and-institutional-holdings_%7E019c67fe45fe7f44be?source=rss","processedDate":"2024-03-18T20:19:18.246Z","postedDate":"<b>Posted On</b>: March 10, 2024 19:58 UTC","id":"019c67fe45fe7f44be"},{"skillset":["Google Analytics","Product Management","Customer Data Platform","Ecommerce"],"title":"Technical Product Manager, Customer Data Platform - Upwork","description":"You will join a well regarded team of US entrepreneurs working on their next big thing.&nbsp;&nbsp;This project requires a PM team leader for a new kind of CDP targeting the Shopify market.&nbsp;&nbsp;\nCustomer Data Platform (CDP) Experience:\nFamiliarity with CDP concepts, architectures, and best practices.\nHands-on experience with CDP implementations and integrations.\nUnderstanding of CDP vendors and their capabilities.\nE-commerce and Shopify Plus Expertise:\nDeep understanding of e-commerce business models and strategies.\nKnowledge of Shopify Plus platform, its features, and API capabilities.\nExperience in managing and optimizing e-commerce product experiences.\nData Analytics and Insights:\nStrong analytical skills and the ability to derive insights from customer data.\nProficiency in data analysis tools and techniques (e.g., SQL, Python, R).\nExperience in creating and interpreting data visualizations and dashboards.\nMachine Learning and AI:\nKnowledge of machine learning concepts and algorithms.\nUnderstanding of how to apply ML and AI techniques to personalization and recommendation systems.\nFamiliarity with ML platforms and tools (e.g., TensorFlow, PyTorch, Google Cloud ML).\nCustomer Segmentation and Personalization:\nExpertise in customer segmentation techniques and strategies.\nUnderstanding of personalization algorithms and best practices.\nExperience in implementing and optimizing personalization campaigns.\nReal-Time Data Processing:\nKnowledge of real-time data processing architectures and technologies (e.g., Apache Kafka, Spark Streaming).\nExperience in designing and implementing real-time data pipelines.\nUnderstanding of how to leverage real-time data for personalized customer experiences.\nAPI Development and Integration:\nFamiliarity with API design principles and best practices.\nExperience in developing and integrating APIs (e.g., RESTful, GraphQL).\nKnowledge of API management tools and platforms.\nData Privacy and Security:\nUnderstanding of data privacy regulations (e.g., GDPR, CCPA) and their implications for CDPs.\nKnowledge of data security best practices and technologies.\nExperience in implementing data governance and compliance measures.\nAgile Development Methodologies:\nStrong understanding of Agile development principles and practices (e.g., Scrum, Kanban).\nExperience in leading and collaborating with cross-functional Agile teams.\nAbility to manage product backlogs, sprints, and deliverables effectively.\nDomain Expertise in Retail or Relevant Industry:\nDeep understanding of the retail industry or a relevant domain (e.g., beauty, fashion, consumer goods).\nKnowledge of industry-specific trends, challenges, and opportunities.\nAbility to leverage domain expertise to identify unique CDP use cases and solutions.\nBy seeking a Technical Product Manager with these specific skills, you can find a candidate who not only possesses general PM capabilities but also has the technical expertise, domain knowledge, and CDP-specific experience to drive innovation and give you a competitive edge in the industry.<b>Skills</b>:        Google Analytics,                     Product Management,                     Customer Data Platform,                     Ecommerce            ","link":"https://www.upwork.com/jobs/Technical-Product-Manager-Customer-Data-Platform_%7E0151a112f836fdad9d?source=rss","processedDate":"2024-03-18T20:19:18.246Z","postedDate":"<b>Posted On</b>: March 10, 2024 22:46 UTC","id":"0151a112f836fdad9d"},{"skillset":["Market Research","Data Entry","Company Research","Market Analysis","Research Methods","Microsoft Excel","Data Analysis","Data Mining"],"title":"Seeking Analytically Proficient Agencies for Research Analyst Positions - Upwork","description":"Join Our Team as a Research Analyst Agency\nWe are on the lookout for a highly motivated and detail-oriented Research Analyst agency. The selected agency will play a crucial role in gathering, analyzing, and interpreting data to offer actionable insights and recommendations that support decision-making processes within our organization.\nThe ideal candidate will possess:\n&bull; Strong analytical skills\n&bull; A keen eye for detail\n&bull; The ability to work effectively both independently and as part of a team\nKey Responsibilities:\n&bull; Conduct research on various topics, including market trends, industry developments, competitor analysis, and customer behavior.\n&bull; Collect and analyze data from multiple sources, such as databases, surveys, interviews, and secondary research materials.\n&bull; Interpret data to identify patterns, trends, and correlations that inform strategic decision-making.\n&bull; Prepare reports, presentations, and other materials to effectively communicate research findings and recommendations to key stakeholders.\n&bull; Collaborate with cross-functional teams to support business initiatives and address specific research objectives.\n&bull; Assist in the development and implementation of research methodologies and tools to enhance efficiency and effectiveness.\n&bull; Maintain data integrity and accuracy throughout the research process to ensure the reliability of findings.\nQualifications:\n&bull; Bachelor&#039;s degree in a related field such as Economics, Statistics, Business, or Finance; Master&#039;s degree preferred.\n&bull; 2+ years of experience in a research or analytical role, preferably in a corporate or consulting environment.\n&bull; Proficiency in data analysis tools and software, such as Excel, SPSS, SAS, R, or Python.\n&bull; Strong analytical skills with the ability to collect, organize, analyze, and present significant amounts of information with attention to detail and accuracy.\n&bull; Excellent written and verbal communication skills, capable of effectively communicating complex concepts and findings to diverse audiences.\n&bull; Proven ability to work independently and manage multiple projects simultaneously, meeting tight deadlines.\n&bull; Strong problem-solving skills and a proactive approach to identifying and addressing research challenges.\n&bull; Familiarity with research methodologies, quantitative and qualitative data analysis techniques, and statistical concepts.\nPlease Note:\n1. Payment is based on fixed rates per milestone, with each milestone typically lasting 1 to 2 weeks.\n2. The project duration will be less than one month.\n3. We are specifically seeking agencies with expertise as described; individual applications will not be considered.\n4. We encourage agencies from Asia to apply and be part of our dynamic team.\nIf you believe your agency is the best fit for this role and meets the qualifications above, we invite you to apply and join us in our exciting journey!\nPlease Note:\n&bull; The fixed rate applies per milestone, with an average milestone duration ranging between 1 to 2 weeks.\n&bull; The project duration will be less than one month.\n&bull; Seeking agencies with the aforementioned expertise; individuals need not apply.\n&bull; We encourage agencies from Asia to apply and be part of this opportunity.<b>Skills</b>:        Market Research,                     Data Entry,                     Company Research,                     Market Analysis,                     Research Methods,                     Microsoft Excel,                     Data Analysis,                     Data Mining            ","link":"https://www.upwork.com/jobs/Seeking-Analytically-Proficient-Agencies-for-Research-Analyst-Positions_%7E0122817cf62e1e60b8?source=rss","processedDate":"2024-03-18T20:19:18.246Z","postedDate":"<b>Posted On</b>: March 08, 2024 15:38 UTC","id":"0122817cf62e1e60b8"},{"skillset":["Mathematics","Probability Theory","Linear Algebra","Statistics"],"title":"Statistical/probabilistic estimation project - Upwork","description":"I have a project that involves doing probabilistic and statistical estimations. I would like someone who would be able to consult on the project for an hour or so. \nNeed to have knowledge of Binomial probabilities, Bayesian probabilities, combinations, permutations, expected count &#039;till first success, permutation and combination problem solving.<b>Skills</b>:        Mathematics,                     Probability Theory,                     Linear Algebra,                     Statistics            ","link":"https://www.upwork.com/jobs/Statistical-probabilistic-estimation-project_%7E0170c58e4921d0d6fd?source=rss","processedDate":"2024-03-18T20:19:18.247Z","postedDate":"<b>Posted On</b>: March 08, 2024 17:28 UTC","id":"0170c58e4921d0d6fd"},{"skillset":["Qualitative Research","Data Analysis","Market Analysis","Market Research","Report","Data Entry","Data Mining"],"title":"Research Analyst : Agencies with Exceptional Analytical Skills are invited to join our Team  - Upwork","description":"Join Our Team as a Research Analyst Agency\nWe are on the lookout for a highly motivated and detail-oriented Research Analyst agency. The selected agency will play a crucial role in gathering, analyzing, and interpreting data to offer actionable insights and recommendations that support decision-making processes within our organization.\nThe ideal candidate will possess:\n&bull;\tStrong analytical skills\n&bull;\tA keen eye for detail\n&bull;\tThe ability to work effectively both independently and as part of a team\nKey Responsibilities:\n&bull;\tConduct research on various topics, including market trends, industry developments, competitor analysis, and customer behavior.\n&bull;\tCollect and analyze data from multiple sources, such as databases, surveys, interviews, and secondary research materials.\n&bull;\tInterpret data to identify patterns, trends, and correlations that inform strategic decision-making.\n&bull;\tPrepare reports, presentations, and other materials to effectively communicate research findings and recommendations to key stakeholders.\n&bull;\tCollaborate with cross-functional teams to support business initiatives and address specific research objectives.\n&bull;\tAssist in the development and implementation of research methodologies and tools to enhance efficiency and effectiveness.\n&bull;\tMaintain data integrity and accuracy throughout the research process to ensure the reliability of findings.\nQualifications:\n&bull;\tBachelor&#039;s degree in a related field such as Economics, Statistics, Business, or Finance; Master&#039;s degree preferred.\n&bull;\t2+ years of experience in a research or analytical role, preferably in a corporate or consulting environment.\n&bull;\tProficiency in data analysis tools and software, such as Excel, SPSS, SAS, R, or Python.\n&bull;\tStrong analytical skills with the ability to collect, organize, analyze, and present significant amounts of information with attention to detail and accuracy.\n&bull;\tExcellent written and verbal communication skills, capable of effectively communicating complex concepts and findings to diverse audiences.\n&bull;\tProven ability to work independently and manage multiple projects simultaneously, meeting tight deadlines.\n&bull;\tStrong problem-solving skills and a proactive approach to identifying and addressing research challenges.\n&bull;\tFamiliarity with research methodologies, quantitative and qualitative data analysis techniques, and statistical concepts.\nPlease Note:\n1.\tPayment is based on fixed rates per milestone, with each milestone typically lasting 1 to 2 weeks.\n2.\tThe project duration will be less than one month.\n3.\tWe are specifically seeking agencies with expertise as described; individual applications will not be considered.\n4.\tWe encourage agencies from Asia to apply and be part of our dynamic team.\nIf you believe your agency is the best fit for this role and meets the qualifications above, we invite you to apply and join us in our exciting journey!\nPlease Note:\n&bull; The fixed rate applies per milestone, with an average milestone duration ranging between 1 to 2 weeks.\n&bull; The project duration will be less than one month.\n&bull; Seeking agencies with the aforementioned expertise; individuals need not apply.\n&bull; We encourage agencies from Asia to apply and be part of this opportunity.<b>Skills</b>:        Qualitative Research,                     Data Analysis,                     Market Analysis,                     Market Research,                     Report,                     Data Entry,                     Data Mining            ","link":"https://www.upwork.com/jobs/Research-Analyst-Agencies-with-Exceptional-Analytical-Skills-are-invited-join-our-Team_%7E01191c35cb4d35e206?source=rss","processedDate":"2024-03-18T20:19:18.247Z","postedDate":"<b>Posted On</b>: March 08, 2024 15:35 UTC","id":"01191c35cb4d35e206"},{"skillset":["Data Analysis","R","Python","Data Science","Linux","Fortran","Solidity","Blockchain","Ethereum","PHP","C++","JavaScript","Cryptocurrency"],"title":"PR based devs - Upwork","description":"Looking for experienced software / blockchain developers for Bitoro Network, perpetual futures DEX aggregator. Part- and full-time opportunities available. <b>Skills</b>:        Data Analysis,                     R,                     Python,                     Data Science,                     Linux,                     Fortran,                     Solidity,                     Blockchain,                     Ethereum,                     PHP,                     C++,                     JavaScript,                     Cryptocurrency            ","link":"https://www.upwork.com/jobs/based-devs_%7E01afaf706d17604c28?source=rss","processedDate":"2024-03-18T20:19:18.247Z","postedDate":"<b>Posted On</b>: March 07, 2024 19:23 UTC","id":"01afaf706d17604c28"},{"skillset":["Market Research","Data Entry","Company Research","Market Analysis","Research Methods","Microsoft Excel","Data Analysis","Data Mining"],"title":"Inviting Agencies with Analytical Prowess: Join Our Team as Research Analysts - Upwork","description":"Join Our Team as a Research Analyst Agency\nWe are on the lookout for a highly motivated and detail-oriented Research Analyst agency. The selected agency will play a crucial role in gathering, analyzing, and interpreting data to offer actionable insights and recommendations that support decision-making processes within our organization.\nThe ideal candidate will possess:\n&bull; Strong analytical skills\n&bull; A keen eye for detail\n&bull; The ability to work effectively both independently and as part of a team\nKey Responsibilities:\n&bull; Conduct research on various topics, including market trends, industry developments, competitor analysis, and customer behavior.\n&bull; Collect and analyze data from multiple sources, such as databases, surveys, interviews, and secondary research materials.\n&bull; Interpret data to identify patterns, trends, and correlations that inform strategic decision-making.\n&bull; Prepare reports, presentations, and other materials to effectively communicate research findings and recommendations to key stakeholders.\n&bull; Collaborate with cross-functional teams to support business initiatives and address specific research objectives.\n&bull; Assist in the development and implementation of research methodologies and tools to enhance efficiency and effectiveness.\n&bull; Maintain data integrity and accuracy throughout the research process to ensure the reliability of findings.\nQualifications:\n&bull; Bachelor&#039;s degree in a related field such as Economics, Statistics, Business, or Finance; Master&#039;s degree preferred.\n&bull; 2+ years of experience in a research or analytical role, preferably in a corporate or consulting environment.\n&bull; Proficiency in data analysis tools and software, such as Excel, SPSS, SAS, R, or Python.\n&bull; Strong analytical skills with the ability to collect, organize, analyze, and present significant amounts of information with attention to detail and accuracy.\n&bull; Excellent written and verbal communication skills, capable of effectively communicating complex concepts and findings to diverse audiences.\n&bull; Proven ability to work independently and manage multiple projects simultaneously, meeting tight deadlines.\n&bull; Strong problem-solving skills and a proactive approach to identifying and addressing research challenges.\n&bull; Familiarity with research methodologies, quantitative and qualitative data analysis techniques, and statistical concepts.\nPlease Note:\n1. Payment is based on fixed rates per milestone, with each milestone typically lasting 1 to 2 weeks.\n2. The project duration will be less than one month.\n3. We are specifically seeking agencies with expertise as described; individual applications will not be considered.\n4. We encourage agencies from Asia to apply and be part of our dynamic team.\nIf you believe your agency is the best fit for this role and meets the qualifications above, we invite you to apply and join us in our exciting journey!\nPlease Note:\n&bull; The fixed rate applies per milestone, with an average milestone duration ranging between 1 to 2 weeks.\n&bull; The project duration will be less than one month.\n&bull; Seeking agencies with the aforementioned expertise; individuals need not apply.\n&bull; We encourage agencies from Asia to apply and be part of this opportunity.<b>Skills</b>:        Market Research,                     Data Entry,                     Company Research,                     Market Analysis,                     Research Methods,                     Microsoft Excel,                     Data Analysis,                     Data Mining            ","link":"https://www.upwork.com/jobs/Inviting-Agencies-with-Analytical-Prowess-Join-Our-Team-Research-Analysts_%7E014f68e351af4c2f66?source=rss","processedDate":"2024-03-18T20:19:18.247Z","postedDate":"<b>Posted On</b>: March 07, 2024 17:03 UTC","id":"014f68e351af4c2f66"},{"skillset":["Quality Control","R","Python","Bash","Bioinformatics","Genomic Data Analysis","Quantitative Genetics"],"title":"Tutoring and consultation with genomic analysis/bioinformatics problems - Upwork","description":"I need help with a project I am working on which involves PRS calculation and ML analysis of big data. Please contact me only if you have good knowledge of genomic analysis including PRS calculation.<b>Skills</b>:        Quality Control,                     R,                     Python,                     Bash,                     Bioinformatics,                     Genomic Data Analysis,                     Quantitative Genetics            ","link":"https://www.upwork.com/jobs/Tutoring-and-consultation-with-genomic-analysis-bioinformatics-problems_%7E01da7c687c30c9182e?source=rss","processedDate":"2024-03-18T20:19:18.247Z","postedDate":"<b>Posted On</b>: March 07, 2024 18:20 UTC","id":"01da7c687c30c9182e"},{"skillset":["Qualitative Research","Data Analysis","Market Analysis","Market Research","Report","Data Entry","Data Mining"],"title":"Calling Agencies with Analytical Prowess: Join Our Team as Research Analysts - Upwork","description":"Join Our Team as a Research Analyst Agency\nWe are on the lookout for a highly motivated and detail-oriented Research Analyst agency. The selected agency will play a crucial role in gathering, analyzing, and interpreting data to offer actionable insights and recommendations that support decision-making processes within our organization.\nThe ideal candidate will possess:\n&bull;\tStrong analytical skills\n&bull;\tA keen eye for detail\n&bull;\tThe ability to work effectively both independently and as part of a team\nKey Responsibilities:\n&bull;\tConduct research on various topics, including market trends, industry developments, competitor analysis, and customer behavior.\n&bull;\tCollect and analyze data from multiple sources, such as databases, surveys, interviews, and secondary research materials.\n&bull;\tInterpret data to identify patterns, trends, and correlations that inform strategic decision-making.\n&bull;\tPrepare reports, presentations, and other materials to effectively communicate research findings and recommendations to key stakeholders.\n&bull;\tCollaborate with cross-functional teams to support business initiatives and address specific research objectives.\n&bull;\tAssist in the development and implementation of research methodologies and tools to enhance efficiency and effectiveness.\n&bull;\tMaintain data integrity and accuracy throughout the research process to ensure the reliability of findings.\nQualifications:\n&bull;\tBachelor&#039;s degree in a related field such as Economics, Statistics, Business, or Finance; Master&#039;s degree preferred.\n&bull;\t2+ years of experience in a research or analytical role, preferably in a corporate or consulting environment.\n&bull;\tProficiency in data analysis tools and software, such as Excel, SPSS, SAS, R, or Python.\n&bull;\tStrong analytical skills with the ability to collect, organize, analyze, and present significant amounts of information with attention to detail and accuracy.\n&bull;\tExcellent written and verbal communication skills, capable of effectively communicating complex concepts and findings to diverse audiences.\n&bull;\tProven ability to work independently and manage multiple projects simultaneously, meeting tight deadlines.\n&bull;\tStrong problem-solving skills and a proactive approach to identifying and addressing research challenges.\n&bull;\tFamiliarity with research methodologies, quantitative and qualitative data analysis techniques, and statistical concepts.\nPlease Note:\n1.\tPayment is based on fixed rates per milestone, with each milestone typically lasting 1 to 2 weeks.\n2.\tThe project duration will be less than one month.\n3.\tWe are specifically seeking agencies with expertise as described; individual applications will not be considered.\n4.\tWe encourage agencies from Asia to apply and be part of our dynamic team.\nIf you believe your agency is the best fit for this role and meets the qualifications above, we invite you to apply and join us in our exciting journey!\nPlease Note:\n&bull; The fixed rate applies per milestone, with an average milestone duration ranging between 1 to 2 weeks.\n&bull; The project duration will be less than one month.\n&bull; Seeking agencies with the aforementioned expertise; individuals need not apply.\n&bull; We encourage agencies from Asia to apply and be part of this opportunity.<b>Skills</b>:        Qualitative Research,                     Data Analysis,                     Market Analysis,                     Market Research,                     Report,                     Data Entry,                     Data Mining            ","link":"https://www.upwork.com/jobs/Calling-Agencies-with-Analytical-Prowess-Join-Our-Team-Research-Analysts_%7E017290c59eecef3a88?source=rss","processedDate":"2024-03-18T20:19:18.247Z","postedDate":"<b>Posted On</b>: March 07, 2024 14:23 UTC","id":"017290c59eecef3a88"},{"skillset":["SQL","Automated Testing","Software QA","R"],"title":"Quality Analyst Manual Tester in health care domain - Upwork","description":"We are looking for an innovative and experienced quality analyst to join our team. We are seeking experienced individuals from health sector as QA manual tester.\nA quality analyst typically reviews and analyzes processes, procedures, and data in order to find opportunities for improvement and design quality-optimization strategies. Designing and executing quality control systems, conducting audits and inspections, analyzing data and performance indicators, and cooperating with other teams to improve quality outcomes are some of the key responsibilities that a quality analyst should follow.\nThey may also be in charge of educating and coaching team members on quality standards and best practices. To be an effective quality analyst, you must have excellent attention to detail as well as analytical and problem-solving skills. The ideal applicant will be able to interpret and implement quality assurance requirements, as well as provide accurate and thorough feedback to colleagues.\n&zwj;\nQuality Analyst Responsibilities\nCreating a test plan to ensure all objectives are accomplish\nUsing the plan to assess functionality, performance, reliability, stability and compatibility with other systems\nUsing the plan to hunt down and fix software bugs\nLooking for ways to prevent bugs from occurring in the first place\nGuarding against incorrect language usage, truncated text and incorrect formatting\nEnsuring the product is culturally compatible with the target market\nSome localisation analysts are responsible for translation work\n&zwj;\nLook into client concerns and product problems\nRebuilding the corrected software application\n&zwj;\nMust compile all the necessary data and choose the root-cause analysis technique to find the flaw\n&zwj;\nDraft quality assurance policies and procedures\n&zwj;\nDuring the testing process, make sure that user expectations are satisfied\nQuality Analyst Requirements\nBachelor&rsquo;s degree in computer science, management information, or any other related field\n&zwj;\nThorough knowledge of JavaScript, HTML, Python, Scrum, project management, Java, and SQL\n2-4 years of proven experience in the software testing domain\n&zwj;\nMust ensure proper quality audits, testing, and inspection\n3 years of quality analyst technical experience\nComprehensive knowledge of tools, concepts, and associated methodologies of QA\nProven skills in QA applications, databases, and Microsoft office\n&zwj;\nExcellent written and oral communication skills\nCertification like Quality Engineer, Quality Auditor, Six Sigma, and Quality Improvement associate<b>Skills</b>:        SQL,                     Automated Testing,                     Software QA,                     R            ","link":"https://www.upwork.com/jobs/Quality-Analyst-Manual-Tester-health-care-domain_%7E01543172eef97de779?source=rss","processedDate":"2024-03-18T20:19:18.247Z","postedDate":"<b>Posted On</b>: March 07, 2024 07:31 UTC","id":"01543172eef97de779"},{"skillset":["Google Analytics","AI Agent Development","Artificial Intelligence","API","Python","JavaScript","Data Analytics"],"title":"AI Solutions Developer for Real Estate Developers - Upwork","description":"Position Overview:\nWe are seeking a highly skilled and innovative AI Solutions Developer to join our team at Real Estate AI Consulting (REAIC). In this role, you will be responsible for developing cutting-edge artificial intelligence (AI) solutions tailored to the specific needs of our clients in the real estate development industry. You will work closely with our team of experts to design, implement, and maintain AI models and algorithms that drive efficiency, optimize decision-making, and create a competitive advantage for our clients.\nPrimary Responsibilities:\nAI Model Development:\n&#039;Design and develop AI models and algorithms for various applications in real estate development, including site selection, market analysis, project feasibility studies, risk management, and regulatory compliance.\nLeverage machine learning techniques, such as supervised and unsupervised learning, deep learning, and natural language processing, to build robust and accurate AI solutions.\nContinuously refine and optimize AI models based on new data, feedback, and changing requirements.\nData Analysis and Preprocessing:\nCollect, clean, and preprocess large datasets from diverse sources, including demographic data, market trends, and real-time data feeds.\nPerform exploratory data analysis to identify patterns, trends, and insights that can inform AI model development.\nImplement data validation, transformation, and normalization techniques to ensure data quality and integrity.\nSolution Integration and Deployment:\nCollaborate with software engineers and developers to integrate AI solutions into existing systems, platforms, and applications used by our clients.\nEnsure seamless integration of AI models with other software components, data sources, and user interfaces.\nDevelop and maintain APIs, libraries, and SDKs to enable easy integration and deployment of AI solutions.\nTesting and Validation:\nDesign and implement comprehensive testing strategies to validate the accuracy, performance, and scalability of AI solutions.\nConduct rigorous testing, including unit testing, integration testing, and system testing, to ensure the reliability and robustness of AI models.\nAnalyze and interpret test results, identify issues, and implement necessary improvements or adjustments.\nDocumentation and Knowledge Transfer:\nDocument AI models, algorithms, code, and technical specifications to ensure maintainability and knowledge transfer within the team.\nCollaborate with technical writers to create user guides, tutorials, and training materials for clients and internal stakeholders.\nProvide training and support to clients on the effective use and interpretation of AI solutions.\nQualifications and Requirements:\nProven experience in developing AI solutions, with a strong understanding of machine learning algorithms, deep learning techniques, and natural language processing.\nProficiency in programming languages such as Python, R, or Java, and familiarity with AI frameworks and libraries (e.g., TensorFlow, PyTorch, Scikit-learn).\nExcellent data analysis and data visualization skills, with experience in tools like Pandas, NumPy, Matplotlib, or Tableau.\nStrong problem-solving and analytical skills, with the ability to translate complex business requirements into AI solutions.\nExperience with cloud computing platforms (e.g., AWS, GCP, Azure) and containerization technologies (e.g., Docker, Kubernetes) is a plus.\nExcellent communication and collaboration skills, with the ability to explain complex technical concepts to non-technical stakeholders.\nFamiliarity with real estate industry practices, regulations, and trends is desirable.<b>Skills</b>:        Google Analytics,                     AI Agent Development,                     Artificial Intelligence,                     API,                     Python,                     JavaScript,                     Data Analytics            ","link":"https://www.upwork.com/jobs/Solutions-Developer-for-Real-Estate-Developers_%7E015a7086a73bea6d5c?source=rss","processedDate":"2024-03-18T20:19:18.247Z","postedDate":"<b>Posted On</b>: March 06, 2024 22:24 UTC","id":"015a7086a73bea6d5c"},{"skillset":["Database Testing","Bug Tracking &amp; Reports","Quality Control","Jira","Python","Data Analysis","Microsoft Excel"],"title":"Data Quality Engineer - Upwork","description":"As a Data Quality Engineer, you will play a critical role in ensuring the accuracy, consistency, and reliability of our organization&rsquo;s data. You&rsquo;ll collaborate with cross-functional teams, including data scientists, analysts, and software engineers, to develop and implement data quality processes, standards, and best practices. Your work will directly impact decision-making, product development, and customer experiences.\nResponsibilities:\n&bull;\tData Profiling and Assessment:\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;o\tAnalyze data sources to identify anomalies, inconsistencies, and data quality issues.\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;o\tDevelop and maintain data quality metrics and scorecards.\n&bull;\tData Validation and Cleansing:\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;o\tDesign and execute data validation scripts and automated tests.\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;o\tCleanse and transform data using tools and techniques such as SQL, Python, R, or ETL processes.\n&bull;\tQuality Assurance and Monitoring:\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;o\tEstablish data quality rules and thresholds.\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;o\tMonitor data pipelines and proactively address issues.\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;o\tInvestigate and resolve data discrepancies.\n&bull;\tCollaboration and Communication:\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;o\tWork closely with data engineers, data scientists, and business stakeholders to define data quality requirements.\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;o\tCommunicate findings and recommendations to technical and non-technical audiences.\n&bull;\tProcess Improvement:\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;o\tContinuously enhance data quality processes and workflows.\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;o\tPropose and implement improvements to prevent data quality issues.\nQualifications:\n&bull;\tBachelor&rsquo;s degree in Computer Science, Information Systems, or a related field.\n&bull;\tProven experience in data quality assessment, validation, and cleansing.\n&bull;\tProficiency in SQL, Python, R, or other relevant programming languages.\n&bull;\tFamiliarity with data governance principles and best practices.\n&bull;\tStrong analytical skills and attention to detail.\n&bull;\tExcellent communication and collaboration abilities.\nBonus Skills:\n&bull;\tExperience with data profiling tools (e.g., Talend, Informatica, Trifacta).\n&bull;\tKnowledge of big data technologies (Databricks, Snowflake, Hadoop, Spark, etc.).\n&bull;\tCertification in data management or quality (e.g., DAMA CDMP, IQCP).<b>Skills</b>:        Database Testing,                     Bug Tracking &amp; Reports,                     Quality Control,                     Jira,                     Python,                     Data Analysis,                     Microsoft Excel            ","link":"https://www.upwork.com/jobs/Data-Quality-Engineer_%7E019178d055e4ab582e?source=rss","processedDate":"2024-03-18T20:19:18.247Z","postedDate":"<b>Posted On</b>: March 06, 2024 22:06 UTC","id":"019178d055e4ab582e"},{"skillset":["Python","Django"],"title":"Looking for Python Django - Upwork","description":"In a table structure.\n1. When clicking on &amp;quot;Create new passage&amp;quot;, a new empty row should be created instead of going to another page another page.\n2. Passages should be able to be moved up/down by clicking or drag/drop. This should update the table position (in the db) also.\nClarification for 1 and 2. https://monosnap.com/file/Z6sQ3dCjZaOrh2qZ9zTgcxUD7zl05r\nThese tutorials will help:\nhttps://www.youtube.com/watch?v=V-f_yYKUJo8\nhttps://copyprogramming.com/howto/sorting-items-by-drag-and-drop-in-django<b>Skills</b>:        Python,                     Django            ","link":"https://www.upwork.com/jobs/Looking-for-Python-Django_%7E01145c9f476d5d5ab4?source=rss","processedDate":"2024-03-18T20:19:18.247Z","postedDate":"<b>Posted On</b>: March 06, 2024 17:19 UTC","id":"01145c9f476d5d5ab4"},{"skillset":["Make.com","API","Automation","Microsoft Excel","Google Sheets","Data Visualization","API Development","Zapier","Analytics","Data Mining","R"],"title":"Automate Reporting using R Programming  - Upwork","description":"Hi, \nWe are looking to automate our KPI reporting from various inputs including\nAcuity scheduling\nActivecampaign \nThrivecart\nFacebook\nJustcall\nGA\nThe deliverable is an accurate and robust (not buggy) real time reporting dashboard that shows us real time metrics for our business.\nThis job requires API set up to pull data from these platforms and put it into a live dashboard.\nCommunication is key for this project so we are only looking for someone we can easily speak with in english to complete this work.\nIf you are interested and think you have the skills as a first step please let me know by saying &amp;quot;send me your current reports&amp;quot; this way I&#039;ll know you have attention to detail.\nThanks\nLaureen<b>Skills</b>:        Make.com,                     API,                     Automation,                     Microsoft Excel,                     Google Sheets,                     Data Visualization,                     API Development,                     Zapier,                     Analytics,                     Data Mining,                     R            ","link":"https://www.upwork.com/jobs/Automate-Reporting-using-Programming_%7E01085e7f79febc8770?source=rss","processedDate":"2024-03-18T20:19:18.247Z","postedDate":"<b>Posted On</b>: March 06, 2024 15:53 UTC","id":"01085e7f79febc8770"},{"skillset":["Qualitative Research","Data Analysis","Market Analysis","Market Research","Report","Data Entry","Data Mining"],"title":"Looking for Agencies with Research Analysts - Upwork","description":"Join Our Team as a Research Analyst Agency\nWe are on the lookout for a highly motivated and detail-oriented Research Analyst agency. The selected agency will play a crucial role in gathering, analyzing, and interpreting data to offer actionable insights and recommendations that support decision-making processes within our organization.\nThe ideal candidate will possess:\n&bull;\tStrong analytical skills\n&bull;\tA keen eye for detail\n&bull;\tThe ability to work effectively both independently and as part of a team\nKey Responsibilities:\n&bull;\tConduct research on various topics, including market trends, industry developments, competitor analysis, and customer behavior.\n&bull;\tCollect and analyze data from multiple sources, such as databases, surveys, interviews, and secondary research materials.\n&bull;\tInterpret data to identify patterns, trends, and correlations that inform strategic decision-making.\n&bull;\tPrepare reports, presentations, and other materials to effectively communicate research findings and recommendations to key stakeholders.\n&bull;\tCollaborate with cross-functional teams to support business initiatives and address specific research objectives.\n&bull;\tAssist in the development and implementation of research methodologies and tools to enhance efficiency and effectiveness.\n&bull;\tMaintain data integrity and accuracy throughout the research process to ensure the reliability of findings.\nQualifications:\n&bull;\tBachelor&#039;s degree in a related field such as Economics, Statistics, Business, or Finance; Master&#039;s degree preferred.\n&bull;\t2+ years of experience in a research or analytical role, preferably in a corporate or consulting environment.\n&bull;\tProficiency in data analysis tools and software, such as Excel, SPSS, SAS, R, or Python.\n&bull;\tStrong analytical skills with the ability to collect, organize, analyze, and present significant amounts of information with attention to detail and accuracy.\n&bull;\tExcellent written and verbal communication skills, capable of effectively communicating complex concepts and findings to diverse audiences.\n&bull;\tProven ability to work independently and manage multiple projects simultaneously, meeting tight deadlines.\n&bull;\tStrong problem-solving skills and a proactive approach to identifying and addressing research challenges.\n&bull;\tFamiliarity with research methodologies, quantitative and qualitative data analysis techniques, and statistical concepts.\nPlease Note:\n1.\tPayment is based on fixed rates per milestone, with each milestone typically lasting 1 to 2 weeks.\n2.\tThe project duration will be less than one month.\n3.\tWe are specifically seeking agencies with expertise as described; individual applications will not be considered.\n4.\tWe encourage agencies from Asia to apply and be part of our dynamic team.\nIf you believe your agency is the best fit for this role and meets the qualifications above, we invite you to apply and join us in our exciting journey!<b>Skills</b>:        Qualitative Research,                     Data Analysis,                     Market Analysis,                     Market Research,                     Report,                     Data Entry,                     Data Mining            ","link":"https://www.upwork.com/jobs/Looking-for-Agencies-with-Research-Analysts_%7E0173050f638fc7bab3?source=rss","processedDate":"2024-03-18T20:19:18.247Z","postedDate":"<b>Posted On</b>: March 06, 2024 12:25 UTC","id":"0173050f638fc7bab3"},{"skillset":["Market Research","Data Entry","Company Research","Market Analysis","Research Methods","Microsoft Excel","Data Analysis","Data Mining"],"title":"Hiring Agencies with Research Analyst  - Upwork","description":"Looking for a Dynamic Research Analyst Agency\nWe are in search of a highly motivated and detail-oriented Research Analyst agency. The Research Analyst will play a crucial role in gathering, analyzing, and interpreting data to offer actionable insights and recommendations that support organizational decision-making.\nThe ideal candidate will possess robust analytical skills, a sharp attention to detail, and the ability to work effectively both independently and as part of a team.\nResponsibilities:\n&bull;\tConduct research on a variety of topics, including market trends, industry developments, competitor analysis, and customer behavior.\n&bull;\tGather and analyze data from diverse sources, such as databases, surveys, interviews, and secondary research materials.\n&bull;\tInterpret data to uncover patterns, trends, and correlations that can inform strategic decision-making.\n&bull;\tCreate reports, presentations, and other materials to effectively communicate research findings and recommendations to key stakeholders.\n&bull;\tCollaborate with cross-functional teams to assist in business initiatives and address specific research objectives.\n&bull;\tStay up-to-date with industry best practices, emerging trends, and new technologies related to research and data analysis.\n&bull;\tAid in the development and implementation of research methodologies and tools to enhance efficiency and effectiveness.\n&bull;\tEnsure data integrity and accuracy throughout the research process, ensuring the reliability of findings.\nQualifications:\n&bull;\tBachelor&#039;s degree in a related field such as Economics, Statistics, Business, or Finance; Master&#039;s degree preferred.\n&bull;\t2+ years of experience in a research or analytical role, preferably in a corporate or consulting environment.\n&bull;\tProficiency in data analysis tools and software, such as Excel, SPSS, SAS, R, or Python.\n&bull;\tStrong analytical skills with the ability to collect, organize, analyze, and present significant amounts of information with attention to detail and accuracy.\n&bull;\tExcellent written and verbal communication skills, capable of effectively communicating complex concepts and findings to diverse audiences.\n&bull;\tProven ability to work independently and manage multiple projects simultaneously, meeting tight deadlines.\n&bull;\tStrong problem-solving skills and a proactive approach to identifying and addressing research challenges.\n&bull;\tFamiliarity with research methodologies, quantitative and qualitative data analysis techniques, and statistical concepts.\nPlease Note:\n1.\tPayment is based on fixed rates per milestone, with each milestone typically lasting 1 to 2 weeks.\n2.\tThe project duration will be less than one month.\n3.\tWe are specifically seeking agencies with expertise as described; individual applications will not be considered.\n4.\tWe encourage agencies from Asia to apply and become part of our dynamic team.\n5.\tIf you believe you are the perfect fit for this role and meet the qualifications above, we invite you to apply and be a part of our exciting journey!<b>Skills</b>:        Market Research,                     Data Entry,                     Company Research,                     Market Analysis,                     Research Methods,                     Microsoft Excel,                     Data Analysis,                     Data Mining            ","link":"https://www.upwork.com/jobs/Hiring-Agencies-with-Research-Analyst_%7E013af3ccd70b2ad510?source=rss","processedDate":"2024-03-18T20:19:18.247Z","postedDate":"<b>Posted On</b>: March 06, 2024 11:56 UTC","id":"013af3ccd70b2ad510"},{"skillset":["Supply Chain Management","Machine Learning","Data Mining","Python","Artificial Intelligence"],"title":"Supply Chain AI Integration Consultant - Upwork","description":"Job Title: Senior Supply Chain AI Integration Specialist (Consultant)\nCompany Overview:\nDataToBiz is a trusted consulting firm specializing in providing innovative solutions to businesses across various industries. We partner with clients to optimize their operations, drive growth, and harness the power of technology to achieve their strategic objectives.\nPosition Overview:\nWe are currently seeking a seasoned professional to join our team as a Senior Supply Chain AI Integration Specialist (Consultant). In this role, you will be assigned to work closely with one of our clients to lead the integration of artificial intelligence (AI) technologies into their supply chain processes, leveraging your expertise in both supply chain management and AI adoption.\nResponsibilities:\nCollaborate with the client&#039;s cross-functional teams to understand their business objectives, supply chain challenges, and data requirements for AI integration.\nConduct a thorough analysis of the client&#039;s existing data sources, workflows, and processes to identify opportunities for AI-driven optimization and improvement.\nDevelop a comprehensive roadmap for AI adoption within the client&#039;s supply chain domain, outlining key milestones, timelines, and success metrics.\nLead the design, development, and implementation of AI algorithms and models to address specific supply chain challenges, such as demand forecasting, inventory optimization, and logistics planning.\nWork closely with the client&#039;s internal teams and external vendors to integrate AI solutions into their existing systems and processes, ensuring scalability, reliability, and performance.\nProvide hands-on technical expertise and guidance to the client&#039;s project team, including data scientists, software engineers, and business analysts, to facilitate successful AI adoption and implementation.\nConduct regular progress reviews and stakeholder meetings to ensure alignment with project objectives, identify any potential risks or issues, and proactively address them.\nStay current on industry trends, emerging technologies, and best practices in AI and supply chain management, sharing insights and recommendations with the client as needed.\nQualifications:\nBachelor&#039;s degree in Computer Science, Engineering, Supply Chain Management, or a related field; advanced degree preferred.\nMinimum of 8 years of experience in supply chain management, with a focus on logistics, procurement, or operations.\nProven track record of successfully leading AI adoption initiatives within complex organizations, preferably in a consulting or advisory role.\nDeep understanding of machine learning algorithms, statistical analysis, and data mining techniques, with hands-on experience in developing and deploying AI models.\nProficiency in programming languages such as Python, R, or Java, as well as experience with AI frameworks and libraries (e.g., TensorFlow, PyTorch, scikit-learn).\nStrong analytical and problem-solving skills, with the ability to translate business requirements into actionable AI solutions.\nExcellent communication and collaboration skills, with the ability to effectively convey technical concepts to non-technical stakeholders.\nProven leadership abilities, including experience mentoring junior team members and driving cross-functional initiatives to successful outcomes.\nA passion for innovation and a commitment to staying at the forefront of AI and supply chain technology trends.\nThis is a unique opportunity to make a significant impact on the client&#039;s supply chain operations by leveraging cutting-edge AI technology. If you&#039;re ready to take on a new challenge and drive meaningful change, we encourage you to apply now to join our consulting team!<b>Skills</b>:        Supply Chain Management,                     Machine Learning,                     Data Mining,                     Python,                     Artificial Intelligence            ","link":"https://www.upwork.com/jobs/Supply-Chain-Integration-Consultant_%7E0130cd982174b65ec3?source=rss","processedDate":"2024-03-18T20:19:18.247Z","postedDate":"<b>Posted On</b>: March 06, 2024 07:36 UTC","id":"0130cd982174b65ec3"},{"skillset":["Academic Writing","Statistics","Research Methods","Research Papers","Topic Research","R","IBM SPSS","Data Analysis","Academic Research"],"title":"(Urgent) - Putting up the Bat Signal - Statics Tutor to Help with Statistics Assignment - Upwork","description":"Hi! (Urgent Posting)\nI&#039;m working on a statistics assignment for university and need a tutor&#039;s assistance with this project. It&#039;s a project that requires experience with the software SPSS, and I need urgent help today &amp;amp; tommorow.\nAm willing to pay a bonus for help and assistance if they can help today &amp;amp; tommorow!\nLook forward to hearing from you!<b>Skills</b>:        Academic Writing,                     Statistics,                     Research Methods,                     Research Papers,                     Topic Research,                     R,                     IBM SPSS,                     Data Analysis,                     Academic Research            ","link":"https://www.upwork.com/jobs/Urgent-Putting-the-Bat-Signal-Statics-Tutor-Help-with-Statistics-Assignment_%7E012bcb5c8f1aad287f?source=rss","processedDate":"2024-03-18T20:19:18.247Z","postedDate":"<b>Posted On</b>: March 05, 2024 23:33 UTC","id":"012bcb5c8f1aad287f"},{"skillset":["Algebra","Mathematics","Calculus","Probability Theory","R","Statistics","IBM SPSS","Mathematics Tutoring","Python","Statistical Analysis","Data Analysis","Academic Writing","Microsoft Excel","Microsoft Power BI","Microsoft Power BI Data Visualization"],"title":"Tutor for Statistics (MTech) - Upwork","description":"Tutor for statistics (MTech in Artificial Intelligence and Machine Learning)<b>Skills</b>:        Algebra,                     Mathematics,                     Calculus,                     Probability Theory,                     R,                     Statistics,                     IBM SPSS,                     Mathematics Tutoring,                     Python,                     Statistical Analysis,                     Data Analysis,                     Academic Writing,                     Microsoft Excel,                     Microsoft Power BI,                     Microsoft Power BI Data Visualization            ","link":"https://www.upwork.com/jobs/Tutor-for-Statistics-MTech_%7E01857699a5692e96f4?source=rss","processedDate":"2024-03-18T20:19:18.247Z","postedDate":"<b>Posted On</b>: March 04, 2024 17:55 UTC","id":"01857699a5692e96f4"},{"skillset":["Qualitative Research","Data Analysis","Market Analysis","Market Research","Report","Data Entry","Data Mining"],"title":"Looking for Agencies with Research Analysts - Upwork","description":"Seeking Research Analyst Agency: Drive Strategic Insights with Data\nWe are in search of a highly motivated and detail-oriented Research Analyst agency. The Research Analyst will play a critical role in gathering, analyzing, and interpreting data to provide actionable insights and recommendations for informed decision-making within our organization.\nKey Responsibilities:\n&bull;\tConduct Comprehensive Research:\n&bull;\tDive into various topics including market trends, industry developments, competitor analysis, and customer behavior.\n&bull;\tData Collection and Analysis:\n&bull;\tGather data from diverse sources like databases, surveys, interviews, and secondary research materials.\n&bull;\tAnalyze data to identify patterns, trends, and correlations that inform strategic decisions.\n&bull;\tReport Preparation:\n&bull;\tPrepare detailed reports, presentations, and materials to effectively communicate research findings and recommendations to stakeholders.\n&bull;\tCollaboration:\n&bull;\tWork closely with cross-functional teams to support business initiatives and achieve research objectives.\n&bull;\tMethodology Development:\n&bull;\tAssist in developing and implementing research methodologies and tools to enhance efficiency.\n&bull;\tData Integrity and Accuracy:\n&bull;\tMaintain data integrity and accuracy throughout the research process, ensuring reliability of findings.\nQualifications:\n&bull;\tBachelor&#039;s degree in Economics, Statistics, Business, or Finance; Master&#039;s degree preferred.\n&bull;\t2+ years of experience in a research or analytical role, ideally within a corporate or consulting environment.\n&bull;\tProficiency in data analysis tools such as Excel, SPSS, SAS, R, or Python.\n&bull;\tStrong analytical skills with a keen attention to detail and accuracy.\n&bull;\tExcellent written and verbal communication skills to convey complex findings clearly.\n&bull;\tAbility to work independently, manage multiple projects, and meet deadlines.\n&bull;\tStrong problem-solving skills and a proactive approach to research challenges.\n&bull;\tFamiliarity with research methodologies, quantitative and qualitative analysis techniques, and statistical concepts.\nPlease Note:\n&bull;\tThe fixed rate applies per milestone, with an average duration ranging between 1 to 2 weeks.\n&bull;\tThe project duration will be less than one month.\n&bull;\tSeeking Agencies with expertise in research analysis; individuals need not apply.\n&bull;\tWe welcome applications from Agencies based in Asia.\n&bull;\tIf you are confident in your ability to excel in this role and meet the qualifications listed, we encourage you to apply and become a valuable part of our dynamic team!<b>Skills</b>:        Qualitative Research,                     Data Analysis,                     Market Analysis,                     Market Research,                     Report,                     Data Entry,                     Data Mining            ","link":"https://www.upwork.com/jobs/Looking-for-Agencies-with-Research-Analysts_%7E019a93a89c99c662f2?source=rss","processedDate":"2024-03-18T20:19:18.247Z","postedDate":"<b>Posted On</b>: March 05, 2024 08:18 UTC","id":"019a93a89c99c662f2"},{"skillset":["Python","SQL","Data Analysis","Data Science","Machine Learning","SQL Programming","Science","Flask","Python Script","Natural Language Processing","LLM Prompt","API","Deep Learning","Artificial Intelligence","MongoDB"],"title":"Student project help - Upwork","description":"Need help in student ml projects submission. Source code with ipynb file needed<b>Skills</b>:        Python,                     SQL,                     Data Analysis,                     Data Science,                     Machine Learning,                     SQL Programming,                     Science,                     Flask,                     Python Script,                     Natural Language Processing,                     LLM Prompt,                     API,                     Deep Learning,                     Artificial Intelligence,                     MongoDB            ","link":"https://www.upwork.com/jobs/Student-project-help_%7E01e4df7e58773af2d7?source=rss","processedDate":"2024-03-18T20:19:18.247Z","postedDate":"<b>Posted On</b>: March 05, 2024 07:17 UTC","id":"01e4df7e58773af2d7"},{"skillset":["Software Architecture &amp; Design","Git","NGINX","Python","API","PostgreSQL","Machine Learning"],"title":"Experienced Python Developer required for real time support  - Upwork","description":"Objective\nThe goal of this document is to outline the tasks and requirements for a developer to maintain and enhance the existing Python script and associated Flask API. The tasks involve importing the repository to PyCharm, installing dependencies, commenting the script, and ensuring specific sections of the code run successfully. Ongoing support and collaboration practices are also highlighted.\nRealtime support needed for the following. \nRoadmap: \n1. Import Repo to PyCharm\nOpen PyCharm.\nNavigate to &amp;quot;Check out from Version Control.&amp;quot;\nSelect Git and provide the repository URL.\nClone the repository locally.\n2. Install Dependencies\nOpen the project directory in PyCharm&#039;s terminal.\nRun pip install -r requirements.txt.\nAddress any errors during the installation process, checking for missing system dependencies.\n3. Comment Script\nOpen the Python script in PyCharm.\nInsert comments using # to explain each section of the code.\nFocus on clarifying complex or non-intuitive parts of the script.\n4. Identify and Run Specific Parts\nDivide the script into sections based on functionality.\nRun each section individually to ensure they execute without errors.\nStart with main dependencies and functions.\n5. Ongoing Support\nMaintain thorough documentation within the code for clarity.\nUtilise effective version control, specifically GitHub, to track changes and facilitate collaboration.\nProvide timely updates on modifications and changes made to the script.<b>Skills</b>:        Software Architecture &amp; Design,                     Git,                     NGINX,                     Python,                     API,                     PostgreSQL,                     Machine Learning            ","link":"https://www.upwork.com/jobs/Experienced-Python-Developer-required-for-real-time-support_%7E01ab5ecd02ac7a58e8?source=rss","processedDate":"2024-03-18T20:19:18.247Z","postedDate":"<b>Posted On</b>: March 04, 2024 16:32 UTC","id":"01ab5ecd02ac7a58e8"},{"skillset":["JavaScript"],"title":"Google App Script Coders - Upwork","description":"Hi, Basically we currently need someone like you to replicate the existing work which have already been done. We have finished for few countries like Indonesian and US. So you can refer the codes from there. All you gotta do is just to replicate the code. Each country&#039;s code is the same, you just need to replicate the codes which are already done but modifying some things like extensive stock according to set trigger for every country and also, check symbols are different in scrapped sources.\nPlease read everything in this google sheet, especially, the work full process flow : https://docs.google.com/spreadsheets/d/1RCqnS9_SFGf-caDhJveNQlBwJCfk_JG6upsDfLlKRlI/edit#gid=277414202\nplease view the video, https://www.dropbox.com/scl/fi/j98rqpvhs2y9a3a94c5hs/Screen-Recording-2023-12-09-at-13.36.07.mov?rlkey=tt42ingkdiegdn8652ydm4vx7&amp;amp;dl=0\nMeanwhile you can get all the existing codes here hence to replicate it : https://www.dropbox.com/scl/fo/6mx4bibf4xflxujnrkj9t/h?rlkey=182bmuxh7ujym3pf4xxe63r5b&amp;amp;dl=0\nSo the first coder, already did his best to make the documentation here : https://docs.google.com/spreadsheets/d/16mN0Uh7WPG2cUO_QosqtUq58lEvelXcDQI9ZkXFKXJg/edit#gid=331043196 if that page still confusing for you, please let me know. Please ask me if you have any question and let me know the soonest if you&#039;d like to start.\nBecause we need you to start working as soon as possible so I can stop finding someone else. You will be paid $50/country&#039;s replication (and $10/hr for code&rsquo;s maintenance) and modifying few things as for each country have different data (bonus available for fast delivery and perfection), but I may fund some few milestones for any such other kinds of works.\nOnly when you got all the answer is correct then you can work on this. To re-ensure you understood everything, please answer :\na. What are the first thing you need to do to start working on this project ?\n b. What is the output result of the project so we can consider the work is done for the first country/milestone you worked on ?.\n c. How many Gsheets type will be required for each country ?\n d. Which Gsheet type might needs to have the most sheets and why do you think it has so many sheets?\n e. Please tell me the guys (including yourself) whom will be working for one country and what skills/type/job desc they would be doing ?\n f. How do you think the data will be transferred from one GSheets to another Gsheets ?<b>Skills</b>:        JavaScript            ","link":"https://www.upwork.com/jobs/Google-App-Script-Coders_%7E01990ab7a634e8ac79?source=rss","processedDate":"2024-03-18T20:19:18.247Z","postedDate":"<b>Posted On</b>: March 04, 2024 15:34 UTC","id":"01990ab7a634e8ac79"},{"skillset":["JavaScript"],"title":"JavaScript Decompiler Needed - Upwork","description":"We are seeking a skilled JavaScript decompiler who can assist us in decompiling a JS file. We will provide the necessary map file to aid in the process. The outcome should be a readable version of the code in plain English.\nYou have attached a zip with the files. \nTo award this job, please provide a screenshot of any part of the code as proof. \nUnacceptable results: \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;if (t[r]) return t[r].exports;\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;return e[r].call(o.exports, o, o.exports, n), o.l = !0, o.exports<b>Skills</b>:        JavaScript            ","link":"https://www.upwork.com/jobs/JavaScript-Decompiler-Needed_%7E01fa85cb8335c7a705?source=rss","processedDate":"2024-03-18T20:19:18.247Z","postedDate":"<b>Posted On</b>: March 04, 2024 11:12 UTC","id":"01fa85cb8335c7a705"},{"skillset":["Market Research","Data Entry","Company Research","Market Analysis","Research Methods","Microsoft Excel","Data Analysis","Data Mining"],"title":"Looking for Agencies with Research Analyst  - Upwork","description":"\nSeeking Research Analyst Agency\nWe are seeking a highly motivated and detail-oriented Research Analyst agency. The Research Analyst will be responsible for gathering, analyzing, and interpreting data to provide actionable insights and recommendations to support decision-making processes within the organization.\nThe ideal candidate will possess strong analytical skills, a keen eye for detail, and the ability to work effectively both independently and as part of a team.\nKey Responsibilities:\n&bull;\tConduct research on various topics, including market trends, industry developments, competitor analysis, and customer behavior.\n&bull;\tCollect and analyze data from multiple sources, such as databases, surveys, interviews, and secondary research materials.\n&bull;\tInterpret data to identify patterns, trends, and correlations that can inform strategic decision-making.\n&bull;\tPrepare reports, presentations, and other materials to communicate research findings and recommendations to key stakeholders.\n&bull;\tCollaborate with cross-functional teams to support business initiatives and address specific research objectives.\n&bull;\tStay current with industry best practices, emerging trends, and new technologies related to research and data analysis.\n&bull;\tAssist in the development and implementation of research methodologies and tools to enhance efficiency and effectiveness.\n&bull;\tMaintain data integrity and accuracy throughout the research process, ensuring the reliability of findings.\nQualifications:\n&bull;\tBachelor&#039;s degree in a related field such as Economics, Statistics, Business, or Finance; Master&#039;s degree preferred.\n&bull;\t2+ years of experience in a research or analytical role, preferably in a corporate or consulting environment.\n&bull;\tProficiency in data analysis tools and software, such as Excel, SPSS, SAS, R, or Python.\n&bull;\tStrong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy.\n&bull;\tExcellent written and verbal communication skills, with the ability to effectively communicate complex concepts and findings to diverse audiences.\n&bull;\tProven ability to work independently and manage multiple projects simultaneously, meeting tight deadlines.\n&bull;\tStrong problem-solving skills and a proactive approach to identifying and addressing research challenges.\n&bull;\tFamiliarity with research methodologies, quantitative and qualitative data analysis techniques, and statistical concepts.\nPlease Note:\n1.\tThe fixed rate applies per milestone, with an average milestone duration ranging between 1 to 2 weeks.\n2.\tThe project duration will be less than one month.\n3.\tSeeking Agencies with the aforementioned expertise; individuals need not apply.\n4.\tWe encourage Agencies from Asia to apply.\n5.\tIf you believe you are the best person for this role and meet the qualifications above, we encourage you to apply and join our dynamic team!<b>Skills</b>:        Market Research,                     Data Entry,                     Company Research,                     Market Analysis,                     Research Methods,                     Microsoft Excel,                     Data Analysis,                     Data Mining            ","link":"https://www.upwork.com/jobs/Looking-for-Agencies-with-Research-Analyst_%7E010c0c48e060ef0900?source=rss","processedDate":"2024-03-18T20:19:18.247Z","postedDate":"<b>Posted On</b>: March 04, 2024 10:55 UTC","id":"010c0c48e060ef0900"},{"skillset":["Qualitative Research","Data Analysis","Market Analysis","Market Research","Report","Data Entry","Data Mining"],"title":"Hiring Agencies with Research Analysts - Upwork","description":"We are seeking a highly motivated and detail-oriented Research Analyst agency. The Research Analyst will be responsible for gathering, analyzing, and interpreting data to provide actionable insights and recommendations to support decision-making processes within the organization.\nThe ideal candidate will possess strong analytical skills, a keen eye for detail, and the ability to work effectively both independently and as part of a team.\nKey Responsibilities:\n1. Conduct research on various topics, including market trends, industry developments, competitor analysis, and customer behavior.\n2. Collect and analyze data from multiple sources, such as databases, surveys, interviews, and secondary research materials.\n3. Interpret data to identify patterns, trends, and correlations that can inform strategic decision-making.\n4. Prepare reports, presentations, and other materials to communicate research findings and recommendations to key stakeholders.\n5. Collaborate with cross-functional teams to support business initiatives and address specific research objectives.\n6. Assist in the development and implementation of research methodologies and tools to enhance efficiency and effectiveness.\n7. Maintain data integrity and accuracy throughout the research process, ensuring the reliability of findings.\nQualifications:\n- Bachelor&#039;s degree in a related field such as Economics, Statistics, Business, or Finance; Master&#039;s degree preferred.\n- 2+ years of experience in a research or analytical role, preferably in a corporate or consulting environment.\n- Proficiency in data analysis tools and software, such as Excel, SPSS, SAS, R, or Python.\n- Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy.\n- Excellent written and verbal communication skills, with the ability to effectively communicate complex concepts and findings to diverse audiences.\n- Proven ability to work independently and manage multiple projects simultaneously, meeting tight deadlines.\n- Strong problem-solving skills and a proactive approach to identifying and addressing research challenges.\n- Familiarity with research methodologies, quantitative and qualitative data analysis techniques, and statistical concepts.\nPlease Note:\n1. The fixed rate applies per milestone, with an average milestone duration ranging between 1 to 2 weeks.\n2. The project duration will be less than one month.\n3. Seeking Agencies with the aforementioned expertise; individuals need not apply.\n4. We encourage Agencies from Asia to apply.\nIf you believe you are the best person for this role and meet the qualifications above, we encourage you to apply and join our dynamic team!<b>Skills</b>:        Qualitative Research,                     Data Analysis,                     Market Analysis,                     Market Research,                     Report,                     Data Entry,                     Data Mining            ","link":"https://www.upwork.com/jobs/Hiring-Agencies-with-Research-Analysts_%7E016c9039be6770e6ba?source=rss","processedDate":"2024-03-18T20:19:18.247Z","postedDate":"<b>Posted On</b>: March 04, 2024 08:08 UTC","id":"016c9039be6770e6ba"},{"skillset":["Probability Theory","Python","Mathematics","Mathematical Modeling"],"title":"Experienced Python Programmer Needed for Stochastic Processes and Random Walk Simulations - Upwork","description":"Responsibilities:\nImplement algorithms to solve stochastic processes problems, including transition matrix manipulation and probability calculations.\nSimulate discrete random walks in two-dimensional space, considering different probabilities for movements in different directions.\nPlot multiple realizations of random walks to visualize the simulation results.\nCalculate expected values and lengths based on the simulation outcomes.\nRequirements:\nProficiency in Python programming language.\nStrong understanding of stochastic processes and probability theory.\nExperience in working with NumPy and Matplotlib libraries for numerical computations and data visualization.\nAbility to simulate and analyze random processes and interpret the results accurately.\nProject document will be shared with candidates shortlisted.\nThe task is small, most of it is done, require you to perform the additional 3-4 questions. \nI know the value of a good feedback hence, if this task in undertaken properly, I would owe you decent feedback. <b>Skills</b>:        Probability Theory,                     Python,                     Mathematics,                     Mathematical Modeling            ","link":"https://www.upwork.com/jobs/Experienced-Python-Programmer-Needed-for-Stochastic-Processes-and-Random-Walk-Simulations_%7E012549c54ee11ca85c?source=rss","processedDate":"2024-03-18T20:19:18.247Z","postedDate":"<b>Posted On</b>: March 04, 2024 08:05 UTC","id":"012549c54ee11ca85c"},{"skillset":["Python","Django"],"title":"Looking for Python Django - Upwork","description":"In a table structure.\n1. When clicking on &amp;quot;Create new passage&amp;quot;, a new empty row should be created instead of going to another page another page.\n2. Passages should be able to be moved up/down by clicking or drag/drop. This should update the table position (in the db) also.\nClarification for 1 and 2. https://monosnap.com/file/Z6sQ3dCjZaOrh2qZ9zTgcxUD7zl05r\nThese tutorials will help:\nhttps://www.youtube.com/watch?v=V-f_yYKUJo8\nhttps://copyprogramming.com/howto/sorting-items-by-drag-and-drop-in-django<b>Skills</b>:        Python,                     Django            ","link":"https://www.upwork.com/jobs/Looking-for-Python-Django_%7E018a99aa22bb39833a?source=rss","processedDate":"2024-03-18T20:19:18.247Z","postedDate":"<b>Posted On</b>: March 03, 2024 22:32 UTC","id":"018a99aa22bb39833a"},{"skillset":["Python","Automation","Scripting"],"title":"Automate the clicking of a button (Python). - Upwork","description":"Hi there,\nI am looking for a simple script that will press &#039;REBET&#039; after every round.\nPlease see video for explanation:\nhttps://www.youtube.com/watch?v=Vu4p7X6r3NA\nI need this done in the next 2 hours.<b>Skills</b>:        Python,                     Automation,                     Scripting            ","link":"https://www.upwork.com/jobs/Automate-the-clicking-button-Python_%7E0189fa9222fbf97314?source=rss","processedDate":"2024-03-18T20:19:18.247Z","postedDate":"<b>Posted On</b>: March 03, 2024 09:59 UTC","id":"0189fa9222fbf97314"},{"skillset":["Python","SQLite","Data Scraping","R","Statistical Computing","Front-End Development","Back-End Development"],"title":"Build a website for executive compensation data. - Upwork","description":"I want to develop a website to read data from a couple of platform (API integration) and put the data in a visualization&nbsp;&nbsp;platform such as power BI or Tableau. <b>Skills</b>:        Python,                     SQLite,                     Data Scraping,                     R,                     Statistical Computing,                     Front-End Development,                     Back-End Development            \n","link":"https://www.upwork.com/jobs/Build-website-for-executive-compensation-data_%7E01f35f71f8456726f1?source=rss","processedDate":"2024-03-18T20:19:18.247Z","postedDate":"<b>Posted On</b>: March 03, 2024 08:06 UTC","id":"01f35f71f8456726f1"},{"skillset":["TypeScript","CSS","Python","FastAPI","NGINX"],"title":"REST API and Web-front end development for Kaggle solution - Upwork","description":"\nTask 1: Deploy ready Kaggle solution as REST API Endpoints. \nSimply leverage FastAPI and Nginx to deploy Kaggle AI-generated text inference solution (inference URL: https://www.kaggle.com/code/nbroad/r100-ensemble) as scalable REST API endpoints. \nThese endpoints should be designed to accept essays as input and return the corresponding predicted output. \nDeploy this system on a serverless platform such as AWS Lambda or Azure Functions. The deployment should ensure minimal latency and concurrent user support.\nTask 2: Implement a Simple User-Friendly Web Front-End that interfaces with the deployed REST API endpoints. \nThe interface should allow users to input text (incl. copy-paste text) and, upon submission, invoke the corresponding REST API to receive and display the output from the serverless platform. \nDocument the overall system architecture and workflows.<b>Skills</b>:        TypeScript,                     CSS,                     Python,                     FastAPI,                     NGINX            ","link":"https://www.upwork.com/jobs/REST-API-and-Web-front-end-development-for-Kaggle-solution_%7E012769971c606fca11?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: March 03, 2024 00:08 UTC","id":"012769971c606fca11"},{"skillset":["JSON","JavaScript","API","Firebase"],"title":"Javascript functions for JSON &amp; RSS Feed Diff [Prototype] - Upwork","description":"I need to build a page that will take an RSS or JSON feed as input, and display the data in 3 views (side by side): \n1) a tree \n2) a flat table format\n3) a key:value list\nNext, the user will be able to choose in view (1) which node to base the table (2) on. \nThe user will be able to choose in view (2) which columns to keep/remove for view (3).\nView (3) will be stored in a NoSql database to track incremental updates. \nNext, the feed will be fetched on a&nbsp;&nbsp;schedule, and will show the difference between the last two fetches in views 2 and 3.\nSample feed: https://az511.com/api/v2/get/event?key=dab29097f656484e8df9f99903bbdb50\nAttached is a mockup.\nHere is a full writeup of the project, but only the above functionality is part of this initial phase: https://docs.google.com/document/d/1D_GbR8X55rGJZnFqqOfFZPpsNi23Vkn4A0IpeHV7XYc/edit?usp=sharing<b>Skills</b>:        JSON,                     JavaScript,                     API,                     Firebase            ","link":"https://www.upwork.com/jobs/Javascript-functions-for-JSON-amp-RSS-Feed-Diff-Prototype_%7E0116360700c36a1747?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: March 02, 2024 21:23 UTC","id":"0116360700c36a1747"},{"skillset":["Python","ChatGPT API"],"title":"Help Improve Research Paper Scanning Script with OpenAI API - Upwork","description":"I have a script which scans research papers (attached) to see if they talk about (implicitly or explicitly) certain parameters. I need help improving it to ensure accuracy.\nIn order to apply, please explain the two methods the script uses to scan papers, so I know you understand the task.\nI will provide more details once you reach out.<b>Skills</b>:        Python,                     ChatGPT API            ","link":"https://www.upwork.com/jobs/Help-Improve-Research-Paper-Scanning-Script-with-OpenAI-API_%7E017ba1a9b80abdf046?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: March 02, 2024 21:11 UTC","id":"017ba1a9b80abdf046"},{"skillset":["Microsoft Excel","Visual Basic for Applications","Macro Programming","Visual Basic","Spreadsheet Software"],"title":"Excel VBA MACRO Development  - Upwork","description":"I need a macro to be created in Excel that I click a button and it will transform the CSV file into a new CSV file with correct formatting. The button should be in the ribbon.\nAttached is an example of how the Raw CSV file will look before the macro ran - &amp;quot;rawdata.csv&amp;quot;\nAfter ran, it should look like the attached &amp;quot;output.csv&amp;quot;\nThe examples should be clear, but a few things to note.\n1) You will need some lookups for country and shipping. Those are in the csv called &amp;quot;lookups.csv&amp;quot;\nPlease hardcode these into the macro.\n2) Ignore items in column R of the raw data that DO NOT have - Snip Free Sample \n3) Column D of the output file is Column R from the raw data concatenated with like names (order numbers) separated with pipes &amp;quot;|&amp;quot; and removing the &amp;quot; - Snip Free Sample&amp;quot;\n4) There can be instances of entire order #s that are not on the output since none of the items have the &amp;quot;- Snip Free Sample&amp;quot;&nbsp;&nbsp;For example #2495 would not be on the output<b>Skills</b>:        Microsoft Excel,                     Visual Basic for Applications,                     Macro Programming,                     Visual Basic,                     Spreadsheet Software            ","link":"https://www.upwork.com/jobs/Excel-VBA-MACRO-Development_%7E01db0b7fdcd1ccf6dd?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: March 02, 2024 19:52 UTC","id":"01db0b7fdcd1ccf6dd"},{"skillset":["WordPress","HTML","MQL 4","Forex Trading","MetaTrader 4","Bot Development","MQL 5","Scripting","MetaTrader","Automation","MetaTrader 5","Financial Trading","Trading Strategy","Trading Automation","Online Financial Trading"],"title":"Efficient frontier estimation - Upwork","description":"Hello!\nI would like to have an R script that estimates an efficient frontier with the optimal portfolio and the associated key statistics (historical return, historical volatility, Sharpe Ratio, maximum drawdown). \nThe underlying data should come from a free API (up to you which one you find best). At the beginning of the script, I would like to be able to define 1) the time horizon which is used to assess the inputs (eg 5 years, 10 years, 20 years, 30 years) and 2) the list of asset classes that should be included in the optimization (stocks, government bonds, corporate bonds, commodities, real estate). \nThe output should be summarized in a table and visualized with some key charts (eg the efficient frontier with a highlighted dot for the optimal portfolio; a bar chart showing the % weights of each asset class in the optimal portfolio, and any other charts that you deem insightful). \nIs that something you could do, and if so, how much time would you need for this?\nThanks and regards,\nPatrick<b>Skills</b>:        WordPress,                     HTML,                     MQL 4,                     Forex Trading,                     MetaTrader 4,                     Bot Development,                     MQL 5,                     Scripting,                     MetaTrader,                     Automation,                     MetaTrader 5,                     Financial Trading,                     Trading Strategy,                     Trading Automation,                     Online Financial Trading            ","link":"https://www.upwork.com/jobs/Efficient-frontier-estimation_%7E014c0ba66cfb2db4c4?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: March 02, 2024 18:44 UTC","id":"014c0ba66cfb2db4c4"},{"skillset":["API","RESTful API","PLC Programming"],"title":"Siemens NORIS API Integration Specialist - Upwork","description":"I am seeking a knowledgeable and hands-on guide who can assist and mentor me in successfully integrating Siemens&#039;s Web Service Interface &ndash; Northbound Open RESTful Integration Service (NORIS) API Version 4.0 into my existing system. I am looking for someone with a proven track record in API integration, specifically with Siemens NORIS, and who can provide clear guidance throughout the process.\n-----------------\nEndpoint URL: https://192.168.20.1:443/ccWSI\nStep-by-Step Integration Support: Assist in the step-by-step integration of AH251 and AH25R1 devices, ensuring a smooth process for the following points:\nAH251:\nWater Valve Drive: AH-251_MV\nReturn Air Temperature Setting: AH-251_RSET\nVariable Frequency Drive Frequency Control: AH-251_SC\nAH25R1:\nWater Valve Drive: AH-25R1_MV\nReturn Air Temperature Setting: AH-25R1_RSET\nVariable Frequency Drive Frequency Control: AH-25R1_SC\n-----------------\nI look forward to partnering with an experienced guide who can empower me in achieving a seamless Siemens NORIS API integration.<b>Skills</b>:        API,                     RESTful API,                     PLC Programming            ","link":"https://www.upwork.com/jobs/Siemens-NORIS-API-Integration-Specialist_%7E017e12c17bc6e4313b?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: March 02, 2024 10:45 UTC","id":"017e12c17bc6e4313b"},{"skillset":["API Integration","Scripting","Golang","API","Websockets","Bot"],"title":"Add Websocket Connection For User Accounts | Discord Go Library - Upwork","description":"Dear Applicant,\nFirst of all, thank you for considering our project. Due to the large volume of messages received on our Discord User account, we plan to streamline their management. Your role would involve establishing a connection to Discord and monitoring all events. As we are members of more than 100 servers, we require a stable solution to prevent any crashes. We can&#039;t use an official Discord bot for this since it&#039;s impossible to have this bot on all servers.\nWe are particularly interested in candidates who have experience with the Discord library and are familiar with OP websocket events. Ensuring that the automation remains undetected and unflagged by Discord is our top priority, although merely listening to websocket events rarely triggers any flags on Discord.\nThe library to be modified is: https://github.com/bwmarrin/discordgo, with a primary focus on https://github.com/bwmarrin/discordgo/blob/master/wsapi.go.\nA successful modification example can be found here, although it addresses connection rather than monitoring new message events: https://github.com/chrigeeel/SatanGo/blob/master/cooldiscord/wsapi.go.\nIt is crucial to always update to the latest ClientBuildNumber before connecting, and this should be set correctly alongside the implementation of events so that they can be invoked and managed by the respective handlers.\nWe look forward to your applications!<b>Skills</b>:        API Integration,                     Scripting,                     Golang,                     API,                     Websockets,                     Bot            ","link":"https://www.upwork.com/jobs/Add-Websocket-Connection-For-User-Accounts-Discord-Library_%7E01aa0fa34fb9a5a4d0?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: March 02, 2024 10:39 UTC","id":"01aa0fa34fb9a5a4d0"},{"skillset":["R","Python","Deep Learning","Machine Learning","Artificial Intelligence","Forex Trading","Forecasting","Quantitative Analysis","Cryptocurrency","Statistics"],"title":"Quanatitve algo trading system and scanner builder   - Upwork","description":"We built a crypto market scanner that needs to be redeployed and looking to create a new strategy system that will be tested in a sandbox environment. \nIm looking for someone that have experience in crypto markets, order book tracking, liquidity tracking, volume tracking \nand can build a systematic engine based on both our strategy and recommended strategy.&nbsp;&nbsp;<b>Skills</b>:        R,                     Python,                     Deep Learning,                     Machine Learning,                     Artificial Intelligence,                     Forex Trading,                     Forecasting,                     Quantitative Analysis,                     Cryptocurrency,                     Statistics            ","link":"https://www.upwork.com/jobs/Quanatitve-algo-trading-system-and-scanner-builder_%7E01aedab10255bbf163?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: March 01, 2024 22:10 UTC","id":"01aedab10255bbf163"},{"skillset":["Conjoint Analysis","R","Data Analysis","Stata","Quantitative Research","Statistics","Predictive Analytics","Econometrics","Statistical Analysis","Data Science","Supervised Learning","Causal Inference","Machine Learning","Linear Regression","Data Analytics"],"title":"Ecommerce Target CPA Analysis  - Upwork","description":"We are looking for someone to analyze our ecommerce store data to help determine the target CPA we should be aiming for to scale our ad campaigns profitably. analyzing average order data and customer lifetime values including COGS, etc.<b>Skills</b>:        Conjoint Analysis,                     R,                     Data Analysis,                     Stata,                     Quantitative Research,                     Statistics,                     Predictive Analytics,                     Econometrics,                     Statistical Analysis,                     Data Science,                     Supervised Learning,                     Causal Inference,                     Machine Learning,                     Linear Regression,                     Data Analytics            ","link":"https://www.upwork.com/jobs/Ecommerce-Target-CPA-Analysis_%7E01d77085349ffa5077?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: March 01, 2024 15:48 UTC","id":"01d77085349ffa5077"},{"skillset":["API Integration","Scripting","NinjaTrader","C#","API"],"title":"C# Futures trading strategy for Ninja Trader and usable via any API   - Upwork","description":"I would like a program in C#(for Ninja Trader) and or for use via an API to execute a portfolio of 10-15 futures assets.\nEntry will be based on 3 indicators and go long on a touch of the first of the 3 upper bands or go short on the touch of the first of the 3 lower bands. The 3 indicators will be based off the daily bar and execution will be intraday off a 5min&nbsp;bar and or on price change not close of bar.&nbsp;&nbsp;&nbsp;Stop is based on the opposite closest band(if long, a trailing stop will be set at the closet&nbsp;of the 3 lower bands. Note if closest lower band is further away from current stop do not adjust.) Position sizing will be based on a fixed risk dollar amount (user input) based on entry and stop (see bands Entry Stop rules)&nbsp;\nI would like a scale out option to scale out 1/4 or 1/2 the position at 2:1 risk to reward ratio.&nbsp;&nbsp;Another idea is to scale out 1/4th of the position at 2R and another 1/4th at 3R.(user input to select scale out %, # of scale outs and R:R) &nbsp;&nbsp;Allowing the balance of position run.&nbsp;&nbsp;&nbsp;&nbsp;Can I get a quote on total project cost? \nalso do I get the open-source code? &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<b>Skills</b>:        API Integration,                     Scripting,                     NinjaTrader,                     C#,                     API            ","link":"https://www.upwork.com/jobs/Futures-trading-strategy-for-Ninja-Trader-and-usable-via-any-API_%7E0130947c3a5e80ed25?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: March 01, 2024 15:30 UTC","id":"0130947c3a5e80ed25"},{"skillset":["Google Apps Script","API"],"title":"Quick Google Apps Script/API job - Upwork","description":"We need help connecting an API with a google sheet via google apps script.\nHere is a short explainer: https://share.vidyard.com/watch/4R8e35abkdPWCLHYrsG5Sa?\nHere is the API documentation (see People Enrichment and People API specifically. They are separate): https://apolloio.github.io/apollo-api-docs/\nThis is a quick job and can lead to more similar automation work.\nI look forward to hearing your proposals<b>Skills</b>:        Google Apps Script,                     API            ","link":"https://www.upwork.com/jobs/Quick-Google-Apps-Script-API-job_%7E01488a965314f3489d?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: March 01, 2024 15:03 UTC","id":"01488a965314f3489d"},{"skillset":["Qualitative Research","Data Analysis","Market Analysis","Market Research","Report","Data Entry","Data Mining"],"title":"Hiring experienced  Research Analysts to Drive Innovation - Upwork","description":"We are in search of a highly motivated and detail-oriented Research Analyst agency. The Research Analyst will play a crucial role in gathering, analyzing, and interpreting data to provide actionable insights and recommendations that drive decision-making processes within our organization.\nThe ideal candidate will possess strong analytical skills, meticulous attention to detail, and the ability to work both independently and collaboratively within a team environment.\nKey Responsibilities:\n&bull;\tConduct comprehensive research on various topics, including market trends, industry developments, competitor analysis, and customer behavior.\n&bull;\tGather and analyze data from diverse sources such as databases, surveys, interviews, and secondary research materials.\n&bull;\tInterpret data to identify patterns, trends, and correlations that inform strategic decision-making.\n&bull;\tPrepare detailed reports, presentations, and other materials to effectively communicate research findings and recommendations to key stakeholders.\n&bull;\tCollaborate closely with cross-functional teams to support business initiatives and address specific research objectives.\n&bull;\tStay abreast of industry best practices, emerging trends, and new technologies related to research and data analysis.\n&bull;\tAssist in the development and implementation of research methodologies and tools to enhance efficiency and effectiveness.\n&bull;\tMaintain the integrity and accuracy of data throughout the research process to ensure the reliability of findings.\nQualifications:\n1.\tBachelor&#039;s degree in a related field such as Economics, Statistics, Business, or Finance; Master&#039;s degree preferred.\n2.\t2+ years of experience in a research or analytical role, preferably within a corporate or consulting setting.\n3.\tProficiency in data analysis tools and software, such as Excel, SPSS, SAS, R, or Python.\n4.\tStrong analytical skills with the ability to collect, organize, analyze, and present significant amounts of information with precision and attention to detail.\n5.\tExcellent written and verbal communication skills, capable of conveying complex concepts and findings to diverse audiences.\n6.\tProven ability to work independently and manage multiple projects simultaneously while meeting tight deadlines.\n7.\tStrong problem-solving skills with a proactive approach to identifying and addressing research challenges.\n8.\tFamiliarity with research methodologies, quantitative and qualitative data analysis techniques, and statistical concepts.\nPlease Note:\n&bull;\tThe fixed rate applies per milestone, with an average milestone duration ranging between 1 to 2 weeks.\n&bull;\tThe project duration will be less than one month.\n&bull;\tSeeking Agencies with the aforementioned expertise; individuals need not apply.\n&bull;\tWe encourage Agencies from Asia to apply.\nIf you believe your agency is well-suited for this role and meets the qualifications outlined above, we invite you to apply and become a valuable part of our dynamic team!<b>Skills</b>:        Qualitative Research,                     Data Analysis,                     Market Analysis,                     Market Research,                     Report,                     Data Entry,                     Data Mining            ","link":"https://www.upwork.com/jobs/Hiring-experienced-Research-Analysts-Drive-Innovation_%7E012293cdceaeefe6a8?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: March 01, 2024 14:30 UTC","id":"012293cdceaeefe6a8"},{"skillset":["Automation","API Integration","Python","Android","Telegram API","Telegram"],"title":"Telegram bot &amp; Mini App - Upwork","description":"Hi, I need a telegram bot similar to this one @BitgetOfficialBot\nI do not need any functionalities implemented yet. I need this only as more PoC for presentation.\nHere is the Figma file we can use for Telegram Mini App: https://www.figma.com/file/wGoEqtR1rzEuSvtjjsxIBX/SmartWhales?type=design&amp;amp;node-id=0-1&amp;amp;mode=design&amp;amp;t=vyxyCAo0RvJ4OXHA-0\nHere is the document explaining how bot and mini app have to look like this: https://docs.google.com/document/d/1-z7KVc8_Lt4-V5hdwc6yy5Ru2XjlMdx0f_b406TD7ho/edit\nHappy to have a call before starting.<b>Skills</b>:        Automation,                     API Integration,                     Python,                     Android,                     Telegram API,                     Telegram            ","link":"https://www.upwork.com/jobs/Telegram-bot-amp-Mini-App_%7E01ec37193b68fd2c4a?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: February 29, 2024 20:45 UTC","id":"01ec37193b68fd2c4a"},{"skillset":["MQL 4","MetaTrader 4","MQL 5"],"title":"Build a trading algorithm for MQL5 - Upwork","description":"1. Identify the high and low price for 15min bar (option to select time of day the candle is being identified and timeframe) at a certain. This parameter will be used to set trades at different market opens for the day eg London open, New York Open etc (typically 2nd or 3rd candle after the open).\n2. Place a buy stop at the high of the 2nd 15min bar and a sell stop at the low of the 2nd 15min bar as soon as the candle closes (option to use different timeframe here as well). The stop loss distance is equivalent to the opposite order. For example, if the buy stop is triggered, the stop loss is at the sell stop. \nIn a scenario where the buy stop is triggered but ends in a loss and the sell stop is triggered, place another buy-stop at the originial buy-stop. (Option for maximum number of trades that can be taken with the EA)\n3. Trade size should be calculated based on the risk of the trade eg 0.5% (option to configure eg 1% of account, 2% of account)) of the start of-day equity balance. \n3. Profit taking is 2 times the stop loss size (option to configure eg 1R, 1.5R, 3R etc). If a trade is profitable, the EA will wait until the next day to set trades. However, please note I will be using the same EA across multiple instruments and times of the day. For example I might set the EA for AUDUSD at 9am and then 1pm. If the 9am trade is profitable, the EA should still take the 1pm orders. \n4. Set a parameter for the maximum % drawdown for the day (option to configure). If the maximum drawdown is breached, all trading should stop for the day and resume the following day. <b>Skills</b>:        MQL 4,                     MetaTrader 4,                     MQL 5            ","link":"https://www.upwork.com/jobs/Build-trading-algorithm-for-MQL5_%7E01a1f120734fdc9e52?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: February 29, 2024 14:15 UTC","id":"01a1f120734fdc9e52"},{"skillset":["AI Trading","Automation","Forex Trading","Python","Bot Development","Artificial Intelligence"],"title":"I want to build AI  Automated forex EA TRADING BOT - Upwork","description":"I need an expert to build or sell for me Automated AI forex trading bot to trade on MT4-MT5.\nI am looking for an expert to build a customized EA for me to trade on MT4-MT5 without no errors.\nDescription::I want the strategies to be automated,picking SL/TP and buying/selling automated for all trading time on all pairs and should be used on demo to test run.if u r capable of the requirements.contact me to discuss further.i am not looking for a cracked EA pls.\nhttps://www.youtube.com/watch?v=Kx9PdqUbQgM\nhttps://www.youtube.com/watch?v=uvOPeWrhRJs&amp;amp;t=40s\nhttps://www.youtube.com/watch?v=ZjUd_krZV0M&amp;amp;t=13s\nWhat i need is exactly&nbsp;&nbsp;what is in the video.<b>Skills</b>:        AI Trading,                     Automation,                     Forex Trading,                     Python,                     Bot Development,                     Artificial Intelligence            ","link":"https://www.upwork.com/jobs/want-build-Automated-forex-TRADING-BOT_%7E011c1328e08cc6bdfb?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: February 29, 2024 11:22 UTC","id":"011c1328e08cc6bdfb"},{"skillset":["MQL 4"],"title":"Develoment of MT4 Buy Sell Indicator combining 4 custom indicators - Upwork","description":"Strategy For Auto Trading Signals\nIndicators ;\n1.\tMagic trend &ndash; CC-100, ATR-0\n2. ADX Cross - Period 10\n3.\tMACD Zoom- r-8, s-5, u-4\n4.\tForex Entry Point- K-14, D-8, Slow-4, Zone high-50, Zone Low-50.\nBuy Conditions: Following are the conditions for Buy Entry\n1.\tThe Green Candle moves above the Magic Trend Line \n2.\tADX Cross Green arrow is formed\n3.\tAnd the MACD Histogram turns to Green\n4.\tForex Entry Point &ndash; K period 14 line crosses D period Blue line from below and Aqua Histogram bar is formed\nBuy Entry -When ADX Green arrow is formed and Price is Moving above the Magic Trend Line and MACD Histogram turns to Green in window -1 and K line moving upward and crossing D line from below or crossing 30 level line from below or Aqua Colour Bar is formed in window-2\nStop Loss : \n Low of below the Magic Trend Line at the Candle Previous to ADX Green arrow&nbsp;&nbsp;&nbsp;Line \nSell Conditions: Following are the conditions for Buy Entry\n1.\tThe Red Candle moves below the Magic Trend Line \n2.\tADX Cross Red arrow is formed\n3.\tAnd the MACD Histogram turns to Red\n4.\tForex Entry Point &ndash; K period 14 line crosses D period Blue line from above and Magenta Histogram bar is formed\nSell Entry -When ADX Red arrow is formed and Price is Moving below the Magic Trend Line and MACD Histogram turns to Red in window -1 and K line moving downward and crossing D line from above or crossing 70 level line from above or Mgenta Colour Bar is formed in window-2\nStop Loss : \n High of above the Magic Trend Line at the Candle Previous to ADX Red arrow&nbsp;&nbsp;&nbsp;Line <b>Skills</b>:        MQL 4            ","link":"https://www.upwork.com/jobs/Develoment-MT4-Buy-Sell-Indicator-combining-custom-indicators_%7E0120e36023eeb69db2?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: February 29, 2024 11:20 UTC","id":"0120e36023eeb69db2"},{"skillset":["Forex Trading","Scripting"],"title":"Edit a Trading View Pine Script - Upwork","description":"I have a Trading View pine script and I need you to help me do a simple edit.\nBelow is the script.\nhttps://docs.google.com/document/d/1YURnvbr1MyWzfyX5rKhZ0FlJ0INSVqGtkeR74WWt7fk/edit?usp=sharing\nIn this script, the buy and sell signal are using question mark ?.\nI need you to change this to arrow instead.\nDown arrow for sell signal and up arrow for buy signal.\nSee attached image.\nThat&#039;s all I need.<b>Skills</b>:        Forex Trading,                     Scripting            ","link":"https://www.upwork.com/jobs/Edit-Trading-View-Pine-Script_%7E0146474e2cbc7ea75f?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: February 29, 2024 10:13 UTC","id":"0146474e2cbc7ea75f"},{"skillset":["Python","React","API Integration","Hugging Face","Chatbot Development","Retrieval Augmented Generation","Vector Database","Deep Learning","Machine Learning","Large Language Model"],"title":"Gen AI Architect to build end to end business solutions - Upwork","description":"Looking for a highly skilled Generative AI Architect for 3-6 months. You will work with a team of experienced data scientists. This contract includes multiple sub-projects and milestones. Must be experienced in end to end solution architecting of a generative AI application using Huggingface LLM, RAG, vector databases, chatbots, MLOps and integration with existing products &amp;amp; product APIs. \n&bull;\tDevelop architecture for integrating generative AI solutions &amp;amp; chatbot on top of existing product, using advanced Generative AI large language models, Machine Learning and Deep Learning Models\n&bull;\tTrain LLM using organization specific data, use RAG/vector database or alternate solution to improve the accuracy of LLM.\n&bull;\tApply design principles to ensure architecture is scalable, extensible and secure &amp;amp; flexible with integrations\n&bull;\tBuild end to end solution architecture including data workflow and requests workflow from Front end/UI, business layer and data layer\n&bull;\tImplement ML Ops for data ingestion, model training, monitoring, re-training<b>Skills</b>:        Python,                     React,                     API Integration,                     Hugging Face,                     Chatbot Development,                     Retrieval Augmented Generation,                     Vector Database,                     Deep Learning,                     Machine Learning,                     Large Language Model            ","link":"https://www.upwork.com/jobs/Gen-Architect-build-end-end-business-solutions_%7E0150c2b9cf9ab6b017?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: February 29, 2024 09:27 UTC","id":"0150c2b9cf9ab6b017"},{"skillset":["Qualitative Research","Data Analysis","Market Analysis","Market Research","Report","Data Entry","Data Mining"],"title":"We're Recruiting Research Analysts to Drive Innovation - Upwork","description":"We are seeking a highly motivated and detail-oriented Research Analyst agency. The Research Analyst will be responsible for gathering, analyzing, and interpreting data to provide actionable insights and recommendations to support decision-making processes within the organization.\nThe ideal candidate will possess strong analytical skills, a keen eye for detail, and the ability to work effectively both independently and as part of a team.\nKey Responsibilities:\n1. Conduct research on various topics, including market trends, industry developments, competitor analysis, and customer behavior.\n2. Collect and analyze data from multiple sources, such as databases, surveys, interviews, and secondary research materials.\n3. Interpret data to identify patterns, trends, and correlations that can inform strategic decision-making.\n4. Prepare reports, presentations, and other materials to communicate research findings and recommendations to key stakeholders.\n5. Collaborate with cross-functional teams to support business initiatives and address specific research objectives.\n6. Stay current with industry best practices, emerging trends, and new technologies related to research and data analysis.\n7. Assist in the development and implementation of research methodologies and tools to enhance efficiency and effectiveness.\n8. Maintain data integrity and accuracy throughout the research process, ensuring the reliability of findings.\nQualifications:\n- Bachelor&#039;s degree in a related field such as Economics, Statistics, Business, or Finance; Master&#039;s degree preferred.\n- 2+ years of experience in a research or analytical role, preferably in a corporate or consulting environment.\n- Proficiency in data analysis tools and software, such as Excel, SPSS, SAS, R, or Python.\n- Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy.\n- Excellent written and verbal communication skills, with the ability to effectively communicate complex concepts and findings to diverse audiences.\n- Proven ability to work independently and manage multiple projects simultaneously, meeting tight deadlines.\n- Strong problem-solving skills and a proactive approach to identifying and addressing research challenges.\n- Familiarity with research methodologies, quantitative and qualitative data analysis techniques, and statistical concepts.\nPlease Note:\n1. The fixed rate applies per milestone, with an average milestone duration ranging between 1 to 2 weeks.\n2. The project duration will be less than one month.\n3. Seeking Agencies with the aforementioned expertise; individuals need not apply.\n4. We encourage Agencies from Asia to apply.\nIf you believe you are the best person for this role and meet the qualifications above, we encourage you to apply and join our dynamic team!<b>Skills</b>:        Qualitative Research,                     Data Analysis,                     Market Analysis,                     Market Research,                     Report,                     Data Entry,                     Data Mining            ","link":"https://www.upwork.com/jobs/Recruiting-Research-Analysts-Drive-Innovation_%7E01cec2fceab46f7220?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: February 29, 2024 08:39 UTC","id":"01cec2fceab46f7220"},{"skillset":["Market Research","Data Entry","Company Research","Market Analysis","Research Methods","Microsoft Excel","Data Analysis","Data Mining"],"title":"Hiring Agencies with Research Analyst  - Upwork","description":"We are seeking a highly motivated and detail-oriented Research Analyst agency. The Research Analyst will be responsible for gathering, analyzing, and interpreting data to provide actionable insights and recommendations to support decision-making processes within the organization. \nThe ideal candidate will possess strong analytical skills, a keen eye for detail, and the ability to work effectively both independently and as part of a team.\nKey Responsibilities:\n1. Conduct research on various topics, including market trends, industry developments, competitor analysis, and customer behaviour.\n2. Collect and analyze data from multiple sources, such as databases, surveys, interviews, and secondary research materials.\n3. Interpret data to identify patterns, trends, and correlations that can inform strategic decision-making.\n4. Prepare reports, presentations, and other materials to communicate research findings and recommendations to key stakeholders.\n5. Collaborate with cross-functional teams to support business initiatives and address specific research objectives.\n6. Stay current with industry best practices, emerging trends, and new technologies related to research and data analysis.\n7. Assist in the development and implementation of research methodologies and tools to enhance efficiency and effectiveness.\n8. Maintain data integrity and accuracy throughout the research process, ensuring the reliability of findings.\nQualifications:\n- Bachelor&#039;s degree in a related field such as Economics, Statistics, Business, or Finance; Master&#039;s degree preferred.\n- 2+ years of experience in a research or analytical role, preferably in a corporate or consulting environment.\n- Proficiency in data analysis tools and software, such as Excel, SPSS, SAS, R, or Python.\n- Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy.\n- Excellent written and verbal communication skills, with the ability to effectively communicate complex concepts and findings to diverse audiences.\n- Proven ability to work independently and manage multiple projects simultaneously, meeting tight deadlines.\n- Strong problem-solving skills and a proactive approach to identifying and addressing research challenges.\n- Familiarity with research methodologies, quantitative and qualitative data analysis techniques, and statistical concepts.\nPlease Note: \n1. The fixed rate applies per milestone, with an average milestone duration ranging between 1 to 2 weeks. \n2. The project duration will be less than one month. \n3. Seeking Agencies with the aforementioned expertise; individuals need not apply. \n4. We encourage Agencies from Asia to apply.\nIf you believe you are the best person for this role and meet the qualifications above, we encourage you to apply and join our dynamic team!<b>Skills</b>:        Market Research,                     Data Entry,                     Company Research,                     Market Analysis,                     Research Methods,                     Microsoft Excel,                     Data Analysis,                     Data Mining            ","link":"https://www.upwork.com/jobs/Hiring-Agencies-with-Research-Analyst_%7E010420ca93daa9a4fa?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: February 29, 2024 08:28 UTC","id":"010420ca93daa9a4fa"},{"skillset":["API Integration","NinjaTrader"],"title":"Copy Trader for Ninja Trading Platform - Upwork","description":"At a High Level we are looking for the following:\nCustom indicator created for Ninja Trader platform and installed via a script.\nIndicator communicates via a cloud network to other machines using this indicator \nDetails\nBuilt as an indicator with a Master account and Slave Accounts\nCopy all aspects of a trade, must be able to copy buy limits, sell limits, market orders, and etc\nMust have the ability to easily change the master account if needed\nAbility to easily add individual slave accounts\nMonitor balances, profits and trade executions so we can track all accounts are making profit and trades are executing accurately for all\nUse the Machine ID&#039;s to manage access<b>Skills</b>:        API Integration,                     NinjaTrader            ","link":"https://www.upwork.com/jobs/Copy-Trader-for-Ninja-Trading-Platform_%7E013ed4ace44e531d29?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: February 29, 2024 02:29 UTC","id":"013ed4ace44e531d29"},{"skillset":["Report Writing","Online Research","Brand Research","SurveyMonkey","Qualitative Research","Quantitative Analysis","Research Methods","Business Consulting","Price &amp; Quote Negotiation","Client Interview","Marketing Consulting","Survey","Microsoft Excel","Microsoft Office","Trend Forecasting"],"title":"Market Research Data Collection and Analysis. - Upwork","description":"Job Title: Market Research Data Analyst\nCompany: Motherpluckers Inc\nAbout Motherpluckers Inc.:\nMotherpluckers Inc. is a leading eyebrow bar and beauty salon dedicated to providing exceptional grooming services and beauty experiences to our clients. With a commitment to quality, innovation, and customer satisfaction, we have established ourselves as a premier destination for eyebrow shaping, threading, and other beauty services. As we continue to grow and expand our presence in the market, we are seeking a talented Market Research Data Analyst to help our team and drive strategic decision-making through insightful data collection and analysis.\nJob Description:\nAs a Market Research Data Analyst at Motherpluckers Inc., you will play a critical role in gathering, analyzing, and interpreting data to inform our business strategies and enhance our competitive position in the market. You will be responsible for developing robust data collection processes, establishing standard operating procedures, and delivering comprehensive reports on various aspects of our market landscape and competitive environment. The primary deliverables for this role include:\nKey Responsibilities:\n- Develop and implement data collection methodologies to gather information on market trends, consumer preferences, and competitor activities.\n- Design and execute surveys, interviews, and other research initiatives to gather qualitative and quantitative data.\n- Analyze and interpret data using statistical techniques, data visualization tools, and market research software.\n- Generate regular reports on the closest competition, including their strengths, weaknesses, market positioning, and strategic initiatives.\n- Identify and evaluate Motherpluckers Inc.&#039;s advantages and disadvantages compared to competitors, highlighting areas for improvement and opportunities for differentiation.\n- Recommend strategies to leverage our strengths and market position to elevate our brand and outperform the competition.\n- Collaborate with cross-functional teams to develop and implement marketing, pricing, and product strategies based on research findings.\n- Monitor market trends, industry developments, and consumer behavior to identify emerging opportunities and potential threats.\nQualifications:\n- Proven experience in market research, data analysis, and strategic planning.\n- Proficiency in statistical analysis tools (e.g., SPSS, SAS, R) and data visualization software (e.g., Tableau, Power BI).\n- Strong analytical skills with the ability to interpret complex data sets and generate actionable insights.\n- Excellent written and verbal communication skills, with the ability to present findings and recommendations to stakeholders at all levels.\n- Detail-oriented with a commitment to accuracy and data integrity.\n- Experience in the beauty or retail industry is a plus.\nIf you are passionate about market research, data analysis, and driving strategic growth in the beauty industry, we encourage you to apply for this exciting opportunity to be part of Motherpluckers Inc. growth. Please submit your resume and cover letter detailing your relevant experience and why you are the ideal candidate for this position. We look forward to hearing from you!<b>Skills</b>:        Report Writing,                     Online Research,                     Brand Research,                     SurveyMonkey,                     Qualitative Research,                     Quantitative Analysis,                     Research Methods,                     Business Consulting,                     Price &amp; Quote Negotiation,                     Client Interview,                     Marketing Consulting,                     Survey,                     Microsoft Excel,                     Microsoft Office,                     Trend Forecasting            ","link":"https://www.upwork.com/jobs/Market-Research-Data-Collection-and-Analysis_%7E01e76be23e63421322?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: February 28, 2024 14:56 UTC","id":"01e76be23e63421322"},{"skillset":["Artificial Intelligence","Natural Language Processing"],"title":"AI Experts in  Large Language Models (LLM) - Upwork","description":"Job Description:\nWe are seeking an experienced AI Expert specializing in Large Language Models (LLM) to join our dynamic team. The ideal candidate will have extensive knowledge in enterprise-grade AI applications, with a particular focus on models such as OpenAI, Mistral7b, and other leading models. This role requires expertise in optimizing open-source models to meet the specific needs of our projects.\nKey Responsibilities:\nDevelop, implement, and optimize Large Language Models for various enterprise applications.\nWork with models like OpenAI and Mistral7b, adapting and enhancing their capabilities for specialized tasks.\nOptimize open-source AI models for efficiency and effectiveness in diverse environments.\nUtilize AWS AI tools such as Bedrock, Kendra, and SageMaker to build and deploy scalable AI solutions.\nCollaborate with cross-functional teams to integrate AI technologies into our products and services.\nStay up-to-date with emerging trends and technologies in AI and machine learning.\nQualifications:\nProven experience in working with Large Language Models such as OpenAI and Mistral7b.\nStrong background in optimizing open-source AI models.\nProficient in AWS AI tools including Bedrock, Kendra, and SageMaker.\nExcellent programming skills in relevant languages (e.g., Python, R).\nStrong analytical and problem-solving abilities.\nBachelor&rsquo;s or Master&rsquo;s degree in Computer Science, AI, Machine Learning, or a related field.<b>Skills</b>:        Artificial Intelligence,                     Natural Language Processing            ","link":"https://www.upwork.com/jobs/Experts-Large-Language-Models-LLM_%7E01508b0c1be0ee2c4a?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: February 28, 2024 13:56 UTC","id":"01508b0c1be0ee2c4a"},{"skillset":["Qualitative Research","Data Analysis","IBM SPSS","Research Methods"],"title":"Qualitative research of the data - Upwork","description":"Data was collected from 88 respondents, there are 8 hypotheses that need to be tested.\nI need an analysis describing the survey results, using various analytical methods from econometrics (R, correlation and etc).\nWhat should be there: \nThe explanation of methods chosen and why\nTables and graphics \nExplanation of results\nEstimated page limit: 10-20 pages \nAn urgent task. <b>Skills</b>:        Qualitative Research,                     Data Analysis,                     IBM SPSS,                     Research Methods            ","link":"https://www.upwork.com/jobs/Qualitative-research-the-data_%7E01c5b6dbb9c1da318b?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: February 27, 2024 22:10 UTC","id":"01c5b6dbb9c1da318b"},{"skillset":["Google Sheets","Airtable"],"title":"Google sheet + Airtable Expert - Upwork","description":"We are a roofing company. We&#039;re moving our custom-developed pricing and order management system from Google Sheets to Airtable to enhance our operational efficiency and user experience.\nRole Description:\nWe are seeking a skilled individual to lead the migration of our estimating and sales processes, with a special focus on interface expertise. \nKey responsibilities include:\n- Transferring and replicating functionality from Google Sheets to Airtable, while ensuring a strong emphasis on user interface design and usability.\n- Integrating multiple Airtable bases and ensuring seamless data flow, maintaining an intuitive and efficient user interface.\n- Customizing Airtable with formulas, scripts, and sophisticated interfaces to match our specific operational needs and enhance the user experience.\n- Collaborating with team members to understand their needs, incorporating feedback into interface design, and ensuring a smooth transition.\nRequirements:\n- Proficient in Google Sheets, with a strong grasp of complex formulas.\n- Experienced in Airtable, including base connections, table linking, scripting, and interface design.\n- Logical thinker, capable of utilizing ChatGPT-4 for innovative scripting solutions.(if you don&#039;t have access to gpt4, we would provide access)\n- Programming skills are beneficial but not mandatory. Logic is much hire skill then programming.\nVideo of google sheet and airtable as they currently are:\n1.\nhttps://www.loom.com/share/060721e4ee794877ba3e4096fb16da90?sid=61ac9ff3-6566-4766-bc2d-ec5823ff3231\n2. https://www.loom.com/share/89d767bed7fe425d90a3e87fab133663?sid=79dfbb51-42ef-4ae0-92e6-6e09240aba41\nGoogle sheet access:\nhttps://docs.google.com/spreadsheets/d/1axBTQ1Dmw4rA-yem_gGkhOAW44cj_DjGr-D5j5RQcg8/edit?usp=sharing<b>Skills</b>:        Google Sheets,                     Airtable            ","link":"https://www.upwork.com/jobs/Google-sheet-Airtable-Expert_%7E01269aec51ddf992be?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: February 27, 2024 19:09 UTC","id":"01269aec51ddf992be"},{"skillset":["NFT","Google Docs","Blockchain"],"title":"Blockchain, NFT and Google sheet specialist - Upwork","description":"We are looking to create a tracking and analytics dashboard in Google Sheets for a large amount of data.&nbsp;&nbsp;The objectives are to do the following....\n(1) Auto-sync holdings data from blockchain APIs (Ethereum, Solana, Polygon, etc)\n(2) Integrate with NFT marketplaces (OpenSea, Magic Eden, etc.) to pull floor prices, listed quantities, sales volumes, traits analysis\n(3) Track wallet balances of 200+ ERC-20 tokens, staking positions, liquidity pools (UniSwap, Curve)\n(4) Incorporate valuation estimates as created by the analyst\n(5) Custom overview page with charts for portfolio diversity, value distribution, 7/30 day performance\n(6) Holding tracker with sort/filter for quick analysis of different collections\n(7) Trading performance metrics page like ROI, profits vs. losses\n(8) Notification system for price alerts relative to targets\n(9) Scripts to automate daily/weekly captures and reporting\nFirst Task Requirement:\nPlease populate the following fields in Sheet 01a, Inventory:\nLink\nAcquisition Price\nDate\nBase Currency at the time of acquisition\nYou are required to go through each line item and fill in any missing information and validate existing entries. This task does not involve a &amp;quot;drag and drop&amp;quot; action. You must manually input the correct information for each line item.\nTo begin, please complete 30 items. I will audit the accuracy of your work. When entering the information, please use the color purple for your font.\nThank you for your assistance!\nhttps://docs.google.com/spreadsheets/d/1bCy-B2sPBVTJYd6UObZNF8iYqKdgbIH2zljokKCkh50/edit#gid=471211312\nhttps://join.slack.com/t/colt-mclaughlin/shared_invite/zt-2dljq9fv9-rHwtyXaMNlvKzc85wssrog <b>Skills</b>:        NFT,                     Google Docs,                     Blockchain            ","link":"https://www.upwork.com/jobs/Blockchain-NFT-and-Google-sheet-specialist_%7E016e5c6ef95e67f9bb?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: February 27, 2024 18:39 UTC","id":"016e5c6ef95e67f9bb"},{"skillset":["R","Finance","Web Scraping"],"title":"R code, scrape single web page, ticker symbol, return market cap and institutional holdings - Upwork","description":"Retrieve company list from this page: (link removed)\nConvert company list to stock ticker symbols. Modify company names as required to ensure complete return of ticker symbols.\nMake all queries from WRDS from here forward:\nTake list of ticker symbols and return stock prices for each, market cap, and total daily trading volume.\nI&#039;d also like total market cap for the entire portfolio.\nI&#039;d like annotations if any of the companies are listed in common stock indexes. \nReturn institutional holders for each of the companies on the list.\nIn a future iteration, I would like to host this on a public facing web page, but for the time being, making this work in R is satisfactory.<b>Skills</b>:        R,                     Finance,                     Web Scraping            ","link":"https://www.upwork.com/jobs/code-scrape-single-web-page-ticker-symbol-return-market-cap-and-institutional-holdings_%7E018b79de27c291c3d5?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: February 27, 2024 15:45 UTC","id":"018b79de27c291c3d5"},{"skillset":["AI Trading","Data Extraction","Data Mining","Data Scraping","Business Process Automation","Automation","Google Sheets Automation","API Integration","Robotic Process Automation"],"title":"Automate Quoting System with Existing Data &amp; Emails - Upwork","description":"Project Description:\nWe are seeking a skilled data analyst/programmer to develop an automated quoting system for our business.\nProject Objective:\nUtilize existing data from various sources (old quotes, emails, historical records)\nAnalyze and extract key information (pricing patterns, cost calculations, etc.)\nDevelop an automated system to generate accurate and competitive quotes based on user input\nIntegrate with existing workflows (optional)\nSkills &amp;amp; Experience Required:\nStrong data analysis skills (data cleaning, manipulation, and analysis)\nProficient in programming languages like Python or R (preferred)\nFamiliarity with data automation tools\nExcellent communication and documentation skills\nExperience integrating with existing systems (a plus)\nProject Scope:\nData analysis and pre-processing of existing data sources\nDevelopment and implementation of automated quoting system\nTesting and refinement of the system\nDocumentation of the process and ongoing support (optional)\nBudget:\nPlease indicate your hourly rate or project fee in your proposal.\nAdditional Information:\nWe are a small business looking for a long-term collaboration.\nWe are eager to work with someone who is passionate about data analysis and automation.\nPlease include relevant experience and portfolio links in your proposal.<b>Skills</b>:        AI Trading,                     Data Extraction,                     Data Mining,                     Data Scraping,                     Business Process Automation,                     Automation,                     Google Sheets Automation,                     API Integration,                     Robotic Process Automation            ","link":"https://www.upwork.com/jobs/Automate-Quoting-System-with-Existing-Data-amp-Emails_%7E010a690658aec8d637?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: February 27, 2024 13:49 UTC","id":"010a690658aec8d637"},{"skillset":["API Integration","NinjaTrader"],"title":"Copy Trader for Ninja Trading Platform - Upwork","description":"Need a copy trader on the Ninja Trading Platform \nBuilt as an indicator with a Master account and Slave Accounts\nCopy all aspects of a trade, must be able to copy buy limits, sell limits, market orders, and etc\nMust have the ability to easily change the master account if needed\nAbility to easily add individual slave accounts\nMonitor balances, profits and trade executions so we can track all accounts are making profit and trades are executing accurately for all\nUse the Machine ID&#039;s to manage access\nContinued support as we stress test the final product before release<b>Skills</b>:        API Integration,                     NinjaTrader            ","link":"https://www.upwork.com/jobs/Copy-Trader-for-Ninja-Trading-Platform_%7E01e62a2cb89924675e?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: February 27, 2024 02:04 UTC","id":"01e62a2cb89924675e"},{"skillset":["Python"],"title":"Build a Stock market Scanner - Upwork","description":"The stock market scanner is a cloud-based application designed to scan the US stock market. It fetches end-of-day data for all US market stocks from a data provider&rsquo;s API and stores this data in a database. The application then performs custom calculations on this data to generate specific in-house indicators. These indicators are used to analyze the stock market and identify potential investment opportunities. The results of these analyses, which can be filtered based on various criteria, are published on a web page.<b>Skills</b>:        Python            ","link":"https://www.upwork.com/jobs/Build-Stock-market-Scanner_%7E0182e8005e832fa936?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: February 26, 2024 18:52 UTC","id":"0182e8005e832fa936"},{"skillset":["JSON","XML","Neo4j"],"title":"Parse Json and XML files into NEO4J database - Upwork","description":"Please apply only if you can 2 full days of work this week. \nNeed someone to download the following file https://www.ecfr.gov/current/title-12 into a Neo4J deatabase, then download and parse the following file https://www.ecfr.gov/api/versioner/v1/full/2024-02-21/title-12.xml?part=1002, and attach/match it to the hierarchy file (the first file).\nIf successful, we will keep doing this with other files. \nMust have Neo4J experience, must have data parsing and matching experience. <b>Skills</b>:        JSON,                     XML,                     Neo4j            ","link":"https://www.upwork.com/jobs/Parse-Json-and-XML-files-into-NEO4J-database_%7E010f399c86288cbe73?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: February 26, 2024 08:37 UTC","id":"010f399c86288cbe73"},{"skillset":["Linux","R","R Shiny","Python","Pipenv","RStudio"],"title":"Shinny app with Python reticulate - Deployment to RStudio Connect - Upwork","description":"I work in a Shiny R app which is developed from RStudio and periodically re-deployed to RStudio Connect.\n** I have plots built with plotly. Not ggplot to ggplotly chain, but pure plotly.\n** I&#039;m trying to enable exporting of those plotly plots as static .png files.\n** From RStudio, I was able to make it work using the save_image() function. It required the installation of the reticulate R package and the kaleido python package as indicated in the CRAN documentation for the save_image() function.\n** When I try to deploy to RStudio Connect, I get the following error and the deployment breaks:\n----------------------\nError: \n* Error detecting python environment: Error during pip freeze:\n&nbsp;&nbsp;/usr/bin/python3: No module named pip\nExecution halted\n----------------------\nI do not have enough knowledge in terminal operation and python environment setting up to have this resolved myself. I need help making the deployment work.\nPlease note that this Shiny app is part of the company I work for and the server where I&#039;m trying to deploy hosts a number of important applications. I&#039;d thus need for this work someone who knows exactly what they are doing. There is no margin to test and break things.\nPlease let me know what experience you have on this topic and how much you would charge for this work.\nThanks.<b>Skills</b>:        Linux,                     R,                     R Shiny,                     Python,                     Pipenv,                     RStudio            ","link":"https://www.upwork.com/jobs/Shinny-app-with-Python-reticulate-Deployment-RStudio-Connect_%7E01acf60ec4f25dfbb0?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: February 25, 2024 22:22 UTC","id":"01acf60ec4f25dfbb0"},{"skillset":["Kubernetes","R Shiny","DigitalOcean","Load Balancing","DevOps"],"title":"Deploy R Shiny app to DigitalOcean Kubernetes and Load Balancer - Upwork","description":"Hi! I want to deploy an R Shiny app to DigitalOcean and use Kubernetes and a Load Balancer to distribute traffic. I have containerized the app and need help with just configuring the deployment correctly. <b>Skills</b>:        Kubernetes,                     R Shiny,                     DigitalOcean,                     Load Balancing,                     DevOps            ","link":"https://www.upwork.com/jobs/Deploy-Shiny-app-DigitalOcean-Kubernetes-and-Load-Balancer_%7E0168c7f200d11552a0?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: February 24, 2024 14:58 UTC","id":"0168c7f200d11552a0"},{"skillset":["Python","API Integration","Web Application","Amazon Web Services","Data Analysis","Statistics"],"title":"Stats  - Upwork","description":"I am looking for a talented full-stack developer to build a website similar to OP.gg, leveraging the data available through the League of Legends API. The design for the website will be provided, and we are looking for a developer who can bring it to life with functionality and performance.\nRequirements:\nProficiency in Python and experience with Python-based web frameworks (e.g., Django, Flask).\nFamiliarity with front-end technologies such as HTML, CSS, and JavaScript, along with relevant frameworks (e.g., React, Vue.js).\nStrong understanding of RESTful APIs and experience integrating third-party APIs.\nExperience with database systems like PostgreSQL, MySQL, or MongoDB.\nPrevious experience working with gaming APIs or developing esports-related applications is a PLUS.\nKnowledge of DevOps practices and experience deploying web applications to cloud platforms (e.g., AWS, Azure, Google Cloud).\nIf you&#039;re passionate about gaming and have the skills to bring this project to life, we&#039;d love to hear from you!<b>Skills</b>:        Python,                     API Integration,                     Web Application,                     Amazon Web Services,                     Data Analysis,                     Statistics            ","link":"https://www.upwork.com/jobs/Stats_%7E01c90e26b2d8d9a731?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: February 23, 2024 22:03 UTC","id":"01c90e26b2d8d9a731"},{"skillset":["Data Analysis","Bioinformatics","Executive Support","R","Academic Writing","Python","Exploratory Data Analysis","Genomic Data Analysis","Statistical Analysis","Coursework Assignment","Machine Learning","Multivariate Statistics","Microbiology","Data Engineering","Data Science"],"title":"ML developer - Upwork","description":"I have ml model and i want to retrain model. have <b>Skills</b>:        Data Analysis,                     Bioinformatics,                     Executive Support,                     R,                     Academic Writing,                     Python,                     Exploratory Data Analysis,                     Genomic Data Analysis,                     Statistical Analysis,                     Coursework Assignment,                     Machine Learning,                     Multivariate Statistics,                     Microbiology,                     Data Engineering,                     Data Science            ","link":"https://www.upwork.com/jobs/developer_%7E01c4b16d221bf46a8c?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: February 23, 2024 17:07 UTC","id":"01c4b16d221bf46a8c"},{"skillset":["API","Python","API Development"],"title":"Engineer help needed for a project with Zillow API - Upwork","description":"I am looking to replicate this application- https://www.youtube.com/watch?v=W0U87rZ5XBI\n- User uploads a list of addresses using a CSV\n- Application is connected to Zillow API (https://www.zillowgroup.com/developers/) and finds the &amp;quot;zestimate&amp;quot; for each property and insert them it into the CSV that is then downloaded <b>Skills</b>:        API,                     Python,                     API Development            ","link":"https://www.upwork.com/jobs/Engineer-help-needed-for-project-with-Zillow-API_%7E01503d8c017e6a4215?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: February 23, 2024 03:06 UTC","id":"01503d8c017e6a4215"},{"skillset":["Research Papers","Academic Research","Academic Writing","Mathematics"],"title":"Science Research and theory authentication and validation  - Upwork","description":"\nWe are seeking a highly meticulous individual with a strong background in physics, and preferably biology and chemistry, to join our team as a Scientific Article Validator and Verifier. The primary responsibility of this role is to read and analyze scientific articles, ensuring the accuracy and validity of the findings, equations, and methodologies presented.\nResponsibilities:\n1. Read and comprehend scientific articles covering topics in physics, biology, and potentially chemistry.\n2. Verify the accuracy of experimental methodologies, results, theories and equations presented in the articles.\n3. Cross-reference findings with existing literature and ensure consistency with established scientific principles.\n4. Identify any discrepancies, errors, or inconsistencies in the articles and provide detailed feedback.\n5. Collaborate with researchers and scientists to resolve any ambiguities or discrepancies found during the validation process.\n6. Maintain up-to-date knowledge of advancements and developments in the relevant scientific fields.\nRequirements:\n1. Bachelor&#039;s degree or higher in physics, biology, chemistry, or a related field.\n2. Strong understanding of scientific principles and methodologies.\n3. Ability to interpret and analyze complex scientific literature.\n4. Excellent attention to detail and critical thinking skills.\n5. Effective communication skills, both written and verbal.\n6. Experience with scientific research and literature review preferred.\nThis is a remote position with flexible hours. If you have a passion for scientific inquiry and a keen eye for detail, we encourage you to apply. Please submit your resume and a cover letter outlining your relevant experience. <b>Skills</b>:        Research Papers,                     Academic Research,                     Academic Writing,                     Mathematics            ","link":"https://www.upwork.com/jobs/Science-Research-and-theory-authentication-and-validation_%7E0133a7e691ca9f3e50?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: February 23, 2024 02:05 UTC","id":"0133a7e691ca9f3e50"},{"skillset":["Stata","LaTeX","R"],"title":"Research Associate - Upwork","description":"The project involves a research at the intersection of fintech and climate.<b>Skills</b>:        Stata,                     LaTeX,                     R            ","link":"https://www.upwork.com/jobs/Research-Associate_%7E01fef4ca4aedbe247e?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: February 22, 2024 16:38 UTC","id":"01fef4ca4aedbe247e"},{"skillset":["AWS Lambda","Docker","API","R"],"title":"Implement stable API-solution for R function - Upwork","description":"Hi,\nwe have an R script / function that is currently implemented as an API via R plumber and runs on a VPS. However, this solution is not stable and prone to problems likely related to the server itself, plumber and/or memory issues in R with the future package. \nSince the code runs fine locally, we would like to find a more stable implementation as API, e.g. dockerization + AWS lambda. \nThe following points need to be considered:\n- computation time for each request is approx. 15 mins, sometimes more\n- multiple requests can occu rin a short time period\n- there has to be a simple process to update the function code<b>Skills</b>:        AWS Lambda,                     Docker,                     API,                     R            ","link":"https://www.upwork.com/jobs/Implement-stable-API-solution-for-function_%7E011d417e254502b7f5?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: February 22, 2024 12:28 UTC","id":"011d417e254502b7f5"},{"skillset":[],"title":"Looking for Data Specialist (Spanish Speaking) - Upwork","description":"Responsibilities: As a Data Specialist, you will be responsible for managing and maintaining our clients&#039; data to ensure accuracy, integrity, and timeliness. You will collaborate with a team of data analysts, engineers, and business stakeholders to identify data-related issues and develop solutions. Your responsibilities will include:\nConducting data quality assessments and ensuring accuracy and integrity of the data.\nCleaning and transforming large datasets for analysis.\nDeveloping data structures and database schemas.\nCollaborating with cross-functional teams to identify data-related issues and develop solutions.\nStaying updated on industry trends and new data management tools and techniques.\nRequirements:\n1+ years of experience in data management or a related field.\nProficiency in SQL and data management tools such as Excel, Access, or Google Sheets.\nExperience in creating reports using technologies like R-Markdown and Power BI.\nExperience with data cleaning and transformation tools using programming languages like R/Python.\nStrong communication skills and ability to work with non-technical stakeholders.\nAbility to work independently and in a team.\nStrong problem-solving skills and attention to detail.\nSolid knowledge of the Spanish language.\nIf you believe that your skills and expertise align with the requirements of this position, please send us your CV for review. Additionally, if you have a portfolio or examples of previous work, we would be interested in seeing them. We are eager to assess your qualifications and establish a cooperative relationship as soon as possible.\nWe look forward to hearing from you.","link":"https://www.upwork.com/jobs/Looking-for-Data-Specialist-Spanish-Speaking_%7E01a13ddf185a674cac?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: February 22, 2024 03:53 UTC","id":"01a13ddf185a674cac"},{"skillset":["Python","SQL","Ruby on Rails","Ruby","React","API","Solana"],"title":"Ruby on Rails/React Developer for Robotics Company - Upwork","description":"Our consumer robotics company is looking for a talented backend developer to support our existing team as we are scaling our operations to cater to a growing userbase. We are looking for someone to join as a freelancer for 4-12 weeks while we search for a full-time hire. The selected freelancer will be eligible for the full-time role if they are interested and the freelance period is successful. \nYou will be working with the direction of a senior backend developer to maintain and develop the RoR backend, and there will be a lot of interfacing with the React front end. A lot of the work will be developing RESTful APIs with best practices with regards to safety and stability. <b>Skills</b>:        Python,                     SQL,                     Ruby on Rails,                     Ruby,                     React,                     API,                     Solana            ","link":"https://www.upwork.com/jobs/Ruby-Rails-React-Developer-for-Robotics-Company_%7E0137ddda4dfc36551b?source=rss","processedDate":"2024-03-18T20:19:18.248Z","postedDate":"<b>Posted On</b>: February 22, 2024 01:05 UTC","id":"0137ddda4dfc36551b"},{"skillset":["API Integration","Python","Ecommerce Development Consultation","Software Architecture &amp; Design"],"title":"Oxylabs - create a data model and fill it by code - Upwork","description":"You will work with an experience team of developers which will help you to achieve the following: \nCreate a universal data model:\nThe data model should be able to store the results from the Amazon API: \nUse Oxylabs https://oxylabs.io/ API to fill the data model\nEnd points:\nSearch\nProduct\nPricing\nReviews\nSellers\nHave an interface which can filter certain criteria from the data model or populate a data set.<b>Skills</b>:        API Integration,                     Python,                     Ecommerce Development Consultation,                     Software Architecture &amp; Design            ","link":"https://www.upwork.com/jobs/Oxylabs-create-data-model-and-fill-code_%7E01c293d4c67c9b6d5d?source=rss","processedDate":"2024-03-18T20:19:18.249Z","postedDate":"<b>Posted On</b>: February 21, 2024 13:50 UTC","id":"01c293d4c67c9b6d5d"},{"skillset":["Selenium","Python","Automation","Bot Development","Scripting"],"title":"Develop simple python automation bot - Upwork","description":"Develop a python BOT&nbsp;&nbsp;that&#039;ll run on Windows AWS virtual machine.\nBot should claim bonus every 4 hours, and &#039;spinwheelbonus&#039; every 24 hours.\nThere are 16 accounts for it to cycle through every 4 hours.\nVideo showing what bot should do (In the vid I didn&#039;t click the bonus buttons to keep them valid for testing...): \nhttps://streamable.com/28r44a<b>Skills</b>:        Selenium,                     Python,                     Automation,                     Bot Development,                     Scripting            ","link":"https://www.upwork.com/jobs/Develop-simple-python-automation-bot_%7E01f33db7406fb7fb72?source=rss","processedDate":"2024-03-18T20:19:18.249Z","postedDate":"<b>Posted On</b>: February 21, 2024 09:00 UTC","id":"01f33db7406fb7fb72"}]