[{"skillset":["Kajabi","Website Customization"],"title":"Expert Web Developer Needed: Enhance Font Implementation on Kajabi Platform - Upwork","description":"We are searching for a web developer proficient in Kajabi platform customization to assess and make changes to our current custom font implementation.\nThe task involves making crucial adjustments to guarantee consistency and coherence across our Kajabi account.\nOur primary aim is to seamlessly transition all font styles to default Kajabi fonts, while integrating custom fonts on several designated landing pages.\nCURRENT STATUS\nRight now we currently have custom code added within our Kajabi account for Headings, subheadings, and body fonts. Thus, these fonts are applying to ALL assets within our Kajabi site: main website pages (library, login, products, etc.) as well as all landing pages.\nWe only need custom fonts on 11 landing pages and instead we need default fonts on ALL other sites.\nWHAT WE NEED\nWe need eleven landing pages to have custom fonts &mdash; we need the integrity of the existing design w/ these fonts to stay in-tact. These pages SHOULD NOT be changed. If uploading custom code just into these individual pages, that&rsquo;s fine, but we need them to look the same as before removing the main fonts.\nWe then need the ability to use Kajabi&rsquo;s DEFAULT fonts on all Website pages and all future landing pages.\nWHAT WE ENVISION\nWe think this may be as simple as removing the existing code of the custom fonts and then RE-uploading those same exact fonts back in to the three individual websites that need the custom fonts.\nFrom there, since the main custom code was removed from our Kajabi site, then we could begin using the default fonts moving forward.\nSUMBIT ANSWERS TO THE FOLLOWING QUESTIONS:\n1. Are you clear on the solution we&rsquo;re seeking? If yes, please briefly summarize below.\n2. If removing coded fonts from the website and then into individual landing pages, how confident are you that you can keep the current design of the landing pages that need custom fonts?\n3. How quickly can you fix this for us?\nWhat additional information will you need from me to complete this?<b>Skills</b>:        Kajabi,                     Website Customization            ","link":"https://www.upwork.com/jobs/Expert-Web-Developer-Needed-Enhance-Font-Implementation-Kajabi-Platform_%7E0170f93df20ac80923?source=rss","processedDate":"2024-03-18T20:19:32.270Z","postedDate":"<b>Posted On</b>: March 18, 2024 19:50 UTC","id":"0170f93df20ac80923"},{"skillset":[],"title":"Setting up New Music Site - Upwork","description":"I prefer to discuss your needs to start, hear basic mix.\nFile delivery - Protools session or all session files complete (FROM 0 ), .WAV / AIFF file format.\nAll session file uploads / downloads via Dropbox pro \nsession files as well as mixes will be listened to via dropbox.\nFinal Wave Mix / Master delivered after payment","link":"https://www.upwork.com/jobs/Setting-New-Music-Site_%7E013e71402971c44a64?source=rss","processedDate":"2024-03-18T20:19:32.270Z","postedDate":"<b>Posted On</b>: March 18, 2024 18:44 UTC","id":"013e71402971c44a64"},{"skillset":["Blockchain","JavaScript","Ethereum"],"title":"Looking for a web3 consultant w/ Blockchain Dev experience - Upwork","description":"Finish a project that ran over. Requirements have changed due to nature of the project. Looking for this to just be completed.<b>Skills</b>:        Blockchain,                     JavaScript,                     Ethereum            ","link":"https://www.upwork.com/jobs/Looking-for-web3-consultant-Blockchain-Dev-experience_%7E01033bbe211489f0b1?source=rss","processedDate":"2024-03-18T20:19:32.270Z","postedDate":"<b>Posted On</b>: March 18, 2024 16:20 UTC","id":"01033bbe211489f0b1"},{"skillset":["UX &amp; UI","Style Guide","Website Redesign","Figma","WordPress","Canva","Web Design","Graphic Design"],"title":"Seeking Talented Front-End Designer w/ UI/UX skills for Pilot Project &amp; Potential Collaboration - Upwork","description":"Introduction:\nNAV43 is a leading digital agency specializing in SEO, Paid Media and CRO. We are in need of a&nbsp;&nbsp;a talented front end designer with ui/ux skills to refine our website&#039;s front-end design. As we approach the final stages of our design process, we&#039;re seeking expertise to ensure our brand vision is effectively translated into the user experience. Our primary challenge lies in aligning copy with a visual system to enhance conversions and updating the user interface to reflect our brand positioning.\nProject Overview:\nWe&#039;re looking for a talented front end designer with UI/UX skills to collaborate on a pilot project of elevating a current wireframe for a &amp;quot;Free Assessment&amp;quot; offer to align with brand standards and drive leads. This project will then assess the ability of the designer to move forward with the remaining design of the full website which is a larger project. \nProject Details:\n- Review low/high-fidelity wireframes and project briefs and update the provided wireframe.\n- Enhance components, UI, provide animation recommendations, graphics, and other elements.\n- Adjust UI, icons, imagery, etc., to meet project goals.\n- CANNOT adjust colour palette or fonts.\n- Pilot project precedes a larger agency site redesign.\nDeliverables:\n- Redesigned Offer Page \nAdditional Information:\n- Resources available upon agreement, including Google Doc&nbsp;&nbsp;\n- Briefs/Copy and wireframes.\n- Reference sites provided for inspiration.\n- Potential for ongoing collaboration on the larger agency site redesign.\nHow to Apply:\nIf you&#039;re a talented designer passionate about crafting exceptional user experiences, we want to hear from you. Please submit your proposal including:\n- Relevant experience.\n- Portfolio showcasing previous work.\n- Brief overview of your design process and approach.\n- Cost estimate for the initial pilot page redesign.\n- Availability and estimated timeline for completing this pilot project. This can proceed immediately. \n- Following the successful completion of the pilot, we&#039;ll discuss estimates for a larger agency site redesign.\nEvaluation Criteria:\n- Creativity and quality of previous design work.\n- Understanding of project requirements and ability to meet tight timelines.\n- Cost-effectiveness of proposal.\n- Respect for confidentiality and intellectual property rights.\nOther Details:\n- Hourly commitment: Less than 30 hrs/week\n- Pilot Project Length: 1 week\n- Experience Level: Intermediate/Expert\n- Hourly Rate: $35-60<b>Skills</b>:        UX &amp; UI,                     Style Guide,                     Website Redesign,                     Figma,                     WordPress,                     Canva,                     Web Design,                     Graphic Design            ","link":"https://www.upwork.com/jobs/Seeking-Talented-Front-End-Designer-skills-for-Pilot-Project-amp-Potential-Collaboration_%7E0169834aa625243840?source=rss","processedDate":"2024-03-18T20:19:32.270Z","postedDate":"<b>Posted On</b>: March 18, 2024 15:52 UTC","id":"0169834aa625243840"},{"skillset":["WordPress","Web Development","PHP","CSS","JavaScript","HTML"],"title":"Wordpress Expert - Upwork","description":"We are looking for someone who can help us update and maintain our wordpress website built in Divi. We pay by the hour for most projects. but we always start with a trial to test your knowledge. \nSome of the tasks are simple such as updated content . upgrading and installing plugins. and adding pages. \nAs a&nbsp;&nbsp;trial for long term work, we will test your ability and time it takes to quote adding a page that mimics our stanwith.me link tree. You can see the link tree here. stanwith.me/savvyrickbrown \nTo be short listed. You will provide a quote and tell us the time it takes for the task described above. Also start your bid with JOB ID&amp;quot;2185W&amp;quot; otherwise we assume you are a bot or are can&#039;t follow simple instructions.<b>Skills</b>:        WordPress,                     Web Development,                     PHP,                     CSS,                     JavaScript,                     HTML            ","link":"https://www.upwork.com/jobs/Wordpress-Expert_%7E01e4a4a7b7b89574bf?source=rss","processedDate":"2024-03-18T20:19:32.270Z","postedDate":"<b>Posted On</b>: March 18, 2024 11:28 UTC","id":"01e4a4a7b7b89574bf"},{"skillset":["Ecommerce Storefront Design","Ecommerce Website","Shopify","Web Development","CSS","Web Design","HTML","JavaScript","Shopify Templates"],"title":"Looking For A Talented Shopify Developer - Upwork","description":"We are looking for a developer to help us build our initial MVP Shopify website for a new brand we are launching soon. We purchased a paid theme called eComus that we want to use. It has all of the features that we need included.\nWe also have wireframes of the initial pages available for you so that you know exactly what we&#039;re looking for as far as layout goes.\nLong story short, we need a developer who can come in, look over the wireframes, get the theme setup, and build the 4 pages that we need. As well as implement the functionality we need.\nHere are the specifics:\nPAGES TO BE BUILT\n--Home\n--Product Details Page (Template)\n--Cart Page\n--Contact\nPRODUCT PAGE FUNCTIONALITY (From eComus)\n--Free Shipping Bar\n--Linked Products\n--Volume Auto-Discount\n--Pre-Orders\n--Coupon Exit Pop w/ Recommended Products\n--Countdown Timer\nPRODUCT PAGE FUNCTIONALITY (Custom)\n--Production &amp;amp; Shipping Timeline Per Product - We need to build custom fields that will allow us to add the Production &amp;amp; Shipping Timeline to each product to have these dates added to the product page for each product.\nOther than that, we need to set up the basics like Email &amp;amp; SMS Marketing, likely through Klaviyo, as well as a few other apps like Loox, etc. Also, we want to implement a custom illustrated background that goes with our branding across the entire website. We already have the assets to implement this.\nWe are looking to use this initial project as a test run to ideally find a long-term developer that we can work with on the site over time as we build it out more and more.\nWe don&#039;t expect this job to take longer than 5-10 hours at most. If you&#039;re going to try to quote us 15-20+ hours for this job, you can save your connects. I know if I was to do this job myself, it would only take me 10-15 hours, and I am NOT a full-time developer, so a full-time developer should be able to get the job done much faster than me.\nIf you&#039;re interested in taking on this project and becoming our long-term developer, please send over a Cover Letter with your portfolio and details about your experience. We will be setting up interviews this week and likely hiring this week as well.<b>Skills</b>:        Ecommerce Storefront Design,                     Ecommerce Website,                     Shopify,                     Web Development,                     CSS,                     Web Design,                     HTML,                     JavaScript,                     Shopify Templates            ","link":"https://www.upwork.com/jobs/Looking-For-Talented-Shopify-Developer_%7E01398c0b2a3e026fa2?source=rss","processedDate":"2024-03-18T20:19:32.270Z","postedDate":"<b>Posted On</b>: March 18, 2024 02:09 UTC","id":"01398c0b2a3e026fa2"},{"skillset":["Communications","Customer Support","Email Communication"],"title":"Phuket Assistant Needed (must live in Phuket) - Upwork","description":"I&#039;m moving from the US to Phuket (arriving on April 4) and am looking for a place to live for a few months. \nI have found 2 possible places to rent:\n- Oceana Kamala (9, W7WH+MGM 199 Moo 6 Kamala, Kathu District, Phuket 83110)\n- The Base Uptown Condo (155 Chalermprakiat Ratchakan Thi 9 Road, Ratsada, Mueang Phuket District, Phuket 83000)\nI want to hire someone to visit both places to determine which is better based on:\n- Size and layout \n- Cleanliness\n- Bathroom \n- Kitchen \n- View \n- Quietness \n- Building \n- Neighborhood \nAfter your visit, I&#039;d like an email with the info and I&#039;d like a video walkthrough of both units (mostly so I can see the view from the balconies).\nSince I&rsquo;m leaving the US in 2 weeks, I&rsquo;d like your visit to happen in the next few days or week.\nI also may want to hire you to assist me with opening a bank account or with grocery shopping or immigration visa questions.\nThank you.<b>Skills</b>:        Communications,                     Customer Support,                     Email Communication            ","link":"https://www.upwork.com/jobs/Phuket-Assistant-Needed-must-live-Phuket_%7E01915923706c98455d?source=rss","processedDate":"2024-03-18T20:19:32.270Z","postedDate":"<b>Posted On</b>: March 17, 2024 21:31 UTC","id":"01915923706c98455d"},{"skillset":["Ecommerce Website","Search Engine Optimization","WordPress","SEO Keyword Research","Landing Page"],"title":"Digital Product Ecommerce w/ SEO and Marketing Widgets - Upwork","description":"Project Title: Digital Services Website Development\nIntroduction:\nWe are seeking proposals from qualified website development firms to design, develop, and deploy a responsive website for selling digital services.\nProject Scope:\nThe selected vendor will be responsible for the following:\nDesigning and developing a user-friendly, responsive website that showcases our digital services effectively.\nIntegrating payment gateways for seamless transactions.\nImplementing best practices for social media marketing, Google PPC marketing, and remarketing.\nCreating an email drip campaign aspect for customer engagement and retention.\nCreate a lead capture through an email magnet offer\nEnsuring SEO friendliness to enhance online visibility and organic traffic.\nWebsite Requirements:\nThe website should include but not limited to the following features:\nUser-friendly interface for easy navigation and seamless user experience.\nSecure login and registration functionalities for users.\nProduct pages for each service offered, including detailed descriptions and pricing.\nIntegration of payment gateways (e.g., PayPal, Stripe) for secure online transactions.\nResponsive design optimized for various devices and screen sizes.\nSocial media integration for sharing and engagement.\nBlog section for content marketing and SEO purposes.\nCustomer support/contact form for inquiries and assistance.\nIntegration of analytics tools for tracking website performance and user behavior.\nIf you are a talented Website Developer looking for an opportunity to create a dynamic and impactful website for our company, we would love to hear from you. Please submit your resume and portfolio showcasing your web development skills and experience.<b>Skills</b>:        Ecommerce Website,                     Search Engine Optimization,                     WordPress,                     SEO Keyword Research,                     Landing Page            ","link":"https://www.upwork.com/jobs/Digital-Product-Ecommerce-SEO-and-Marketing-Widgets_%7E01d8b8366b6b9da612?source=rss","processedDate":"2024-03-18T20:19:32.270Z","postedDate":"<b>Posted On</b>: March 17, 2024 20:27 UTC","id":"01d8b8366b6b9da612"},{"skillset":["WordPress","Web Development","PHP","CSS","JavaScript","HTML"],"title":"Wordpress Expert - Upwork","description":"We are looking for someone who can help us update and maintain our wordpress website built in Divi. We pay by the hour for most projects. but we always start with a trial to test your knowledge. \nSome of the tasks are simple such as updated content . upgrading and installing plugins. and adding pages. \nAs&nbsp;&nbsp;trial for long term work, we will test your ability and time it takes to quote adding a page that mimics our stanwith.me link tree. You can see the link tree here. stanwith.me/savvyrickbrown \nTo be short listed. You will provide a quote and tell us the time it takes for the task described above. Also start your bid with JOB ID&amp;quot;2185W&amp;quot; otherwise we assume you are a bot or are can&#039;t follow simple instructions.<b>Skills</b>:        WordPress,                     Web Development,                     PHP,                     CSS,                     JavaScript,                     HTML            ","link":"https://www.upwork.com/jobs/Wordpress-Expert_%7E01f273b850fedce7a4?source=rss","processedDate":"2024-03-18T20:19:32.270Z","postedDate":"<b>Posted On</b>: March 17, 2024 13:48 UTC","id":"01f273b850fedce7a4"},{"skillset":["Social Media Management","Social Media Marketing","Facebook","Instagram","Instagram Story"],"title":"Social media manager - Upwork","description":"Social media manager needed to manage our content across multiple platforms . We are going to use repurpose.io to schedule our content. Your job is to add content to our repurpose.io account and help grow all of our social accounts by engaging with other accounts . This is a long term assignment . \nYou are not going to create content . \nTo be considered . Propose an hourly rate and your proposal should include an estimate of hours you will spend each week managing our accounts and content . \nAlso start your bid with JOB ID&amp;quot;2185W&amp;quot; otherwise we assume you are a bot or are can&#039;t follow simple instructions. <b>Skills</b>:        Social Media Management,                     Social Media Marketing,                     Facebook,                     Instagram,                     Instagram Story            ","link":"https://www.upwork.com/jobs/Social-media-manager_%7E017c8ddb78be65e6e0?source=rss","processedDate":"2024-03-18T20:19:32.270Z","postedDate":"<b>Posted On</b>: March 17, 2024 12:36 UTC","id":"017c8ddb78be65e6e0"},{"skillset":["MySQL","PHP","C#",".NET Framework","AngularJS","Reactive Programming","English"],"title":".Net C# Software Engineer w/ Angular Experience - Upwork","description":".Net C# Software Engineer w/ Angular Experience.\nWe need a .Net engineer with a good background in Bootstrap and Angular 6+. We&#039;re developing a website for running sports tournaments, and have a tight deadline.\nThe engineer that we select will need to have impeccable English skills, and the ability to work from 8am - 12pm US Mountain Time.\nThe project is partially completed, and involves the Mediator pattern on the backend, with Observable State Services on the front end.\nWe will be conducting interviews for this job, and we will be looking for candidates that meet the following requirements.\n- At least 19 years old.\n- Speaks fluent English.\n- C# .Net 6+ Experience\n- Angular 6+ Experience\n- Understanding of Reactive Programming.\n- Able to use the Mediator Pattern.\n- Able to code to SOLID Principles.\n- Willing to be online in a meeting from 8am - 12pm Mon-Fri US Mountain Time.\nPlease Apply to Interview after taking the following Skills Assessments. You will need to show screenshots of your scores during the interview.\nhttps://app.pluralsight.com/skilliq/angular-15/intro?context=skills\nhttps://app.pluralsight.com/skilliq/c-sharp/intro?context=skills<b>Skills</b>:        MySQL,                     PHP,                     C#,                     .NET Framework,                     AngularJS,                     Reactive Programming,                     English            ","link":"https://www.upwork.com/jobs/Net-Software-Engineer-Angular-Experience_%7E017b4160cc618a7403?source=rss","processedDate":"2024-03-18T20:19:32.270Z","postedDate":"<b>Posted On</b>: March 16, 2024 23:31 UTC","id":"017b4160cc618a7403"},{"skillset":["NFT Marketplace"],"title":"Dev for Solana NFT drop. Experience w Arweave &amp; Mirrorworld preferred - Upwork","description":"Doing a small nft art drop on Solana (bigger eth drop immediately after) to promo a music release. Need someone to set up the collection (upload files, metadata, etc) and integrate mint and download hi-res file functions on the website. \nideally using arweave and mirrorworld because i&#039;m more familiar with those, but flexible if you recommend a better one.\nif this goes well, will use you for all subsequent drops as well. the eth one coming a few days after. \nplease, include a few words on your past experience with nft drops. thank you.<b>Skills</b>:        NFT Marketplace            ","link":"https://www.upwork.com/jobs/Dev-for-Solana-NFT-drop-Experience-Arweave-amp-Mirrorworld-preferred_%7E012613555efb7151ce?source=rss","processedDate":"2024-03-18T20:19:32.270Z","postedDate":"<b>Posted On</b>: March 16, 2024 12:25 UTC","id":"012613555efb7151ce"},{"skillset":["WooCommerce","WordPress","API Integration","Bitcoin"],"title":"Putting Electrum On New Laptop Using hardware Wallet (E-commerce Store connected via BTCPayServer) - Upwork","description":"Hello I currently have an old HP Laptop running Electrum that does not work as 2 Gigs of space is less. I have a ThinkPad I downloaded Electrum on, but have not proceeded. I have a seed phrase but heard that is not thebest way to restore a wallet. The wallet is also connected to woocommerce store and we only take bitcoin thru btcpayserver. I am looking for no down time and someone to set up electrum so my ledger nano so w cna continue receiving payments on my new thinkpad running windows 10. Please help!<b>Skills</b>:        WooCommerce,                     WordPress,                     API Integration,                     Bitcoin            ","link":"https://www.upwork.com/jobs/Putting-Electrum-New-Laptop-Using-hardware-Wallet-commerce-Store-connected-via-BTCPayServer_%7E01e37a1f4c44da95bb?source=rss","processedDate":"2024-03-18T20:19:32.270Z","postedDate":"<b>Posted On</b>: March 14, 2024 19:34 UTC","id":"01e37a1f4c44da95bb"},{"skillset":["WooCommerce","WordPress","Landing Page","Graphic Design","Marketing Strategy","Sales Copy"],"title":"Sales Landing Page Designer w proven ROI  - Upwork","description":"We are seeking a talented and experienced Sales Landing Page Designer to create a high-converting sales landing page using Divi and WooCommerce. The primary goal of this project is to design a sales-focused landing page that drives conversions and maximizes ROI. The ideal candidate will have a track record of creating successful sales landing pages, backed by proven conversion rates and ROI metrics. \n**Responsibilities:**\n- Design and develop a sales landing page using Divi and WooCommerce.\n- Optimize the landing page for maximum conversions and ROI.\n- Implement persuasive copywriting and compelling visual elements to drive sales.\n- Conduct A/B testing to optimize conversion rates.\n- Analyze performance metrics and make data-driven decisions to improve results.\n- Collaborate with the marketing team to align the landing page with overall marketing objectives and strategies.\n**Requirements:**\n- Proven experience in designing high-converting sales landing pages.\n- Proficiency in Divi and WooCommerce.\n- Strong understanding of conversion rate optimization (CRO) principles.\n- Excellent copywriting skills with the ability to craft compelling sales messages.\n- Experience with A/B testing and data analysis.\n- Strong portfolio showcasing past sales landing pages with documented conversion rates and ROI metrics.\n- Ability to work independently and meet deadlines.\n**Note:** Applicants must provide documented evidence of past sales landing pages they have created, along with conversion rates and ROI metrics. Candidates who cannot provide these statistics will not be considered. We are seeking individuals who prioritize sales results and have a demonstrated ability to deliver measurable outcomes.<b>Skills</b>:        WooCommerce,                     WordPress,                     Landing Page,                     Graphic Design,                     Marketing Strategy,                     Sales Copy            ","link":"https://www.upwork.com/jobs/Sales-Landing-Page-Designer-proven-ROI_%7E01260c718db6f8c444?source=rss","processedDate":"2024-03-18T20:19:32.270Z","postedDate":"<b>Posted On</b>: March 16, 2024 01:49 UTC","id":"01260c718db6f8c444"},{"skillset":["Software Design","App Design","Mockup","User Flow","Graphic Design","Mobile App Design"],"title":"Simple Software UX Design for Power Energy Device - Upwork","description":"Hi Designers,\nI need assistance completing an interface design for a device called a battery monitor used in systems that contain batteries like a solar off grid system. Used by people with RV&#039;s, Off grid house, caravans etc. \nIt will be displayed through a 5&amp;quot; and smaller (yet to be determined) touch screen. \nThis should be a relatively simple design. Its not to be war and peace. \nIt must be designed to be extremely simple to use/navigate and sleek.&nbsp;&nbsp;I have attached an example of a competitors products main screens.\nIt will be predominately used by males, above 40yrs.&nbsp;&nbsp;\nThere will be a main home screen showing the key information. \n2-3 data pages.\nA settings page with 10 or so inputs that can be updated on that page. \nSo all up 4-5 pages. Not that that much info to display. \nI will provide the key information that needs to be shown on the pages.\nIe. home page - Main Battery % &amp;amp; Voltage, Power flow A &amp;amp; W, Time remaining,&nbsp;&nbsp;Time, Sub shunt powerflows A &amp;amp; W, Settings button.\nLooking for some different, sleek but simple designs. Try to stand out against the competitors. \nPlease provide an estimate of cost.\nCheers\nZach<b>Skills</b>:        Software Design,                     App Design,                     Mockup,                     User Flow,                     Graphic Design,                     Mobile App Design            ","link":"https://www.upwork.com/jobs/Simple-Software-Design-for-Power-Energy-Device_%7E01b6b8c9cef21f9ade?source=rss","processedDate":"2024-03-18T20:19:32.270Z","postedDate":"<b>Posted On</b>: March 16, 2024 00:51 UTC","id":"01b6b8c9cef21f9ade"},{"skillset":["PSD to WordPress","Front-End Development","Website Redesign","Web Development","PHP","HTML","JavaScript","HTML5","WordPress","Responsive Design","CSS","API Integration","Website Optimization","Custom PHP","Elementor"],"title":"Wordpress Website Updates - Upwork","description":"I&#039;ll only need a few things for this website\n-Google Analytics are no longer working, we will need to update w/ plug in or another recommendation\n- Add two new pages that will be duplicate/template of other pages, just updating the copy and content. <b>Skills</b>:        PSD to WordPress,                     Front-End Development,                     Website Redesign,                     Web Development,                     PHP,                     HTML,                     JavaScript,                     HTML5,                     WordPress,                     Responsive Design,                     CSS,                     API Integration,                     Website Optimization,                     Custom PHP,                     Elementor            ","link":"https://www.upwork.com/jobs/Wordpress-Website-Updates_%7E014681384cb041a8d0?source=rss","processedDate":"2024-03-18T20:19:32.270Z","postedDate":"<b>Posted On</b>: March 15, 2024 17:30 UTC","id":"014681384cb041a8d0"},{"skillset":["Divi","CSS","WordPress","HTML5","CSS 3","Website","Elementor","WordPress Website","WordPress Installation","PSD to WordPress","WordPress Development","WordPress Optimization","WordPress Bug Fix","WordPress e-Commerce","WordPress Theme"],"title":"Wordpress Website Updates - Upwork","description":"I&#039;ll only need a few things for this website\n-Google Analytics are no longer working, we will need to update w/ plug in or another recommendation\n- Add two new pages that will be duplicate/template of other pages, just updating the copy and content. \nwww.designthinkingforhealth.org<b>Skills</b>:        Divi,                     CSS,                     WordPress,                     HTML5,                     CSS 3,                     Website,                     Elementor,                     WordPress Website,                     WordPress Installation,                     PSD to WordPress,                     WordPress Development,                     WordPress Optimization,                     WordPress Bug Fix,                     WordPress e-Commerce,                     WordPress Theme            ","link":"https://www.upwork.com/jobs/Wordpress-Website-Updates_%7E015b375bea930e816c?source=rss","processedDate":"2024-03-18T20:19:32.270Z","postedDate":"<b>Posted On</b>: March 15, 2024 17:29 UTC","id":"015b375bea930e816c"},{"skillset":["Python","Web Content Accessibility Guidelines"],"title":"Innovative Developer Needed for WCAG 1.4 Accessibility Compliance Automation in Documents - Upwork","description":"Project Description:\nWe are pioneering a project to enhance document accessibility across the board. This segment of the project aims to tackle the WCAG 1.4 Distinguishable guideline, focusing on enhancing document readability and accessibility by improving visual presentation and ensuring content is easily distinguishable for all users, including those with visual impairments.\nObjectives:\nDevelop an automated system to assess documents against the WCAG 1.4 Distinguishable criteria, ensuring content is easily visible and audible.\nCreate solutions that facilitate the detection of issues related to color usage, contrast ratios, text size, images of text, background audio, and text spacing.\nImplement features for automated suggestions and remediation to meet or exceed the minimum accessibility standards.\nGuideline Adaptation:\nIt is important to realize that some of the guideline definitions may need to be modified to make them more applicable to documents if this is necessary, mention what the change is and why it better accommodates documents. \nKey Features and Deliverables:\nAutomated detection of WCAG 1.4 compliance issues within documents, including insufficient contrast, improper use of color, inadequate text size, and incorrect text spacing.\nRecommendations for modifications or enhancements to ensure documents meet the WCAG 1.4 guidelines.\nA reporting tool that outlines detected issues and provides clear suggestions for improvements or corrections.\nIntegration with the broader Accessibility Project system for a cohesive accessibility improvement process.\nSkills and Experience Required:\nExpertise in AI/ML technologies, with a focus on image and text analysis.\nStrong background in accessibility standards, specifically familiarity with WCAG guidelines.\nProficiency in handling and manipulating document formats such as DOC, PPT, and PDF.\nExperience in developing software solutions that improve document accessibility and readability.\nMilestones:\nMilestone 1 (Deadline: Two weeks from contract initiation): Develop a software system capable of identifying key WCAG 1.4 compliance issues related to visual and auditory content presentation.\nDeliverable: A software prototype demonstrating initial detection capabilities.\nMilestone 2 (Deadline: One week after test case results recived): After initial submission testing of the solution will occur with test cases we have curated. We will return these tests and the results to you to help with refinement. Note this will be an iterative process so the timeline on this milestone is flexible.\nDeliverable: A software prototype demonstrating moderately accurate detection capabilities.\nMilestone 3 (Deadline: Will be added after detection is satisfactory): Enhance the system to offer automated remediation suggestions or corrections for identified issues, ensuring documents can be adjusted to comply with WCAG 1.4 guidelines. \nDeliverable: An enhanced system that generates detailed reports with remediation recommendations for various document types.\nBudget:\nPlease provide a detailed budget proposal for each milestone, reflecting the complexity of the project and your expertise.\nApplication Requirements:\nDetailed resume/CV, highlighting relevant projects and experience.\nPortfolio demonstrating previous work in software development with an emphasis on accessibility.\nA brief proposal outlining your approach to the project, including any preliminary ideas for tackling the specific challenges associated with WCAG 1.4 Distinguishable guidelines.\nEvaluation Criteria:\nDepth of technical expertise and experience with document accessibility challenges.\nQuality and relevance of portfolio projects, especially those related to accessibility improvements.\nClarity and innovativeness of the proposal in addressing WCAG 1.4 challenges.\nCompetitiveness of the budget, considering the scope and impact of the project.\nContact Information:\nApplications, including all required documents, should be submitted on Upwork.\nResources:\nhttps://www.w3.org/TR/WCAG22/<b>Skills</b>:        Python,                     Web Content Accessibility Guidelines            ","link":"https://www.upwork.com/jobs/Innovative-Developer-Needed-for-WCAG-Accessibility-Compliance-Automation-Documents_%7E01a8aa9cadef41b30e?source=rss","processedDate":"2024-03-18T20:19:32.270Z","postedDate":"<b>Posted On</b>: March 15, 2024 13:15 UTC","id":"01a8aa9cadef41b30e"},{"skillset":["WP Rocket","Gravity Forms","JavaScript","CSS","CSS 3","HTML","HTML5","German","WordPress","Search Engine Optimization","Avada Theme Customization","Web Design","Web Development","PHP","WordPress Development"],"title":"WordPress Webdesigner/Webdeveloper (deutschsprachig) - Upwork","description":"Ich suche nach einem erfahrenen WordPress Webdesigner, Webentwickler bzw. Webmaster (m/w), der mir hilft Kundenwebsites zu managen.\nWir verwenden ManageWP f&uuml;r Backups, Security Checks und Updates, aber im Endeffekt muss man die Websites immer manuell &uuml;berpr&uuml;fen.\nDamit meine ich \n- Updates (Dashboard, ManageWP)\n- Fehler nach Updates in PHP und JavaScript fixen (z.B. Avada Theme/Template Probleme)\n- Kleinere Anpassungen in Templates (PHP-Kenntnisse!)\n- Content online bringen\n- Content anpassen\n- Onpage SEO umsetzen\n- usw. \nWenn das nach einer interessanten T&auml;tigkeit klingt, freue ich mich &uuml;ber eine Bewerbung!<b>Skills</b>:        WP Rocket,                     Gravity Forms,                     JavaScript,                     CSS,                     CSS 3,                     HTML,                     HTML5,                     German,                     WordPress,                     Search Engine Optimization,                     Avada Theme Customization,                     Web Design,                     Web Development,                     PHP,                     WordPress Development            ","link":"https://www.upwork.com/jobs/WordPress-Webdesigner-Webdeveloper-deutschsprachig_%7E0137ca6cf5adcb6644?source=rss","processedDate":"2024-03-18T20:19:32.271Z","postedDate":"<b>Posted On</b>: March 15, 2024 10:27 UTC","id":"0137ca6cf5adcb6644"},{"skillset":["Web Development","Shopify","Web Design","HTML","WordPress","JavaScript","PHP","Ecommerce Website","HTML5","CSS"],"title":"Website Development Engineer(shopify/wordpress/shopline) - Upwork","description":"Working Hours: Normal working hours from 9:00 to 18:00, must be within a similar time zone to ensure daily communication(China)\nSalary: $800, negotiable\nResponsibilities:\n1.Responsible for responsive website development using platforms such as Shopline.\n2.Collaborate with the team in China to construct websites according to design drafts, ensuring timely delivery.\n3.Familiarize yourself with relevant documents and design drafts, implementing flexible coding for content replacement.\n4.Ensure the website construction aligns with design drafts, maintaining consistency.\n5.Adapt website content as needed\nRequirements:\n1.Proficient in Shopify, Wordpress, Shopline, and other website construction platforms, with extensive practical experience.\n2.In-depth understanding of responsive website development, capable of adapting to different device sizes.\n3.Excellent communication and teamwork skills, able to effectively communicate and collaborate with the team in China.\n4.Positive work attitude, strong sense of responsibility, able to complete tasks on time and with quality.\n5.Ability to independently solve problems and a willingness to continuously learn and improve technically.\nHere is design : https://drive.google.com/drive/folders/1wTvOp2vNgZOTqPEmZCqvPWeMiEMBtmS9?usp=sharing\nHow to Apply:\nPlease send your resume and relevant works (website development projects or related project experiences) to me. We will contact suitable candidates for interviews as soon as possible.<b>Skills</b>:        Web Development,                     Shopify,                     Web Design,                     HTML,                     WordPress,                     JavaScript,                     PHP,                     Ecommerce Website,                     HTML5,                     CSS            ","link":"https://www.upwork.com/jobs/Website-Development-Engineer-shopify-wordpress-shopline_%7E012ebbbdbea71ff2c3?source=rss","processedDate":"2024-03-18T20:19:32.271Z","postedDate":"<b>Posted On</b>: March 15, 2024 08:52 UTC","id":"012ebbbdbea71ff2c3"},{"skillset":["HTML","Web Design","CSS","Shopify","Web Development","HTML5","JavaScript"],"title":"IN NEED OF A SHOPIFY WEB DESGINER wHO KNOWS HTML  - Upwork","description":"hello sir, I have a html file with a custom font and scroll bar that I want turned directly into my Shopify page, can you help?<b>Skills</b>:        HTML,                     Web Design,                     CSS,                     Shopify,                     Web Development,                     HTML5,                     JavaScript            ","link":"https://www.upwork.com/jobs/NEED-SHOPIFY-WEB-DESGINER-wHO-KNOWS-HTML_%7E01235fb46a153c2fe8?source=rss","processedDate":"2024-03-18T20:19:32.271Z","postedDate":"<b>Posted On</b>: March 15, 2024 02:35 UTC","id":"01235fb46a153c2fe8"},{"skillset":["Website","Graphic Design","Web Design","Web Development","Wix","Website Asset","Adobe Illustrator","Adobe Photoshop"],"title":"Wix Website interface design/ graphic designer needed  - Upwork","description":"I need someone to redesign my wix website which will have three pages. A sales landing page a purchase page and a login page for people who have purchase the course which will take you to the course website \nThe visual style of the website needs to be in the style of the shortformsociety website attached but the content must include what&rsquo;s showing in the school of motion website which is also attached. There needs to be a sales video very close to the top of the page. \nCurrently I am just collecting emails but I need to create these 3 other pages so they&rsquo;re ready to go when the course is completed. The email collecting page will need to be in the same format as the short form society web page also with a sales video inserted \nPlease review attached screen recordings and let me know who can create the design elements and also implement this into the wix website \nhttps://we.tl/t-SWIQhT1lT2<b>Skills</b>:        Website,                     Graphic Design,                     Web Design,                     Web Development,                     Wix,                     Website Asset,                     Adobe Illustrator,                     Adobe Photoshop            ","link":"https://www.upwork.com/jobs/Wix-Website-interface-design-graphic-designer-needed_%7E01e4ba15b5e7b1df66?source=rss","processedDate":"2024-03-18T20:19:32.271Z","postedDate":"<b>Posted On</b>: March 15, 2024 01:28 UTC","id":"01e4ba15b5e7b1df66"},{"skillset":["Shopify","HTML","Graphic Design","Web Development","CSS"],"title":"I need a site replicated in shopify - Upwork","description":"Hello. Can you create a website like this:\nthenightsky.com. Check the editors it has. Night sky, moon map etc. Let me know if its doable \nI basically need these customisers as you see here\nhttps://create.thenightsky.com/the-night-sky-star-map?tnscc=GB&amp;amp;_gl=1*os80ba*_gcl_au*OTM5ODkyNDA0LjE3MTAzMzAwMDM.*_ga*MTkxODYxNTY3LjE3MTAzMzAwMDMwMzUuNjAuMC4wLjA.&amp;amp;_ga=2.612246\nCheck editors on this site too:\nhttps://www.revellia.com/\nClick on create posters and then check the editor options. Only contact me if you have done such work in the past and know how to deliver this. I need complete design and development from you including these images\nStart bid with apple so I know its read and understood<b>Skills</b>:        Shopify,                     HTML,                     Graphic Design,                     Web Development,                     CSS            ","link":"https://www.upwork.com/jobs/need-site-replicated-shopify_%7E0142803edabb21dcfd?source=rss","processedDate":"2024-03-18T20:19:32.271Z","postedDate":"<b>Posted On</b>: March 14, 2024 21:21 UTC","id":"0142803edabb21dcfd"},{"skillset":["WordPress","Web Development","PHP","CSS","JavaScript","HTML"],"title":"Wordpress Expert - Upwork","description":"Hi there. We are looking for someone who can help us update and maintain our website. We pay by the hour for most projects. but we always start with a trial to test your knowledge. \nSome of the tasks are simple such as updated content . upgrading and installing plugins. and adding pages. \nThe first task is to test the site and make sure the plugins are up to date. Then you are to check and verify we are running google analytics. We will test your ability and time it takes to quote adding a page that mimics our stanwith.me link tree. And finally, we will provide updated text to modify on one of the pages. \nTo be short listed. You will provide a quote and tell us the time it takes for the tasks described above. Also start your bid with JOB ID&amp;quot;2185W&amp;quot; otherwise we assume you are a bot or are can&#039;t follow simple instructions?<b>Skills</b>:        WordPress,                     Web Development,                     PHP,                     CSS,                     JavaScript,                     HTML            ","link":"https://www.upwork.com/jobs/Wordpress-Expert_%7E01c0ad1d29b831106d?source=rss","processedDate":"2024-03-18T20:19:32.271Z","postedDate":"<b>Posted On</b>: March 14, 2024 17:51 UTC","id":"01c0ad1d29b831106d"},{"skillset":["Adobe Photoshop","Adobe Illustrator","User Flow","Figma","UI/UX Prototyping","Mobile UI Design","User Interface Design","User Experience Design","UI Graphics","Graphic Design","iPhone UI Design"],"title":"UI Design - TheFunPass - Upwork","description":"Join our design team to help w/ completing UI designs for our app by EOW,. Need support ASAP.<b>Skills</b>:        Adobe Photoshop,                     Adobe Illustrator,                     User Flow,                     Figma,                     UI/UX Prototyping,                     Mobile UI Design,                     User Interface Design,                     User Experience Design,                     UI Graphics,                     Graphic Design,                     iPhone UI Design            ","link":"https://www.upwork.com/jobs/Design-TheFunPass_%7E015f38d2240676566c?source=rss","processedDate":"2024-03-18T20:19:32.271Z","postedDate":"<b>Posted On</b>: March 14, 2024 17:41 UTC","id":"015f38d2240676566c"},{"skillset":["Java"],"title":"Java Project on Image Processing\nTopic: QuadTree &amp; Circular Queue - Upwork","description":"Image Processing\nTopic: QuadTree &amp;amp; Circular Queue\nI need it by March 21\nfrom the project description:\nWhere should I start?\nIts recommended to follow these steps in this specific order:\n1. Read the Background section to fully understand what kind of data stuctures you&rsquo;re called to\nimplement. Do not start coding before you do that!\n2. Check to see if you have a tool to view PGM files. Open the provided image1.pgm with your\nfavorite image viewing application. Most applications support the PGM format. If not, download\nthe popular GIMP which is free and opensource. This is not a required step to complete this\nproject but it will help you a lot if you can visualize the images that you use as input / output.\n3. Read the &ldquo;Rules&rdquo; section to avoid violations that can cost you many points.\n4. We recommend you work on the code in the following order:\n1. Utilities.loadData &ndash; you need to read an image file before you can do anything else\n2. class TreeNode &ndash; a simple node for the tree; requires minimal work\n3. class Queue &ndash; it&rsquo;s a generic queue that doesn&rsquo;t depend on quadtrees; it&rsquo;s not hard to\nimplement and you will need it later for the tree traversal anyway\n4. QuadTreeImage constructor &ndash; it creates the quadtree structure which is the basis for the\nother tree operations\n5. QuadTreeImage.countNodes &ndash; it&rsquo;s a low-hanging fruit and will quickly get you into the\ntree-traversal mood\n6. QuadTreeImage.brightness &ndash; it&rsquo;s a good practice of recursion before you attempt the\nsetColor method\n7. QuadTreeImage.getColor &ndash; it&rsquo;s a good practice of recursion before you attempt the\nsetColor method\n8. Utilities.exportImage &ndash; it&rsquo;s easy to implement with the use of getColor\n9. QuadTreeImage.compareTo &ndash; another low-hanging fruit\n10. QuadTreeImage.toString &ndash; although the level-order traversal is straight forward once\nyou implement the queue, this method has a small challenge; you must figure out how to\ninclude some extra data in the returned string\n11. The setColor is the most challenging method because it can trigger the restructuring of\nthe quadtree. Work on it after you&rsquo;re done with everything else.\nBackground\nA digital image with dimensions HxW is represented with a matrix of pixels that has H rows and W\ncolumns. In grayscale images, each pixel is an integer that takes values from 0-255 (i.e. 1 byte). A\nvalue of zero corresponds to the black color and a value of 255 corresponds to the white color.\nEverything in between is a tone of gray; the darker the gray the closer to 0, the lighter the gray the\ncloser to 255. Figure 2a depicts a zoom-in on a 16x12 grayscale image. In Figure 2b you can see the\nvalues of each pixel superimposed on the image. And in Figure 2c you can see the matrix\nrepresentation of this grayscale image. In this project we will not work with color images but everything\nwe discuss here could equally well apply to color images too.<b>Skills</b>:        Java            ","link":"https://www.upwork.com/jobs/Java-Project-Image-Processing-Topic-QuadTree-amp-Circular-Queue_%7E01445e8de6c45314f4?source=rss","processedDate":"2024-03-18T20:19:32.271Z","postedDate":"<b>Posted On</b>: March 14, 2024 14:04 UTC","id":"01445e8de6c45314f4"},{"skillset":["Landing Page","CSS","HTML","Web Design","Web Development","JavaScript","Webflow","Pardot"],"title":"Landing pages - Pardot &amp; Webflow expert for long-term relationship - Upwork","description":"Context: \nWe are seeking a skilled and talented web design expert to be part of our regular Upwork freelancers. \nFor this task, you will get the job done in 2 to 2.5 hours.\nProject Overview:\nWe&#039;re looking for a skilled Landing Page Specialist to undertake a project involving the modification of 10 existing landing pages for our brands Nedco (in French) and Rexel (in English). The successful candidate will be responsible for making several changes to enhance the effectiveness and SEO of these pages.\nScope:\nHere is the list of existing landing pages:\n- F&amp;amp;B EN: https://go.pardot.com/l/1038023/2023-09-15/33ykl3\n- F&amp;amp;B FR: https://go.pardot.com/l/1038023/2023-09-20/33z1b3\n- Energy EN: https://go.pardot.com/l/1038023/2023-09-20/33z18z\n- Energy FR: https://go.pardot.com/l/1038023/2023-09-20/33z1bl\n- Chemicals EN: https://go.pardot.com/l/1038023/2023-09-20/33z18w\n- Chemicals FR: https://go.pardot.com/l/1038023/2023-09-20/33z1bh\n- Industry EN: https://go.pardot.com/l/1038023/2023-09-20/33z18p\n- Industry FR: https://go.pardot.com/l/1038023/2023-09-20/33z1b9\n- Cosmetic FR: https://go.pardot.com/l/1038023/2023-09-20/33z1bd\n- Cosmetic EN: https://go.pardot.com/l/1038023/2023-09-20/33z18s\nTasks:\n- HTML Tag Integration: Implement HTML tags (H1 to H2) across all blocks on each landing page to ensure proper semantic structure, enhancing accessibility and SEO.\n- Link Updates: Modify all &amp;quot;Learn more&amp;quot; and &amp;quot;Plus d&#039;infos&amp;quot; buttons with new links provided, ensuring correct redirection to relevant company webpages.\n- Image Adjustments: Correct the placement of two mixed-up product images (Magelis and Harmony) and create alt texts for all product images.\n- CTA Button Modification: Update the call-to-action buttons to &amp;quot;Acheter maintenant&amp;quot; for FR pages and &amp;quot;Buy now&amp;quot; for EN pages.\n- General Page Updates: Follow the detailed modifications listed in the provided project brief, ensuring accuracy and attention to detail.\nQualifications:\n- Proven experience in web development or similar role with a focus on landing page optimization.\n- Strong understanding of HTML, CSS, and SEO best practices.\n- Ability to work with both English and French content.\n- Keen eye for design and layout.\n- Excellent attention to detail and ability to follow complex instructions.\n- Project Duration: Short-term contract\nUpcoming tasks (after this job):\n- Landing pages on Webflow<b>Skills</b>:        Landing Page,                     CSS,                     HTML,                     Web Design,                     Web Development,                     JavaScript,                     Webflow,                     Pardot            ","link":"https://www.upwork.com/jobs/Landing-pages-Pardot-amp-Webflow-expert-for-long-term-relationship_%7E01b64187bb911822b2?source=rss","processedDate":"2024-03-18T20:19:32.271Z","postedDate":"<b>Posted On</b>: March 13, 2024 20:59 UTC","id":"01b64187bb911822b2"},{"skillset":["iOS","Smartphone","iOS Development","Mobile App Development","Game Development"],"title":"Looking for iOS &amp; mobile game developer - Upwork","description":"I am looking for someone to be able to build this game out - here is the designs so you can see the different parts and milestones.\nhttps://www.figma.com/file/RrBwIluxSbYwe1enAsbx4l/Bubble-Game?type=whiteboard&amp;amp;node-id=0%3A1&amp;amp;t=tK5Nx9gFXTH0YQhz-1\nAll APIs are ready and have been created by me, so I can make sure it is working. You will be pushing code and providing iOS and Android build for me to test before it is approved and payment is made. If the first milestone is not completed within 2 days from estimated date, then money in escrow will be refunded.\nThe game will need to be created from scratch since it needs to match design and rules, it is not true multiplayer but does involve money, so cheating needs to be prevented.\nPlease make a copy of the sheet here: https://docs.google.com/document/d/1PpuCjgbZ8asqLfPr0FtfgW4NaYrvbvgxDmlCpekke2E/edit?usp=sharing and include days it will take to complete next to each milestone.\nIs this something you can complete?\nIf so, let me know what hours you are available to work on this and share the milestone copy with me, and we can setup a call to discuss.<b>Skills</b>:        iOS,                     Smartphone,                     iOS Development,                     Mobile App Development,                     Game Development            ","link":"https://www.upwork.com/jobs/Looking-for-iOS-amp-mobile-game-developer_%7E017567ca56c43a4206?source=rss","processedDate":"2024-03-18T20:19:32.271Z","postedDate":"<b>Posted On</b>: March 13, 2024 19:23 UTC","id":"017567ca56c43a4206"},{"skillset":["Landing Page","Web Design","Figma"],"title":"Figma Landing Page Design w/ 2 Revisions - Upwork","description":"Need a website design landing page for https://carefree-creative.com/\nIt will be used for 2 pages currently - with more locations/states to add later.\n&nbsp;&nbsp;&nbsp;&nbsp;Biddeford Website Design\n&nbsp;&nbsp;&nbsp;&nbsp;Maine Website Design\nGoal of this landing page is:\n&nbsp;&nbsp;&nbsp;&nbsp;Show potential clients the projects and clients logos we work with to sell ourselves more for the area.\n&nbsp;&nbsp;&nbsp;&nbsp;Have a page to send to leads that are in biddeford/saco/maine areas.\n&nbsp;&nbsp;&nbsp;&nbsp;Have a page to send via email marketing.\n&nbsp;&nbsp;&nbsp;&nbsp;Show up in SERP result pages for website design in that area.\nQuality Matters. \nYou will want to carefully review our current site/style.\nSections Needed:\n&nbsp;&nbsp;&nbsp;&nbsp;Section for businesses we work with in that area etc. HQ logos.\n&nbsp;&nbsp;&nbsp;&nbsp;Section that contains a portfolio of logos / websites of work done in that area.\n&nbsp;&nbsp;&nbsp;&nbsp;Section about website design\n&nbsp;&nbsp;&nbsp;&nbsp;Section about website management\n&nbsp;&nbsp;&nbsp;&nbsp;Contact us/schedule section. small - not too large. like maybe 1/2 of a section. maybe contact details or something on left and calendly on the right.\n&nbsp;&nbsp;&nbsp;&nbsp;Review section. reviews from the companies in that area. maybe merged with section 1. idk.\n&nbsp;&nbsp;&nbsp;&nbsp;Places traveled near you section. A section shows areas to near that area we have traveled to, ie links to blog posts.&nbsp;&nbsp;or blog post grids.\n&nbsp;&nbsp;&nbsp;&nbsp;Photos we took in that area section. Links to photos on captures singles and/or captures tag page for that state/area.\nGeneral pic taken of that area throughout the page used in the design.\nDeliverables:\n&nbsp;&nbsp;&nbsp;&nbsp;2 Figma landing page designs with 8 sections each. Do not reuse sections from our current website. \n&nbsp;&nbsp;&nbsp;&nbsp;Create 1 for Biddeford and 1 for Maine.\n&nbsp;&nbsp;&nbsp;&nbsp;We&rsquo;ll give back revisions. 1-2 sets of revisions.<b>Skills</b>:        Landing Page,                     Web Design,                     Figma            ","link":"https://www.upwork.com/jobs/Figma-Landing-Page-Design-Revisions_%7E016d4471370c6fbcd2?source=rss","processedDate":"2024-03-18T20:19:32.271Z","postedDate":"<b>Posted On</b>: March 13, 2024 20:10 UTC","id":"016d4471370c6fbcd2"},{"skillset":["Phaser","Apache Cordova","Adventure","PixiJS","GSAP","Spine JS","Game Design","Game Development"],"title":"2D WebGL game Lead Developer /w special Artwork - Upwork","description":"We&rsquo;re working on a unique artistic online (WebGL) game, in collaboration with a renowned music artist and artwork by an exceptional talented illustrator - see game concept, script and artwork examples attached.\nOur team consists of a creative director, illustrator, sound designer and (Spine) animators.\nWe&#039;re looking for a Lead Developer, possibly with 1 or 2 assists (there&#039;s a small backend part in the game).\n The game should run smoothly on horizontal-Desktop and vertical-mobile (see example game as reference for the speed and detail: https://www.miumiu.com/miumiu-twist-edt/en/)\nWe&#039;ll be using the Spine texture atlas for (character) animations.\nWe expect the best solution might be PixiJS or Phaser engine to build this game - or a better solution - please propose what you thing is the best approach!<b>Skills</b>:        Phaser,                     Apache Cordova,                     Adventure,                     PixiJS,                     GSAP,                     Spine JS,                     Game Design,                     Game Development            ","link":"https://www.upwork.com/jobs/WebGL-game-Lead-Developer-special-Artwork_%7E013950a2fd1a2e3aa4?source=rss","processedDate":"2024-03-18T20:19:32.271Z","postedDate":"<b>Posted On</b>: March 13, 2024 20:05 UTC","id":"013950a2fd1a2e3aa4"},{"skillset":["Ecommerce Storefront Design","Ecommerce Website","Shopify","Web Development","CSS","Web Design","HTML","JavaScript","Shopify Templates"],"title":"Looking For A Talented Shopify Developer - Upwork","description":"We are looking for a developer to help us build our initial MVP Shopify website for a new brand we are launching soon. We purchased a paid theme called eComus that we want to use. It has all of the features that we need included.\nWe also have wireframes of the initial pages available for you so that you know exactly what we&#039;re looking for as far as layout goes.\nLong story short, we need a developer who can come in, look over the wireframes, get the theme setup, and build the 4 pages that we need. As well as implement the functionality we need.\nHere are the specifics:\nPAGES TO BE BUILT\n--Home\n--Product Details Page (Template)\n--Cart Page\n--Contact\nPRODUCT PAGE FUNCTIONALITY (From eComus)\n--Free Shipping Bar\n--Linked Products\n--Volume Auto-Discount\n--Pre-Orders\n--Coupon Exit Pop w/ Recommended Products\n--Countdown Timer\nPRODUCT PAGE FUNCTIONALITY (Custom)\n--Production &amp;amp; Shipping Timeline Per Product - We need to build custom fields that will allow us to add the Production &amp;amp; Shipping Timeline to each product to have these dates added to the product page for each product.\nOther than that, we need to set up the basics like Email &amp;amp; SMS Marketing, likely through Klaviyo, as well as a few other apps like Loox, etc. Also, we want to implement a custom illustrated background that goes with our branding across the entire website. We already have the assets to implement this.\nWe are looking to use this initial project as a test run to ideally find a long-term developer that we can work with on the site over time as we build it out more and more.\nWe don&#039;t expect this job to take longer than 5-10 hours at most. If you&#039;re going to try to quote us 15-20+ hours for this job, you can save your connects. I know if I was to do this job myself, it would only take me 10-15 hours, and I am NOT a full-time developer, so a full-time developer should be able to get the job done much faster than me.\nIf you&#039;re interested in taking on this project and becoming our long-term developer, please send over a Cover Letter with your portfolio and details about your experience. We will be setting up interviews this week and likely hiring this week as well.<b>Skills</b>:        Ecommerce Storefront Design,                     Ecommerce Website,                     Shopify,                     Web Development,                     CSS,                     Web Design,                     HTML,                     JavaScript,                     Shopify Templates            ","link":"https://www.upwork.com/jobs/Looking-For-Talented-Shopify-Developer_%7E015c1471646519b29a?source=rss","processedDate":"2024-03-18T20:19:32.271Z","postedDate":"<b>Posted On</b>: March 13, 2024 18:41 UTC","id":"015c1471646519b29a"},{"skillset":["Tailwind CSS","TypeScript","Svelte","HTML"],"title":"Company website renewal w/ SvelteKIt &amp; TailwindCSS - Upwork","description":"The task is to complete an essential (almost) single page company website using SvelteKit and ideally Tailwind CSS.\nThere&#039;s a demo site already drafted using SvelteKit, Bootstrap and AOS that has been validated and can be used as a starting point. \nTo complete the task, the selected professional is requested to:\n1.&nbsp;&nbsp;Perform a general review of the demo\n2. The re-styling using Tailwind CSS (to drop Bootstrap)\n3. The implementation of the form actions (two forms)\n4. The implementation of the download page (using Azure Tables).\n5. The server-side configuration to use Azure Static Web App for hosting with an Azure Functions to perform SSR (the recommended &amp;quot;zero-config&amp;quot; adapter).<b>Skills</b>:        Tailwind CSS,                     TypeScript,                     Svelte,                     HTML            ","link":"https://www.upwork.com/jobs/Company-website-renewal-SvelteKIt-amp-TailwindCSS_%7E0123c4911bde09bf3c?source=rss","processedDate":"2024-03-18T20:19:32.271Z","postedDate":"<b>Posted On</b>: March 13, 2024 16:15 UTC","id":"0123c4911bde09bf3c"},{"skillset":["CSS","WordPress","HTML"],"title":"Build a responsive WordPress site given a Figma - Upwork","description":"Need this Figma turned into a responsive wordpress site.\nhttps://www.figma.com/file/JODFKKUvtiU4A4w25LQjOz/Freshlocaltees-PremierePropertyServices-RM-01-Sep-2023-V1-R6?type=design&amp;amp;node-id=0-1&amp;amp;mode=design<b>Skills</b>:        CSS,                     WordPress,                     HTML            ","link":"https://www.upwork.com/jobs/Build-responsive-WordPress-site-given-Figma_%7E018d2ad0fa5e43cc89?source=rss","processedDate":"2024-03-18T20:19:32.271Z","postedDate":"<b>Posted On</b>: March 13, 2024 15:31 UTC","id":"018d2ad0fa5e43cc89"},{"skillset":["MongoDB","Ruby on Rails","React","Microservice","PostgreSQL Programming"],"title":"Seeking Sr. Engineers w/ Frontend ReactJS Expertise and backend Proficiency in Ruby on Rails (ROR)  - Upwork","description":"**Job Title**: Senior Fullstack Engineer - React.js/Ruby on Rails\n**Job Description**:\nWe are seeking a highly skilled Senior Software Engineer with a strong expertise in frontend React.js development along with some backend RoR proficiency.&nbsp;&nbsp;This role involves close collaboration with our engineering team to ensure the highest standards of development.\n**Qualifications**:\n1. Proven full-stack experience in frontend React.js development.\n2. Working proficiency with backend Ruby on Rails experience.&nbsp;&nbsp;\n3. Proficiency in software development best practices and design patterns.\n4. Excellent problem-solving skills and attention to detail.\n5. Strong communication and teamwork skills.\n6. Bachelor&rsquo;s degree in Computer Science, Engineering, or a related field.\n**Additional Information**:\n- This position offers the opportunity for further engagement on additional projects, contingent upon the delivery of high-quality work completed efficiently.\n- We value creativity, dedication, and a collaborative approach to problem solving.\n**Application Process**:\nInterested candidates should submit the following:\n1. A detailed resume highlighting relevant experience.\n2. A cover letter expressing interest and suitability for the role.\n3. A portfolio showcasing past applications built using React.js\n4. Links to GitHub repositories or other version control systems hosting their code, demonstrating their contributions to software development projects.<b>Skills</b>:        MongoDB,                     Ruby on Rails,                     React,                     Microservice,                     PostgreSQL Programming            ","link":"https://www.upwork.com/jobs/Seeking-Engineers-Frontend-ReactJS-Expertise-and-backend-Proficiency-Ruby-Rails-ROR_%7E0153ed80655f57c040?source=rss","processedDate":"2024-03-18T20:19:32.271Z","postedDate":"<b>Posted On</b>: March 13, 2024 15:32 UTC","id":"0153ed80655f57c040"},{"skillset":["Web Development","HTML"],"title":"Interactive map web project - Upwork","description":"I need someone with experience in interactive maps. The key things I am looking for are:\nAn interactive map similar to https://www.sensationaltutors.co.uk/tutors/?geodir_search=1&amp;amp;stype=gd_place&amp;amp;s \nTutors have a profile and can edit their details https://docs.google.com/spreadsheets/d/1pHSl2Tsk3icLW5UANmnEA_SAs-W-8-coZ3rhlV1VJVQ/edit?usp=sharing\nAvailable on four separate sites (depending on the selection of SEND specialisms)\nI can approve tutors based on:\n- their contract is completed\n- having their data in the booking system\nClients can narrow tutors down by:\n- Location\n- Subject\n- Price\n- SEND specialism\n- In-person or online\nClients can leave a review, and the review is linked to each tutor and automatically goes onto each site.<b>Skills</b>:        Web Development,                     HTML            ","link":"https://www.upwork.com/jobs/Interactive-map-web-project_%7E01ac76a0f5fe64636c?source=rss","processedDate":"2024-03-18T20:19:32.271Z","postedDate":"<b>Posted On</b>: March 13, 2024 11:22 UTC","id":"01ac76a0f5fe64636c"},{"skillset":["Web Design"],"title":"Website designer  - Upwork","description":"I need to design a website for a conference.\nWith one home page and several second page <b>Skills</b>:        Web Design            ","link":"https://www.upwork.com/jobs/Website-designer_%7E01d82a1e966cb066de?source=rss","processedDate":"2024-03-18T20:19:32.271Z","postedDate":"<b>Posted On</b>: March 13, 2024 06:27 UTC","id":"01d82a1e966cb066de"},{"skillset":[],"title":"[$500] Category - Unselected subcategories are indented w/o parent when there is &lt;8 categories #37774 - Expensify - Upwork","description":"Expensify is a team of generalists developing today&#039;s leading expense management tool. Maintaining our reputation as an innovative leader in the world of finance requires an incredibly reliable and secure system for processing financial transactions. Accordingly, we primarily leverage time-tested languages, but we&#039;re looking to unify our front-end across platforms. For this, we&#039;re leveraging React Native and are looking toward the community on Upwork to help solve a variety of problems, both big and small, related to this migration.\nPlease see the GitHub issue for full details: github.com/Expensify/App/issues/37774\nYour Proposal:\n- You *must* post a proposal for how you will fix this issue in the GitHub issue linked above.\n- Your proposal should include a technical explanation of the changes you will make. You are not required to submit the final solution or code along with your proposal.\n- Your proposal will be reviewed.\n- If your proposal is accepted, you should post the proposal in Upwork and you will be hired for the job.\n- AFTER your proposal is accepted in Upwork and you have accepted the offer, you may submit the code to implement your solution. To submit the code, go to the Expensify/App GitHub repo where you&#039;ll create a fork of our codebase. You&#039;ll create a branch on that fork, and when your code is ready for review, you&#039;ll create a pull request in our repository to merge your code into our codebase. Include screenshots and confirmation that you have tested the pull request on all platforms. Our engineers will review the code, and approve and merge when the code meets our requirements.\nPlease review our Contributor Guidelines before submitting a proposal - github.com/Expensify/App/blob/main/contributingGuides/CONTRIBUTING.md\n**Important:** As documented in our CONTRIBUTING.md, payment amounts are variable, dependent on any regressions your work causes.","link":"https://www.upwork.com/jobs/500-Category-Unselected-subcategories-are-indented-parent-when-there-categories-37774-Expensify_%7E011bca94c973f91072?source=rss","processedDate":"2024-03-18T20:19:32.271Z","postedDate":"<b>Posted On</b>: March 13, 2024 04:43 UTC","id":"011bca94c973f91072"},{"skillset":["MongoDB","Ruby on Rails","React","Microservice","PostgreSQL Programming"],"title":"Help Wanted! Sr. Fullstack (ROR and ReactJS) Engineers w/ Microservices Architecture experience.  - Upwork","description":"**Job Title**: Senior Software Engineer - Ruby on Rails/React.js with Microservices Architecture\n**Job Description**:\nWe are seeking a highly skilled Senior Software Engineer with expertise in Ruby on Rails and React.js, and a strong background in developing applications using a microservices architecture. The successful candidate will be responsible for designing and developing a dashboard as a microservice, which will be seamlessly integrated into our core application. This role involves close collaboration with our engineering team to ensure the highest standards of development.\n**Key Responsibilities**:\n1. Design and develop a high-performance dashboard as a microservice using Ruby on Rails and React.js.\n2. Ensure seamless integration of the new microservice with the existing core application.\n3. Collaborate with the engineering team to align the microservice development with the overall system architecture and company standards.\n4. Write clean, maintainable, and efficient code.\n5. Participate in code reviews and contribute to team knowledge sharing.\n6. Troubleshoot, debug, and upgrade existing systems.\n7. Stay updated with emerging trends and technologies in software development.\n**Qualifications**:\n1. Proven experience in Ruby on Rails and React.js development.\n2. Strong experience with microservices architecture.\n3. Proficiency in software development best practices and design patterns.\n4. Excellent problem-solving skills and attention to detail.\n5. Strong communication and teamwork skills.\n6. Bachelor&rsquo;s degree in Computer Science, Engineering, or a related field.\n**Additional Information**:\n- This position offers the opportunity for further engagement on additional projects, contingent upon the delivery of high-quality work completed efficiently.\n- We value creativity, dedication, and a collaborative approach to problem solving.\n**Application Process**:\nInterested candidates should submit the following:\n1. A detailed resume highlighting relevant experience.\n2. A cover letter expressing interest and suitability for the role.\n3. A portfolio showcasing past applications built with Ruby on Rails and React.js, emphasizing those developed using a microservices architecture.\n4. Links to GitHub repositories or other version control systems hosting their code, demonstrating their contributions to software development projects.<b>Skills</b>:        MongoDB,                     Ruby on Rails,                     React,                     Microservice,                     PostgreSQL Programming            ","link":"https://www.upwork.com/jobs/Help-Wanted-Fullstack-ROR-and-ReactJS-Engineers-Microservices-Architecture-experience_%7E0119ef27ed6c769655?source=rss","processedDate":"2024-03-18T20:19:32.271Z","postedDate":"<b>Posted On</b>: March 13, 2024 03:43 UTC","id":"0119ef27ed6c769655"},{"skillset":["Email Communication","Customer Service","Scheduling","Research &amp; Strategy"],"title":"Booking Reservationist  - Upwork","description":"Harper Adventures Travel Agency is a leading provider of exceptional travel experiences, committed to delivering unforgettable journeys to our clients while prioritizing their budgets.\nWith a passion for exploring the world and a dedication to customer satisfaction, we are seeking motivated individuals with a passion for travel to join our team and help us continue to create remarkable travel adventures.\nOur agency has been in the business for 70 years;\nWe have over 130+ preferred travel suppliers at our fingertips, so whatever our clients need, we can take care of them.\nWe belong to one of the top travel companies in the USA with one of the highest compensation plans in the industry! \nWe have an A+ rating with the Better Business Bureau and have received many awards since being in business. Even during a global pandemic, we produced over $80 million in sales last year alone! This year, we are projected to produce over a $500 million dollars collectively in travel sales! \nAre you a natural at crafting fun travel experiences?Are you the travel booker for your friends and famiily?\nWe have the perfect position for you! \nAs a Travel Agent at Harper Adventures Travel Agency, you will play a crucial role in designing and arranging personalized travel experiences for your clients. \nYour responsibilities will include:\n- Conducting thorough travel research and crafting tailored itineraries.\n- Handling client payments efficiently and securely.\nEnsuring the utmost confidentiality and respect for our clients&#039; needs.\n- Providing valuable insights on travel conditions, weather, and travel expectations.\n- Staying up-to-date with the latest travel news and updates and sharing this information with clients.\n- Keeping yourself informed by actively participating in industry meetings and events.\nQualifications:\nMust be 18 years or older\nMust be authorized to work in the USA\nMust be coachable &amp;amp; willing to learn\nBenefits:\nFreedom to work from any location\nUnlimited earning potential\nTax Deductions\nPersonal Travel Perks, Free Cruises, and FAM Trips\nDiscounted shopping/dining\nDiscounted/Free theme park tickets\nSchedule Flexibility \nUnlimited Free Support &amp;amp; All materials you need \n**This is a 1099 Position, NOT W2**\n**Part Time and Full Time available**<b>Skills</b>:        Email Communication,                     Customer Service,                     Scheduling,                     Research &amp; Strategy            ","link":"https://www.upwork.com/jobs/Booking-Reservationist_%7E01e7388dc45dcac72a?source=rss","processedDate":"2024-03-18T20:19:32.271Z","postedDate":"<b>Posted On</b>: March 13, 2024 02:16 UTC","id":"01e7388dc45dcac72a"},{"skillset":["Custom Ecommerce Platform Development","WooCommerce","WordPress","Web Development","PHP","CSS"],"title":"Wordpress booking system for travel packages and tours - Upwork","description":"Background\nEvents Travel is a travel agency and tour operator based in Melbourne, Australia. We work with global sporting events to offer travel packages and tours to fans wanting to attend the events. Our products include travel packages and tours containing various travel services such as event tickets, hotel accommodation, transport, merchandise etc.\nExamples:\nAustralian Open 2025 - https://events.com.au/tennis/australian-open-2025/ \nSingapore Grand Prix 2024 - https://events.com.au/formula-1/formula-1-singapore-grand-prix-2024/ \nThe Open Championship 2025 - https://events.com.au/golf/the-153rd-open-at-royal-portrush-in-2025/ \nWe are looking to keep up with competitors and create a booking system on our website so that customers who are ready to book a package/tour can do it themselves by selecting the package/tour, configuring the number of travellers, selecting booking options, see the total price and make a credit card payment for the deposit or total.\nThis will free up time for our team to better serve other customers who require more service, consulting etc.\nWe are currently using Wordpress, Elementor Pro, Gravity Forms, ACF, CPT and other plugins to display our events and packages in a basic parent/child hierarchy with prices displayed in tables. Customers who want to book contact us via email, phone or submit a basic form that captures personal information but does not capture booking options or payment. We then invoice customers manually which is time consuming, particularly for small packages or ticket only sales which are low margin.\nThe project\nWe are looking for an experienced developer/agency to create a booking system in Wordpress to allow customers to make a booking. Here is a list of the must have a nice to have features. The project at minimum will need the must have features, see the attached document:\nInspiration:\nInsight Vacations - https://bookings.insightvacations.com/IVSYDS/B959ZM19/26E24a?rooms=1xTWN&amp;amp;adults=2&amp;amp;_ga=2.126290189.1462220803.1710282696-488791334.1710211512&amp;amp;_gl=1*qjv55u*_ga*NDg4NzkxMzM0LjE3MTAyMTE1MTI.*_ga_L1T7BMSMEC*MTcxMDI4MjE5OS41LjEuMTcxMDI4NDMyOS4yNS4wLjA. \nOn Location - \nhttps://hospitalitytravelpackages.paris2024.org/discover/r/oly/e3n_5s_0_hp35-pkg-3225?language=en \nAusOpen Travel - \nhttps://ausopentravel.com/series/ao25/package-type/create-your-own/first-week-start-3n/ <b>Skills</b>:        Custom Ecommerce Platform Development,                     WooCommerce,                     WordPress,                     Web Development,                     PHP,                     CSS            ","link":"https://www.upwork.com/jobs/Wordpress-booking-system-for-travel-packages-and-tours_%7E01c43f5fc1c4695efd?source=rss","processedDate":"2024-03-18T20:19:32.271Z","postedDate":"<b>Posted On</b>: March 12, 2024 23:30 UTC","id":"01c43f5fc1c4695efd"},{"skillset":["Django","Python","Celery","React"],"title":"Senior Django/Python dev  to join our fun team of remote developers (SaaS Product)  - Upwork","description":"We started Proven to help founders and entrepreneurs save money and find the right partners to work with. We have an amazing team of great developers who are based in Ukraine, Spain, Italy, USA, and Poland, and now, we are looking for YOU to join our team. You&#039;re a great communicator and a great coder, and you love working on interesting jobs and ideas with a great group of people. \nAt GetProven, we specialize in community management products primarily for Venture Capital firms, Private Equity firms, FDI Departments, and B2B Banking. Our goal is to facilitate connections and offer solutions that drive investment and growth. As a company working with world-class Venture capital firms, Private Equity firms, B2B Banks, and governments. , we are committed to delivering top-quality code and innovative solutions. Read more at getproven.com\nJob Description:\nWe are seeking a Senior Django Developer with a minimum of 5 years of experience, specifically in a SaaS product company. The ideal candidate should have a strong background in building complex, scalable software systems. We are not looking for candidates who have only worked on website or CMS development.\nResponsibilities:\nDevelop and maintain advanced SaaS product using Django.\nWork closely with cross-functional teams to understand and transform business requirements into scalable solutions.\nContribute to all phases of the development lifecycle, ensuring top-quality output.\nOptimize applications for maximum speed and scalability.\nProvide technical leadership and mentor junior team members.\nEnsure security and privacy compliance in all aspects of development.\nQualifications:\n5+ years of professional experience in Django development.\nDeep knowledge of Django ORM and a good understanding of database architecture principles.\nStrong proficiency in developing REST APIs.\nSolid experience in writing unit and integration tests.\nFamiliarity with front-end technologies like JavaScript, HTML5, and CSS3.\nExcellent problem-solving, analytical, and troubleshooting skills.\nProven track record of working in a SaaS product company, demonstrating an ability to handle complex logic and data structures.\nExperience with cloud services and database technologies.\nAbility to work independently with minimal supervision and a commitment to writing clean, maintainable, \nGood to Have:\nExperience with multi-tenancy.\nExperience with server side technologies like Celery, Elasticsearch, Redis, Docker, and AWS services (RDS, EC2, S3, Route53, Cloudfront).\nWhat We Offer:\nAn opportunity to work on challenging projects with a dynamic and talented team.\nA culture that values innovative thinking and passionate individuals.\nRemote first mindset \nEquity and Stock Options in a bootstrapped, profitable startup \nAnnual trips to meet the team in fun locations around the world. \n________________________________________\nProbationary Period:\nThe initial period of one month will be probationary, during which we will assess the candidate&#039;s fitment for the role. Depending on the circumstances, we may require the candidate to start working via Upwork for the first 1-2 months.\nHiring Process:\nOur standard hiring process is designed to ensure a comprehensive evaluation of each candidate&#039;s skills and potential fit with our team. It includes the following stages:\nOnline Aptitude Test: Approximately 1 hour, assessing problem-solving and technical skills.\nCode Assignment: Candidates will be given a coding task that typically requires around 2 days to complete. We offer up to 1 week for completion to accommodate different schedules.\nInterview with the CTO: A technical interview to discuss the candidate&#039;s technical expertise, experience, and the code assignment.\nInterview with the CEO: A final interview to assess cultural fit and alignment with our company&#039;s values and goals.\nCandidates will be evaluated at each stage to ensure they meet the high standards required for the role.\nReady to Code the Extraordinary? Join Proven.<b>Skills</b>:        Django,                     Python,                     Celery,                     React            ","link":"https://www.upwork.com/jobs/Senior-Django-Python-dev-join-our-fun-team-remote-developers-SaaS-Product_%7E01dd80d02d6756789f?source=rss","processedDate":"2024-03-18T20:19:32.271Z","postedDate":"<b>Posted On</b>: March 07, 2024 17:15 UTC","id":"01dd80d02d6756789f"},{"skillset":["Python","MySQL"],"title":"looking for a dev for a small python app with MySQL DB and user interface (tkinter) - Upwork","description":"The app would provide a method for managing equipment rewards and player wishes in the game World of Warcraft (WoW). This involves developing an application allowing players to make a wish list for each boss, which the raid leader can consult and assign equipment. Players will also be able to consult and edit their list according to what they have received/wish in the future following the evolution of their equipment.\nThis would be for personnal use only, and I would need access to all the source code, DB, ect. This should be able to run localy on my computer (I have a jetbrain licence).\nContact me to discuss my project and how we can work together! :)\nSeile<b>Skills</b>:        Python,                     MySQL            ","link":"https://www.upwork.com/jobs/looking-for-dev-for-small-python-app-with-MySQL-and-user-interface-tkinter_%7E010b7c32c3f22bd61e?source=rss","processedDate":"2024-03-18T20:19:32.271Z","postedDate":"<b>Posted On</b>: March 12, 2024 18:40 UTC","id":"010b7c32c3f22bd61e"},{"skillset":["WordPress","Web Development","Web Design","Web Design Plugin"],"title":"Customizable Real Estate IDX Website w/ Push Button Duplication - Upwork","description":"Looking to have relatively basic Real Estate WordPress websites with preconfigured Showcase IDX plugin built in to populate relative searches based up client definitions\nThe website will need to be duplicatable once passing the payment wall and allow users to add custom content to pre-defined locations in the website.\nThe website should allow for mapping and uploading of specific features (logo, bio, contact info, team members, etc.) via an onboarding wizard. There should also be an Ai plugin to assist in the creation of some of this content\nWebsite should allow for easy customization to upload and integrate their personal domains. \nProject Timeline is 2 months\nWould like to have multiple templates that are relatively the same layout with different themes.\nWe will expand the basic needs of the site to allow customers to have completely opened custom development which we will require support for once we are up an running<b>Skills</b>:        WordPress,                     Web Development,                     Web Design,                     Web Design Plugin            ","link":"https://www.upwork.com/jobs/Customizable-Real-Estate-IDX-Website-Push-Button-Duplication_%7E01a010eba1f9f4472d?source=rss","processedDate":"2024-03-18T20:19:32.271Z","postedDate":"<b>Posted On</b>: March 12, 2024 16:08 UTC","id":"01a010eba1f9f4472d"},{"skillset":["Mockup","Web Design","Prototyping","HTML","Game Design","Graphic Design"],"title":"Website Design for a browser-based fantasy game - Upwork","description":"Looking to work with a talented independent freelancer to design a landing page for a video game. References:\nPlant Mojo: https://www.planetmojo.io/\nDemole: https://demole.io/\nCryptoZoon: https://cryptozoon.io\nMonsterFi: https://www.youtube.com/watch?v=jQuUdVddRg0\nPolkamonster: https://www.youtube.com/watch?v=oMyW8tqq6gs\nI&#039;m looking for something colourful, loud, and eyecatching. There should be a lot of fun graphics and visuals on the screen, whether that is a 3d rendered scene (polkamonster) or a large 3d object (planet mojo &amp;amp; demole), or even just a well designed web page with 2d elements (cryptozoon). The homepage will contain basic information about the game as well as informational graphics, such as:\nHERO:\nNavbar (Either vertical or horizontal), containing buttons that navigate to parts of the web page.\nButtons within webpage linking to URLs (token chart price, buy token, play game)\nAnimation/image with brand name top left.\nLinks to socials on or near the navbar.\nEXPLAINER:\nGraphic banner with visuals on it and an explanation of what the game is, if visuals are still .pngs then they will be animated to float up and down. Particle effects should be on the screen.\nHOW TO PLAY:\nVery simple straigihtforward explanation of how users play the game - steps 1-4, with relevant vibrant images.\nTOKENOMICS:\nToken economics graphic to be displayed (numbers will be provided)\nROADMAP:\nRoadmap graphic - just a table with a list of objectives and ticks.\nFAQ\nVery simple FAQ with 3-4 questions\nPARTNERS &amp;amp; BACKERS:\nDisplay a grid of logos &amp;amp; names\nGET IN TOUCH:\nLinks to community &amp;amp; company email.\nProvide a quote for the above work, expect to be creating or sourcing all the vibrant graphics that fit the games theme and story.<b>Skills</b>:        Mockup,                     Web Design,                     Prototyping,                     HTML,                     Game Design,                     Graphic Design            ","link":"https://www.upwork.com/jobs/Website-Design-for-browser-based-fantasy-game_%7E019490f37aceb2f27f?source=rss","processedDate":"2024-03-18T20:19:32.271Z","postedDate":"<b>Posted On</b>: March 12, 2024 15:52 UTC","id":"019490f37aceb2f27f"},{"skillset":["Website Redesign","Website Customization","Web Development","Graphic Design","Search Engine Optimization","Web Design","Blog","Content Writing","Social Media Advertising","Squarespace","Website"],"title":"Squarespace Website - Quick Update - Upwork","description":"SQUARESPACE WEBSITE - Quick Update\nWe are a small accounting &amp;amp; consultancy business, looking for someone to help with a short project to update our website (hosted on Squarespace).\nThe website doesn&#039;t need a full redesign (this will come later!) - just a refresh, to update for current clients, services &amp;amp; team, plus a slight rework of the page layouts &amp;amp; how they&#039;re linked together.\nWe will provide information regarding the page layouts, wireframe, copy &amp;amp; content. We envisage the total project being approx. 8-10hrs work once everything is agreed and outlined.\nTimeframes:\nw.c. 18th March - meet to discuss brief, agree contract\nw.c. 25th March - work on first version, 1st review at end of week\nw.c. 1st April - work on updates, review &amp;amp; sign-off end of week\nCompletion by 8th April\nCurrent website is at www.bitesizeconsulting.com <b>Skills</b>:        Website Redesign,                     Website Customization,                     Web Development,                     Graphic Design,                     Search Engine Optimization,                     Web Design,                     Blog,                     Content Writing,                     Social Media Advertising,                     Squarespace,                     Website            ","link":"https://www.upwork.com/jobs/Squarespace-Website-Quick-Update_%7E0104256331bd681af5?source=rss","processedDate":"2024-03-18T20:19:32.271Z","postedDate":"<b>Posted On</b>: March 12, 2024 15:49 UTC","id":"0104256331bd681af5"},{"skillset":["Vue.js","JSON","PHP","JavaScript","Web Development","MySQL","API Integration"],"title":"Freelance Full Stack Developer \n - Upwork","description":"Freelance Full Stack Developer (Remote) &ndash; (m/w/d)\nWe&#039;re looking for a talented freelancer to join our team on a project-based collaboration, with the possibility of establishing a longer-term relationship based on mutual success. As a Full Stack Developer with us, you&#039;ll have the opportunity to work on exciting projects, contribute your expertise, and shape the digital landscape.\nYour responsibilities \nCollaborate with our team to understand project requirements, objectives, and technical specifications\nImplement end-to-end web applications, ensuring user-facing features are visually appealing and intuitive while backend systems are robust and efficient\nDeveloping, maintaining and testing high quality software products by writing clean, well-documented code that follows best practices and coding standards\nProvide technical assistance and support for incoming requests and issues related to web applications\nAnalyze and determine root cause of application issues\nCommunicate project status, challenges, and roadblocks effectively to the team.\nYour profile \n+5 years of application design &amp;amp; development experience\nSolid experience with OOP, PHP 7, MySQL 8, HTML5/CSS3, Web Services, JSON, JavaScript/AJAX, jQuery\nExperience with one of the following technologies &ndash; Laravel, Symfony is required\nAttention to detail and a commitment to writing clean, maintainable code\nGood knowledge of the LAMP stack (Linux, Apache, MySQL, PHP)\nGit experience (e.g. GitLab, GitHub, BitBucket)\nBasic Linux OS knowledge Good level in spoken and written English\nGood knowledge of MVC architecture is mandatory\nFamiliarity with Agile development and tools, such as Jira \nIt would be awesome, if you also have\nExperience with PHP 8, Vue.JS, Docker and MongoDB\nExperience with resource availability projects\nFamiliarity with databases and data modeling/design techniques; data interface protocols; database software installation; database tuning;\nproven experience with distributed caching systems such as: Redis / Memcached\nproven experience with distributed queue system (Redis)\nworking with complex architectured software solutions \nWhat you can expect from us\nChallenging and inspiring work environment\nA highly dynamic and exciting working environment with low hierarchies and an awesome working atmosphere in one of the most exciting Startups in Munich. \nOpen organization where your voice and ideas will be truly heard. \nWork with helpful and passionate colleagues. \nNote: This is a freelance position with project-based collaboration. However, there is a possibility for a longer-term relationship based on successful project outcomes and mutual alignment<b>Skills</b>:        Vue.js,                     JSON,                     PHP,                     JavaScript,                     Web Development,                     MySQL,                     API Integration            ","link":"https://www.upwork.com/jobs/Freelance-Full-Stack-Developer_%7E01098cc0e25dbc5e32?source=rss","processedDate":"2024-03-18T20:19:32.271Z","postedDate":"<b>Posted On</b>: March 12, 2024 11:07 UTC","id":"01098cc0e25dbc5e32"},{"skillset":["JavaScript","API","HTML","Node.js","CSS","Web Development","MongoDB","HTML5"],"title":"I need Javascript Backend developer  - Upwork","description":"Hello \nI need an Expert backend developer to get me an App like in the video link below \nhttps://help.calendly.com/hc/en-us/p/video-tutorials?wchannelid=zs2tmj7w77&amp;amp;wmediaid=zswg295xi9\nlike in this video, the user will give us their iCloud email and will have an app-specific password created, and with those two values, we would need to do apple auth.\nWe will receive the user&#039;s apple credentials to access iCloud Calendar, and then we want to read, write and edit events in the user&#039;s calendar.<b>Skills</b>:        JavaScript,                     API,                     HTML,                     Node.js,                     CSS,                     Web Development,                     MongoDB,                     HTML5            ","link":"https://www.upwork.com/jobs/need-Javascript-Backend-developer_%7E012f1144d7e90dd2e5?source=rss","processedDate":"2024-03-18T20:19:32.271Z","postedDate":"<b>Posted On</b>: March 12, 2024 10:09 UTC","id":"012f1144d7e90dd2e5"},{"skillset":["WordPress Backup","WordPress","WordPress Plugin","WooCommerce","MySQL","phpMyAdmin"],"title":"WP - Error Fix on WordPress w/WooCommerce - Upwork","description":"I am getting an error on checkout for new orders. This is happening in the WooCommerce plugin installed on WP.\nThe error is: &amp;quot;unexpected token &#039;&amp;amp;lt;&#039;, *&amp;quot;\nThe task will be to pair program and solve the error on my machine. I am well versed in development, but don&#039;t have time to get familiar with WP at the moment. It&#039;s possibly a plugin update issue. We will plan to back up the site and solve the issue with your expertise. I have allotted 1 hour for this task.\nPlease see details in attached images.<b>Skills</b>:        WordPress Backup,                     WordPress,                     WordPress Plugin,                     WooCommerce,                     MySQL,                     phpMyAdmin            ","link":"https://www.upwork.com/jobs/Error-Fix-WordPress-WooCommerce_%7E01012bd22dbe90f096?source=rss","processedDate":"2024-03-18T20:19:32.271Z","postedDate":"<b>Posted On</b>: March 12, 2024 03:12 UTC","id":"01012bd22dbe90f096"},{"skillset":["WordPress","Web Development","Web Design","WordPress Plugin"],"title":"Word Press Template w/ IDX Integration and Automations - Upwork","description":"Wordpress Site Creation with Showcase IDX plugin. \nAbility to automate and place specific objects upon upload to template.\nAutomate deployment of icons, business name, contact infomration, customizing specific fields. <b>Skills</b>:        WordPress,                     Web Development,                     Web Design,                     WordPress Plugin            ","link":"https://www.upwork.com/jobs/Word-Press-Template-IDX-Integration-and-Automations_%7E01c30ea0b69f0e3d84?source=rss","processedDate":"2024-03-18T20:19:32.271Z","postedDate":"<b>Posted On</b>: March 12, 2024 00:44 UTC","id":"01c30ea0b69f0e3d84"},{"skillset":["Landing Page","WordPress","Graphic Design","Wireframing","Web Development","Web Design"],"title":"Responsive Wordpress landing pages project - experienced developer w graphic design, B2B - Upwork","description":"We need beautiful, branded landing pages (LP) for a Wordpress website. \nWe will provide the content (3K - 4K words), for a competitive long-form LP. The LP will have conversion offers with a simple form. We are targeting a B2B audience with each local SEO landing page.&nbsp;&nbsp;\nUsing our branding and your team&#039;s graphic design creativity, you&#039;ll produce the mock up. This mock up will be used as the template for each of the LPs. We have 6-12 LPs planned for phase 1. \nThis project is ready to launch - all we need is you to complete. You are a strong front end Wordpress developer with a graphic design background, and have access to a full stack developer as needed.&nbsp;&nbsp;We&#039;re looking for a seasoned talent who&#039;s worked on similar projects. <b>Skills</b>:        Landing Page,                     WordPress,                     Graphic Design,                     Wireframing,                     Web Development,                     Web Design            ","link":"https://www.upwork.com/jobs/Responsive-Wordpress-landing-pages-project-experienced-developer-graphic-design-B2B_%7E01140e15131310f98c?source=rss","processedDate":"2024-03-18T20:19:32.271Z","postedDate":"<b>Posted On</b>: March 11, 2024 20:29 UTC","id":"01140e15131310f98c"},{"skillset":["JavaScript","Figma","Web Design","CSS","User Flow","Prototyping"],"title":"Figma to FlutterFlow - Upwork","description":"Hello there!\nI&#039;m looking for someone who can convert my Figma pages over to FlutterFlow.\nHere&#039;s the Figma file:&nbsp;https://www.figma.com/file/XeDsSayavLHJu6F6IPHoW6/TailTag-V1?type=design&amp;amp;node-id=1901%3A1034&amp;amp;mode=design&amp;amp;t=HicnUradHJnraTXk-1\nTo see the pages I&#039;d like to convert you can go to &amp;quot;1. Application&amp;quot;.\nFor later I&#039;ll also need a few &amp;quot;animations&amp;quot; when e.g. a settings slider is popping up, as well as some backend work. But for now I just need the pages to be converted from Figma.\nIf you want to see how the actual user flow works, here it is (this is still work in progress, but just to give you&nbsp;&nbsp;a sneak peak):&nbsp;https://www.figma.com/file/s7XoaCeopBNbHCVSJYHzUK/TT-User-flow?type=whiteboard&amp;amp;node-id=0%3A1&amp;amp;t=FSUd4eCEQOXxUt8h-1\nIf you have any questions, please don&#039;t hesitate to ask!\nHope to hear from you :)\nBest,\nAndy<b>Skills</b>:        JavaScript,                     Figma,                     Web Design,                     CSS,                     User Flow,                     Prototyping            ","link":"https://www.upwork.com/jobs/Figma-FlutterFlow_%7E01746bf594bfb70947?source=rss","processedDate":"2024-03-18T20:19:32.271Z","postedDate":"<b>Posted On</b>: March 11, 2024 14:45 UTC","id":"01746bf594bfb70947"},{"skillset":["Figma","Wireframing","Mobile App Design","Mockup","Prototyping"],"title":"Need Figma APP Wire Frames  - Upwork","description":"Hi! Me and my teammate are looking to build a mobile, gamified, animated (think subway surfers) social app! We want to create wireframes for this app to present to investors before we look into actually building it! We have some creative ideas and a design/branding deck we can send for reference. We are going to need someone that is skilled at making mobile app wire frames from scratch and can also design assets (from our drawings) for the wireframes. Excited to start working with you!\nPLEASE refer to the attached files for a doc about the app and access this link for a Canva file on what we want it to look like! \nhttps://www.canva.com/design/DAF5Vfz8wEU/G90RhQnE1CjahdiPLQvlGA/edit?utm_content=DAF5Vfz8wEU&amp;amp;utm_campaign=designshare&amp;amp;utm_medium=link2&amp;amp;utm_source=sharebutton<b>Skills</b>:        Figma,                     Wireframing,                     Mobile App Design,                     Mockup,                     Prototyping            ","link":"https://www.upwork.com/jobs/Need-Figma-APP-Wire-Frames_%7E01dd1d2b9e71021cf3?source=rss","processedDate":"2024-03-18T20:19:32.271Z","postedDate":"<b>Posted On</b>: March 11, 2024 14:39 UTC","id":"01dd1d2b9e71021cf3"},{"skillset":["Figma","Graphic Design","Adobe Photoshop","Adobe Illustrator","Web Design"],"title":"Freelance UI Designer for Landing Page Designs - Upwork","description":"Job Type: Freelance/Project-Based\nCompensation: $70 per Landing Page Design\nAbout Us:\nThaipan is a dynamic and innovative company specializing in&nbsp;&nbsp;software development. We are committed to delivering outstanding solutions to our clients, focusing on creativity, usability, and cutting-edge technology. We are currently looking for a talented UI Designer to join our team on a project basis, with a focus on designing compelling and effective landing pages.\nJob Description:\nWe are seeking a creative and detail-oriented UI Designer to create engaging and visually appealing landing page designs for our projects. The ideal candidate will have a strong understanding of user interface design principles and a keen eye for aesthetics. This position is perfect for someone who thrives in a fast-paced environment and is looking to apply their design skills to create high-converting landing pages.\nResponsibilities:\nDesign and deliver wireframes, mockups, and final designs for landing pages based on project requirements.\nCollaborate with the marketing and development teams to ensure designs are aligned with business goals and technical constraints.\nIncorporate UX design best practices into landing page designs to optimize conversion rates.\nEnsure all designs are responsive and provide a seamless experience across all devices and screen sizes.\nStay up-to-date with the latest design trends, techniques, and technologies.\nRequirements:\nProven experience as a UI Designer, with a strong portfolio showcasing landing page designs.\nProficiency in design software such as Adobe XD, Sketch, Figma, or similar.\nUnderstanding of UX principles and web development basics (HTML/CSS/) is a plus.\nExcellent visual design skills with sensitivity to user-system interaction.\nAbility to solve problems creatively and effectively.\nExcellent communication skills and ability to work in a team environment.\nHow to Apply:\nPlease submit your best landing page and a brief cover letter explaining why you&#039;re the perfect fit for this role. \nWe are looking forward to seeing your creativity and how you can contribute to our team&#039;s success!\nAttach an Example of our usual landing pages. https://www.figma.com/file/wETotkARCGSKVQkrgMKIUS/Hair-Free!-Jean%C2%B4s-Copy?type=design&amp;amp;node-id=2018%3A2&amp;amp;mode=design&amp;amp;t=sgbfghFBN8NWUghu-1<b>Skills</b>:        Figma,                     Graphic Design,                     Adobe Photoshop,                     Adobe Illustrator,                     Web Design            ","link":"https://www.upwork.com/jobs/Freelance-Designer-for-Landing-Page-Designs_%7E016a776ae8d77fcaf9?source=rss","processedDate":"2024-03-18T20:19:32.272Z","postedDate":"<b>Posted On</b>: March 11, 2024 14:33 UTC","id":"016a776ae8d77fcaf9"},{"skillset":["Webflow","Web Design","Animation"],"title":"Webflow developer needed to create website with animations - Upwork","description":"\nWe are seeking an experienced Webflow developer who can create a website based on the existing design.\nThe clickable website layout is attached:\nhttps://www.figma.com/file/KmN78wHXoG0xbJEtOrENy7/Topologia.io---Website?type=design&amp;amp;node-id=590-8418&amp;amp;mode=design&amp;amp;t=j7P6xJATQikjt59k-4\nWebsite structure:\n- Homepage\n- About us\n- Products\n- Services\n- Contact us\nRequirements:\nAdaptiveness\nHigh loading speed\nAnimated interface blocks for products<b>Skills</b>:        Webflow,                     Web Design,                     Animation            ","link":"https://www.upwork.com/jobs/Webflow-developer-needed-create-website-with-animations_%7E0145b4edbfa266ae6a?source=rss","processedDate":"2024-03-18T20:19:32.272Z","postedDate":"<b>Posted On</b>: March 11, 2024 12:49 UTC","id":"0145b4edbfa266ae6a"},{"skillset":["Firebase Cloud Firestore","Firebase Realtime Database","Dart","Java","Node.js","React","Web Development","Flutter Stack","Android App","Project Management","iOS Development","Flutter","Cross Functional Team Leadership","Chat &amp; Messaging Software","Mobile Development Framework"],"title":"Live Score Website Development - Upwork","description":"We are looking for an experienced web developer to update a live score website. The aim of the project is to provide real-time updates on sports results across multiple sports and languages. The website must be fast, responsive and able to handle heavy traffic during live events, it needs to be the sofascore.com standard.\nSee more information:\nhttps://docs.google.com/document/d/1bTpnyQhe2vF820WeOcFZ6cHX0wsi2fYos8eXz-7D_wM/edit?usp=sharing<b>Skills</b>:        Firebase Cloud Firestore,                     Firebase Realtime Database,                     Dart,                     Java,                     Node.js,                     React,                     Web Development,                     Flutter Stack,                     Android App,                     Project Management,                     iOS Development,                     Flutter,                     Cross Functional Team Leadership,                     Chat &amp; Messaging Software,                     Mobile Development Framework            ","link":"https://www.upwork.com/jobs/Live-Score-Website-Development_%7E01070a43b9fe3bf392?source=rss","processedDate":"2024-03-18T20:19:32.272Z","postedDate":"<b>Posted On</b>: March 11, 2024 12:32 UTC","id":"01070a43b9fe3bf392"},{"skillset":["Website Customization","Website"],"title":"Build responsive WordPress site with booking/payment functionality - Upwork","description":" Great Articles and Essays about Transportation\nCars\nThe Pedal-to-the-Metal, Totally Illegal, Cross-Country Sprint for Glory by Charles Graeber\nA crazy dream: to beat the legendary Cannonball Run record by crossing the country in under 32 hours and 7 minutes.\nThe Incredible Story of the Great Cannonball Boom by Alex W. Palmer\nWhen the country shut down and the highways thinned out, a stealthy group of amateur car obsessives glimpsed an opportunity to revive the fabled cannonball run\nMotorhead Messiah by Clive Thompson\nJohnathan Goodwin can get 100 mpg out of a Lincoln Continental, cut emissions by 80%, and double the horsepower. Does the car business have the guts to follow him?\nRocket Car: Urban Legend? by Anonymous\nOnce upon a time, in some out-of-the-way part of the country a maniac took a rocket of some sort and mounted it on the back of a car&hellip;\nLithium Dreams by Lawrence Wright\nCan Bolivia become the Saudi Arabia of the electric-car era?\nThe Traffic Guru by Tom Vanderbilt\nTraffic engineers are rather obscure characters, though their work influences our lives every day&hellip;\nBetween the Lines by Dave Gardetta\nA journey through the world of parking\nDark Horse by Michael Zelenko\nThe story of a record-shattering, all-electric &rsquo;68 Mustang\nFlying\nNo One Can Explain Why Planes Stay in the Air by Ed Regis\nDo recent explanations solve the mysteries of aerodynamic lift?\nMaking it Fly by Peter Rinearson\nA special report on the conception, design, manufacture, marketing and delivery of a new jetliner &mdash; the Boeing 757\nThe Mother Load by P. J. O&#039;Rourke\nAn inside look at the A380, the world&rsquo;s biggest passenger plane<b>Skills</b>:        Website Customization,                     Website            ","link":"https://www.upwork.com/jobs/Build-responsive-WordPress-site-with-booking-payment-functionality_%7E01c9dd4cb7533de3d9?source=rss","processedDate":"2024-03-18T20:19:32.272Z","postedDate":"<b>Posted On</b>: March 11, 2024 05:21 UTC","id":"01c9dd4cb7533de3d9"},{"skillset":["Personal Computer","Microsoft Windows","Online Multiplayer","Game Development","Unreal Engine","C++"],"title":"Unreal Engine 5 developer - Small MMORPG style game - Upwork","description":"This project is an adventure game/MMORPG - taking references games like; Runescape, WoW, and Skyrim.\nIt&#039;s an Unreal Engine project, currently am utilizing blueprints for content implementation, though open to C++ if needed.\nVarious tasks from creating a skill based system, a mounting system, physics based chopping down trees, etc.\nFeel free to reach out if you have any questions and I look forward to working with you. \nCheers <b>Skills</b>:        Personal Computer,                     Microsoft Windows,                     Online Multiplayer,                     Game Development,                     Unreal Engine,                     C++            ","link":"https://www.upwork.com/jobs/Unreal-Engine-developer-Small-MMORPG-style-game_%7E011c7be90aacd1630e?source=rss","processedDate":"2024-03-18T20:19:32.272Z","postedDate":"<b>Posted On</b>: March 11, 2024 02:40 UTC","id":"011c7be90aacd1630e"},{"skillset":["Physical Fitness","Personal Training Session"],"title":"Virtual PT for Tracking &amp; Accountability (Must be in great shape) - Upwork","description":"I&#039;m looking for a personal trainer who is willing and able to keep me accountable 4x days per week and track workouts progress pictures, and ensure the entire journey for next 6m is tracked.\nThis will be for my wife. \nThis includes fitness + diet tracking / accountability / checkins via whatsapp and ensuring that the targets are on track\nThe tools:\n- Build the entire workout protocol and communication in Trainerize\n- Diet in MyFitnessPal \nTiming:\n- Working out will be 7-9pm W T F and S or S (3-4 per week) - 45m approx ( on Zoom / Whatsapp)\n- EASTERN TIME ZONE\n- Capturing the entire journey with weight , measurements, photos\n- Storing the data from each workout as it is happening (rep counts\n- Must be in lean / built shape. \nAttitude:\n- Cannot accept excuses\n- Must be able to hold tight on pushing\n- Must have good understanding of form\n- Great case studies <b>Skills</b>:        Physical Fitness,                     Personal Training Session            ","link":"https://www.upwork.com/jobs/Virtual-for-Tracking-amp-Accountability-Must-great-shape_%7E0128778a617bba60cd?source=rss","processedDate":"2024-03-18T20:19:32.272Z","postedDate":"<b>Posted On</b>: March 10, 2024 23:54 UTC","id":"0128778a617bba60cd"},{"skillset":["WordPress","Web Design","Graphic Design","Landing Page"],"title":"Marketing/ Design/ WordPress - Upwork","description":"Seeking Brand Refresh based on new logo\nDescription:\nSeeking a skilled professional to elevate our brand presence. The goal is to infuse a fresh and professional vibe into our marketing materials. Here are the specific tasks we need assistance with:\n1. Marketing materials:\nWe have a new logo, and we want a marketing deck template designed. additionally, we want a proposal doc (see attachment for example). \n2. Branding doc - colors, fonts, etc\n3. WordPress Website Revamp w/ new logo:\nWe&#039;re open to exploring new templates that align with our vision. The revamped website should be visually striking, user-friendly, and optimized for conversions. Think flashy direct marketing agency. .\nTimeline:\nASAP<b>Skills</b>:        WordPress,                     Web Design,                     Graphic Design,                     Landing Page            ","link":"https://www.upwork.com/jobs/Marketing-Design-WordPress_%7E013cda1426a8e1483d?source=rss","processedDate":"2024-03-18T20:19:32.272Z","postedDate":"<b>Posted On</b>: March 10, 2024 20:37 UTC","id":"013cda1426a8e1483d"},{"skillset":["Web Development","Flutter Stack","Android App","Project Management","Firebase Cloud Firestore","iOS Development","Flutter","Firebase Realtime Database","Dart","Cross Functional Team Leadership","Java","Chat &amp; Messaging Software","Node.js","Mobile Development Framework","React"],"title":"Live Score Website Development - Upwork","description":"We are looking for an experienced web developer to update a live score website. The aim of the project is to provide real-time updates on sports results across multiple sports and languages. The website must be fast, responsive and able to handle heavy traffic during live events, it needs to be the sofascore.com standard.\nSee more information:\nhttps://docs.google.com/document/d/1bTpnyQhe2vF820WeOcFZ6cHX0wsi2fYos8eXz-7D_wM/edit?usp=sharing<b>Skills</b>:        Web Development,                     Flutter Stack,                     Android App,                     Project Management,                     Firebase Cloud Firestore,                     iOS Development,                     Flutter,                     Firebase Realtime Database,                     Dart,                     Cross Functional Team Leadership,                     Java,                     Chat &amp; Messaging Software,                     Node.js,                     Mobile Development Framework,                     React            ","link":"https://www.upwork.com/jobs/Live-Score-Website-Development_%7E01e7bfc90b3ecf3da9?source=rss","processedDate":"2024-03-18T20:19:32.272Z","postedDate":"<b>Posted On</b>: March 10, 2024 18:47 UTC","id":"01e7bfc90b3ecf3da9"},{"skillset":["Web Application","PHP","Java","Adobe Photoshop","Web Development","HTML5","CSS","JavaScript","Web Design","Graphic Design"],"title":"Casino Betting Game Website Developer Required who is expert in his ui work. - Upwork","description":"Casino Betting Game Website Developer Required who is expert in his ui work.\nIf you are already have done a work for a betting game then share me the details in your proposal or if you can help me to build w website for color betting game then send me proposal.\nDeveloper should be free from work and be available to finish the work fast<b>Skills</b>:        Web Application,                     PHP,                     Java,                     Adobe Photoshop,                     Web Development,                     HTML5,                     CSS,                     JavaScript,                     Web Design,                     Graphic Design            ","link":"https://www.upwork.com/jobs/Casino-Betting-Game-Website-Developer-Required-who-expert-his-work_%7E01a25ed0e54f1eae42?source=rss","processedDate":"2024-03-18T20:19:32.272Z","postedDate":"<b>Posted On</b>: March 10, 2024 11:57 UTC","id":"01a25ed0e54f1eae42"},{"skillset":["Conversion Rate Optimization"],"title":"Conversion Rate Optimization Specialist Needed for Marketing Agency w/ many clients - Upwork","description":"Hey!\nI&#039;m looking to hire a conversion rate optimization expert for my marketing agency. My agency, Axelsson Digital, exclusively helps furniture and home decor/homeware brands increase their online sales via paid ads on platforms such as Google Ads and Meta Ads. We are extremely results-focused and our top priority is delivering astonishing client results without the typical agency BS.\nWe have a lot of clients that we&#039;re currently running Google Ads and Meta Ads for, and we usually operate on a 100% performance based pricing structure, which means that we only charge our clients a specific percentage of the revenue - ad spend that we bring them from our ads. This pricing structure highlights the importance of my clients having a high conversion rate, which is where you come into the mix.\nYour Role:\n- Conversion Rate Expert: I&#039;m looking for a conversion rate optimization expert who is very experienced in using Shopify, WordPress, and Squarespace.\n- I&#039;m looking for someone with several case studies/past client results at hand.\n- If you have previous experience working with furniture/homeware/home decor brands then that&#039;s a huge plus.\n- I&#039;m looking for someone who speaks good English for effective communication with me and my team. You will only be communicating with me and my team, and not directly with my clients.\nIf this sounds like you, shoot me a message and I&#039;m happy to have a conversation.\nBest,\nAnton<b>Skills</b>:        Conversion Rate Optimization            ","link":"https://www.upwork.com/jobs/Conversion-Rate-Optimization-Specialist-Needed-for-Marketing-Agency-many-clients_%7E01a814cd110e797e9f?source=rss","processedDate":"2024-03-18T20:19:32.272Z","postedDate":"<b>Posted On</b>: March 10, 2024 11:09 UTC","id":"01a814cd110e797e9f"},{"skillset":["PHP","API Integration","CSS","JavaScript","HTML","Joomla"],"title":"Build a funnel website template - Upwork","description":"I would like a website template I can upload to my Wordpress that copies the chat functionality seen in this website (not my website):\nhttps://topcarehotline.com/aca10-wa2/?s1=7&amp;amp;s2=ACA&amp;amp;s3=3f97116c913b4b519a6c072fe65cf277&amp;amp;vclid=w1jdk9uuntsqalnv22qfbth4&amp;amp;version=hv-2\nI also have a Ringba script like the one on this site that needs to run similarly. I want to be able to spin up more sites like this easily in Wordpress and have the ability to easily change the chat flow and messages. <b>Skills</b>:        PHP,                     API Integration,                     CSS,                     JavaScript,                     HTML,                     Joomla            ","link":"https://www.upwork.com/jobs/Build-funnel-website-template_%7E016ad773b5ca826796?source=rss","processedDate":"2024-03-18T20:19:32.272Z","postedDate":"<b>Posted On</b>: March 10, 2024 01:39 UTC","id":"016ad773b5ca826796"},{"skillset":["Avada Theme Customization","Yoast SEO","WordPress","Landing Page","On-Page SEO"],"title":"WordPress Designer w/ SEO and Avada Theme Experience - Upwork","description":"About Us: We are an SEO-centric digital marketing agency primarily focused on optimizing and expanding existing WordPress websites for our diverse client base. Our work involves a balanced mix of enhancing current websites (approximately 75%) and designing new ones (around 25%), all while integrating SEO best practices to improve site performance and user experience.\nJob Overview: We are looking for a multi-talented WordPress and SEO Specialist who is proficient in the Avada theme. This role is ideal for someone who excels in both the creative aspects of website design and the analytical world of SEO. Your primary focus will be on optimizing and expanding current client websites, while also occasionally building new websites from the ground up.\nResponsibilities:\n-- Optimize and expand existing WordPress websites using the Avada theme, ensuring both design excellence and SEO effectiveness.\n-- Design and develop new websites, landing pages, and page templates, aligning them with our clients&#039; branding and SEO objectives.\n-- Use Avada layout builder to create custom page templates and implement design best practices. Leverage the Avada page builder to create re-usable elements and global elements to improve design efficiency. \n-- Regularly update website elements for SEO optimization, including title tags, meta descriptions, page headings, and on-page content.\n-- Assist in on-page content enhancement and modification using tools like Chat GPT, tailored for SEO needs. (Specifically title tags, meta descriptions, and page sub-headings/section headings that may be need optimized when building pages)\n-- Manage forms creation, image optimization, and other website functionalities.\n-- Work collaboratively on SEO strategy, including page optimization, keyword research, and site structure decisions.\n-- Monitor and report on website performance, suggesting and implementing improvements. Ideally, you could proactively suggest modifications as you become experienced with our client websites,. \nRequired Skills and Experience:\n-- Strong experience in WordPress website design and development, especially with the Avada theme.\n-- Solid understanding of on-page SEO principles and how to apply them in website design and content.\n-- Proven ability to manage and improve existing websites with a focus on SEO performance.\n-- Creativity in web design coupled with a strategic approach to SEO.\n-- Familiarity with Siteground hosting and staging environments is preferred.\n-- Excellent problem-solving skills and a proactive attitude towards website and SEO improvement.\nApplication Process:\nPlease share your portfolio highlighting your experience with WordPress design, particularly with the Avada theme, and any relevant SEO work. Include a brief overview of your role and contributions in each project, focusing on how you&#039;ve blended design and SEO for optimal outcomes.\nWe&#039;re looking for someone who possesses a blend of creativity, technical know-how, and a strategic mindset in SEO to actively contribute to the growth and success of our client websites.<b>Skills</b>:        Avada Theme Customization,                     Yoast SEO,                     WordPress,                     Landing Page,                     On-Page SEO            ","link":"https://www.upwork.com/jobs/WordPress-Designer-SEO-and-Avada-Theme-Experience_%7E01c61669022e4793f7?source=rss","processedDate":"2024-03-18T20:19:32.272Z","postedDate":"<b>Posted On</b>: March 09, 2024 22:56 UTC","id":"01c61669022e4793f7"},{"skillset":["UI Animation","Figma"],"title":"UI Designer w/Figma Animation Experience - Upwork","description":"Seeking an experienced ux/ui designer to mockup a few ideas on an existing design.&nbsp;&nbsp;Must have experience doing animations in Figma and be creative as it relations to motion graphics.\nBonus if you have lottie experience!\nInterviewing and hiring today!&nbsp;&nbsp;Let&#039;s work!<b>Skills</b>:        UI Animation,                     Figma            ","link":"https://www.upwork.com/jobs/Designer-Figma-Animation-Experience_%7E01f92034dccf137ffd?source=rss","processedDate":"2024-03-18T20:19:32.272Z","postedDate":"<b>Posted On</b>: March 09, 2024 13:35 UTC","id":"01f92034dccf137ffd"},{"skillset":["Landing Page","Shopify","Lead Generation"],"title":"Landing Page for Weight Loss Product - Upwork","description":"Create a funnel design and implement a converting sales funnel for our weight loss product. Help guide potential customers through a seamless journey, from initial interest to successful conversion.\nDevelop a strategic funnel tailored to our target audience and product offering.\nDesign and optimize landing page(s), sales pages, and checkout processes for maximum conversion rates.\nWritten w/ Hook, Story, Offer\nHistory with a funnel-building platform such as ClickFunnels, Leadpages, or Gempages.<b>Skills</b>:        Landing Page,                     Shopify,                     Lead Generation            ","link":"https://www.upwork.com/jobs/Landing-Page-for-Weight-Loss-Product_%7E01ee88611ed59a42ef?source=rss","processedDate":"2024-03-18T20:19:32.272Z","postedDate":"<b>Posted On</b>: March 08, 2024 22:07 UTC","id":"01ee88611ed59a42ef"},{"skillset":["List Building","Lead Generation","Online Research","Market Research"],"title":"Literary Agent and Publishing Research  - Upwork","description":"Rate is a placeholder - send me your flat rate \nI&#039;m a tarot reader/author/teacher who has self published a journal  on Amazon (Soul Stitches Shadow Work).\nNo.w, I&#039;m working on a new idea in the spiritual wheelhouse of tarot, oracle cards, spiritual workbooks, shadow work.\nI need someone to create a comprehensive google sheet list of publishing companies that I can pitch this to (those who are in this realm.) I need name contact info, link to submission guidelines and a whether you must have an agent.\nI need a second list of literary agents currently taking submissions that represent witchy new age clients like me. Need all their info and links to proceed etc.\nLet me know how much this would cost and delivery time. <b>Skills</b>:        List Building,                     Lead Generation,                     Online Research,                     Market Research            ","link":"https://www.upwork.com/jobs/Literary-Agent-and-Publishing-Research_%7E0125f8ba000097f830?source=rss","processedDate":"2024-03-18T20:19:32.272Z","postedDate":"<b>Posted On</b>: March 08, 2024 21:07 UTC","id":"0125f8ba000097f830"},{"skillset":["Django","Python","Celery","React"],"title":"Senior Django/Python dev  to join our fun team of remote developers (SaaS Product)  - Upwork","description":"We started Proven to help founders and entrepreneurs save money and find the right partners to work with. We have an amazing team of great developers who are based in Ukraine, Spain, Italy, USA, and Poland, and now, we are looking for YOU to join our team. You&#039;re a great communicator and a great coder, and you love working on interesting jobs and ideas with a great group of people. \nAt GetProven, we specialize in community management products primarily for Venture Capital firms, Private Equity firms, FDI Departments, and B2B Banking. Our goal is to facilitate connections and offer solutions that drive investment and growth. As a company working with world-class Venture capital firms, Private Equity firms, B2B Banks, and governments. , we are committed to delivering top-quality code and innovative solutions. Read more at getproven.com\nJob Description:\nWe are seeking a Senior Django Developer with a minimum of 5 years of experience, specifically in a SaaS product company. The ideal candidate should have a strong background in building complex, scalable software systems. We are not looking for candidates who have only worked on website or CMS development.\nResponsibilities:\nDevelop and maintain advanced SaaS product using Django.\nWork closely with cross-functional teams to understand and transform business requirements into scalable solutions.\nContribute to all phases of the development lifecycle, ensuring top-quality output.\nOptimize applications for maximum speed and scalability.\nProvide technical leadership and mentor junior team members.\nEnsure security and privacy compliance in all aspects of development.\nQualifications:\n5+ years of professional experience in Django development.\nDeep knowledge of Django ORM and a good understanding of database architecture principles.\nStrong proficiency in developing REST APIs.\nSolid experience in writing unit and integration tests.\nFamiliarity with front-end technologies like JavaScript, HTML5, and CSS3.\nExcellent problem-solving, analytical, and troubleshooting skills.\nProven track record of working in a SaaS product company, demonstrating an ability to handle complex logic and data structures.\nExperience with cloud services and database technologies.\nAbility to work independently with minimal supervision and a commitment to writing clean, maintainable, \nGood to Have:\nExperience with multi-tenancy.\nExperience with server side technologies like Celery, Elasticsearch, Redis, Docker, and AWS services (RDS, EC2, S3, Route53, Cloudfront).\nWhat We Offer:\nAn opportunity to work on challenging projects with a dynamic and talented team.\nA culture that values innovative thinking and passionate individuals.\nRemote first mindset \nEquity and Stock Options in a bootstrapped, profitable startup \nAnnual trips to meet the team in fun locations around the world. \n________________________________________\nProbationary Period:\nThe initial period of one month will be probationary, during which we will assess the candidate&#039;s fitment for the role. Depending on the circumstances, we may require the candidate to start working via Upwork for the first 1-2 months.\nHiring Process:\nOur standard hiring process is designed to ensure a comprehensive evaluation of each candidate&#039;s skills and potential fit with our team. It includes the following stages:\nOnline Aptitude Test: Approximately 1 hour, assessing problem-solving and technical skills.\nCode Assignment: Candidates will be given a coding task that typically requires around 2 days to complete. We offer up to 1 week for completion to accommodate different schedules.\nInterview with the CTO: A technical interview to discuss the candidate&#039;s technical expertise, experience, and the code assignment.\nInterview with the CEO: A final interview to assess cultural fit and alignment with our company&#039;s values and goals.\nCandidates will be evaluated at each stage to ensure they meet the high standards required for the role.\nReady to Code the Extraordinary? Join Proven.<b>Skills</b>:        Django,                     Python,                     Celery,                     React            ","link":"https://www.upwork.com/jobs/Senior-Django-Python-dev-join-our-fun-team-remote-developers-SaaS-Product_%7E01ffbef2aaf2c8b508?source=rss","processedDate":"2024-03-18T20:19:32.272Z","postedDate":"<b>Posted On</b>: February 06, 2024 23:52 UTC","id":"01ffbef2aaf2c8b508"},{"skillset":["WordPress","Website Optimization","WooCommerce","WP Rocket","Divi","Elementor","W3 Total Cache","WordPress Optimization","Page Speed Optimization","Performance Optimization","Database Optimization","Cloudflare","Browser Caching","On-Page SEO","Google Search Console"],"title":"WordPress Speed optimization, Humming Bird/Cloudflare - Upwork","description":"I need to get a price for updating my website. I use Cloudflare and Hummingbird. \nI have had cache issues and use WPMUDEV for hosting.&nbsp;&nbsp;It has been several years since I updated Cloudflare and Humming Bird is on minimal settings because of too many loading errors.\nI would like a price on getting this resolved. Mobile load speeds are very important as well. \nIf I can get this one site resolved I have another to follow. <b>Skills</b>:        WordPress,                     Website Optimization,                     WooCommerce,                     WP Rocket,                     Divi,                     Elementor,                     W3 Total Cache,                     WordPress Optimization,                     Page Speed Optimization,                     Performance Optimization,                     Database Optimization,                     Cloudflare,                     Browser Caching,                     On-Page SEO,                     Google Search Console            ","link":"https://www.upwork.com/jobs/WordPress-Speed-optimization-Humming-Bird-Cloudflare_%7E014eb0bf1f29103b55?source=rss","processedDate":"2024-03-18T20:19:32.272Z","postedDate":"<b>Posted On</b>: March 08, 2024 18:39 UTC","id":"014eb0bf1f29103b55"},{"skillset":["SQL","Web Design"],"title":"Website  - Upwork","description":"Website similar to these:\nhttps://www.skydropx.com/paqueterias/entrega/opiniones\nhttps://enviosperros.com/?utm_source=google_ads&amp;amp;utm_medium=pagina_principal&amp;amp;utm_campaign=p_envios_perros&amp;amp;utm_term=envios%20perros&amp;amp;utm_campaign=Search+-+Marca&amp;amp;utm_source=adwords&amp;amp;utm_medium=ppc&amp;amp;hsa_acc=2785817635&amp;amp;hsa_cam=20069140774&amp;amp;hsa_grp=151138015880&amp;amp;hsa_ad=656982117328&amp;amp;hsa_src=g&amp;amp;hsa_tgt=kwd-1132967060796&amp;amp;hsa_kw=envios%20perros&amp;amp;hsa_mt=b&amp;amp;hsa_net=adwords&amp;amp;hsa_ver=3&amp;amp;gad_source=1&amp;amp;gclid=CjwKCAiAi6uvBhADEiwAWiyRdlg4CDTdCStBj0wU8xlNjA3nkk2blppd-9GbDQkVnnHeAwrzn0d4TxoCp_IQAvD_BwE\nWe will be integrating an invoicing program and\nWill work with the person who created the program (Spanish language highly recommended) and the skills necessary are:\nSystem technologies\n- Laravel\n- MySQL\n- Vue JS\nConnection requirements\n- Knowledge of connecting to a REST type API\n- Handling of Authentication with tokens (Bearer)\n- Knowledge of how to manipulate JSON\nSuggestion\n- Development of a website with React JS or Vue JS\n- Responsive site management\n- Integration with basic OWASP security\nWe will also need that this website can be integrated in Shopify, woocommerce, etc.<b>Skills</b>:        SQL,                     Web Design            ","link":"https://www.upwork.com/jobs/Website_%7E0140b59f1927c5171d?source=rss","processedDate":"2024-03-18T20:19:32.272Z","postedDate":"<b>Posted On</b>: March 08, 2024 12:05 UTC","id":"0140b59f1927c5171d"},{"skillset":["Figma","Web Design","Wireframing","User Flow","Responsive Design"],"title":"Wed Design UI/UX - Upwork","description":"We need a Web Designer who is:\n1. Great at UI/UX and designing websites\n2. Searching for a long term client with consistent work\nPlease note that I already have a developer, I need a designer now.\nThe first task is to design a landing page for real estate project with 5 apartments. You will be given the content, colors and font. You must design the landing page and its sections in a beautiful and holistic way.\nHere is an example of what a competitor is doing, we want to be on this level: https://www.arrive-im-herzogpark.de/\nI have paid my team over 28,000.00$ here on Upwork and have 96 reviews with a score of 4.97, so you know I am fair and generous.\nPlease see the screenshot here of a contract with one of my team members: https://bit.ly/4brBnW3\nPlease send me your portfolio of websites, that have amazing design!\nLast thing: Please tell me your favourite fruit as the first word in your response to this job.\nLooking forward to your application.\nThank you,\nTulsa<b>Skills</b>:        Figma,                     Web Design,                     Wireframing,                     User Flow,                     Responsive Design            ","link":"https://www.upwork.com/jobs/Wed-Design_%7E018b5f88069569c6f4?source=rss","processedDate":"2024-03-18T20:19:32.272Z","postedDate":"<b>Posted On</b>: March 08, 2024 09:11 UTC","id":"018b5f88069569c6f4"},{"skillset":["PHP","Symfony","Vue.js","Bootstrap","Docker","Shopware","CI/CD"],"title":"Senior Front End Developer - Specialised in Bootstrap 5 - Upwork","description":"As a Frontend Developer, you will play a pivotal role in shaping the user interface and experience of our web applications. You will be responsible for converting and implementing high-performance, responsive, and visually appealing front-end solutions that meet the needs of our users.\nKey Responsibilities:\n&bull; Lead the development of web applications using Modern frontend framework like Bootstrap 5 and related technologies.\n&bull; Convert Figma to Pixel perfect layout using Bootstrap 5.\n&bull; Having basic animation skills using any of the different front end animation framework / libraries eg: any other frontend animation framework.\n&bull; Experience or having knowledge of Twig / Blade Template engine is a plus.\n&bull; Collaborate closely with the design and product teams to translate design prototypes into responsive and interactive web interfaces.\n&bull; Optimize application performance and ensure seamless user experiences by identifying and resolving performance bottlenecks.\n&bull; Write clean, well-documented, and maintainable code following best practices and coding standards eg: schema.org.\n&bull; Stay up-to-date with the latest trends and advancements in front-end development and JS ecosystem.\n&bull; Troubleshoot and debug issues to ensure the highest level of software quality.\n&bull; Collaborate with cross-functional teams, including back-end developers, UX/UI designers, and QA engineers, to deliver projects on time and within scope.\n&bull; Participate in the evaluation and adoption of new tools, technologies, and frameworks that improve development processes, Figma is out main tool buddy.\n&bull; Lead and contribute to the continuous improvement of development methodologies and practices.\nQualifications:\n&bull; Bachelor&#039;s degree in Computer Science, Information Technology, or a related field.\n&bull; 4+ years of professional experience in front-end development with a strong focus on jQuery and JS Frameworks including Vanilla JS.\n&bull; Proficiency in JavaScript and related libraries and frameworks (e.g., Bootstrap, Webpack).\n&bull; Strong understanding of HTML5, CSS3, and responsive design principles and W3C standards.\n&bull; Experience with RESTful APIs and asynchronous data fetching.\n&bull; Knowledge of version control systems (e.g., Git) and agile development methodologies.\n&bull; Familiarity with testing frameworks and tools (e.g., Jest, Enzyme) is a plus.\n&bull; Excellent problem-solving skills and the ability to work independently or in a team.\n&bull; Effective communication and collaboration skills\nPlease start your bid with the keyword &amp;quot;I am Frontend Developer with Animation Skills&amp;quot; if you miss this line in your proposal, we will assume you have not read the description carefully and so we will discard your bid /proposal.\nThanks and Happy Bidding!<b>Skills</b>:        PHP,                     Symfony,                     Vue.js,                     Bootstrap,                     Docker,                     Shopware,                     CI/CD            ","link":"https://www.upwork.com/jobs/Senior-Front-End-Developer-Specialised-Bootstrap_%7E01fb0ddd177d242152?source=rss","processedDate":"2024-03-18T20:19:32.272Z","postedDate":"<b>Posted On</b>: March 08, 2024 08:38 UTC","id":"01fb0ddd177d242152"},{"skillset":["Graphic Design","Web Design","Shopify","Marketing Strategy"],"title":"Build out a full ecom funnel. (Mens Heart Health Brand)  - Upwork","description":"Hi!\nI&#039;m going to get right to the point.\nOk I want a full ecom site designed and built out and ready to start taking orders. \n-This will look high end direct response style \n-Design style:&nbsp;&nbsp;Men should feel this brand gives them status&nbsp;&nbsp;\n-The funnel will have upsells/ OTOs ( about 3) \n- I expect you to know some great ecom style pages that you know about to show me and why.\nI will give you some examples of what i like but i&#039;m also open to ideas of&nbsp;&nbsp;some top converting pages/offers.\nI will want to have a 15 -20 min meeting with you to see if you are the fit for me. \nI expect high end work for this brand and will pay well for it do be done with the attention and quilty i expect. \nI&#039;m fun to work with and it&#039;s a fun brand! \nAlso we&nbsp;&nbsp;already have all the branding done and concepts already designed ( i just want you to look at them and make them better) \n*You are going to have to be proactive and ASK FOR THINGS YOU NEED for a killer page and store.&nbsp;&nbsp;Come to me with proven concepts from other brands and ask if i can get you what you need to make it for me! \n*I have attached a link to the product so you can see what the brand is and about.. take a look! \nhttps://drive.google.com/file/d/1Y7NjiM92aJXFrW8oqJWfhk31VagDNRno/view?usp=sharing<b>Skills</b>:        Graphic Design,                     Web Design,                     Shopify,                     Marketing Strategy            ","link":"https://www.upwork.com/jobs/Build-out-full-ecom-funnel-Mens-Heart-Health-Brand_%7E01f1caa7aed1fa17cc?source=rss","processedDate":"2024-03-18T20:19:32.272Z","postedDate":"<b>Posted On</b>: March 07, 2024 23:35 UTC","id":"01f1caa7aed1fa17cc"},{"skillset":["jQuery","Bootstrap","WordPress","CSS","CSS 3","Landing Page","Web Development","JavaScript","Elementor","WordPress Development"],"title":"WordPress Expert to Convert Figma Design to WordPress Pixel Perfect - Upwork","description":"I have a 3 Pages Figma Design for a WordPress Website :\n1- Home Page + Responsive\n2- Blog Listing + Responsive\n3- Blog Article + Responsive\nI need to convert it to fully functional design on WordPress with all of it&#039;s animation like Figma, I don&#039;t mind using WPBakery or Elementor unless the output design is pixel perfect and like Figma.\nHere is the design, Kindly check and let me know time and cost for it.\nhttps://www.figma.com/file/TS7873VXodzbqatzhqTwiM/Galaxyfy-%7C-Client?type=design&amp;amp;node-id=4079%3A1380&amp;amp;mode=design&amp;amp;t=o8iBaW1ikDtQc3nZ-1\nThank you.<b>Skills</b>:        jQuery,                     Bootstrap,                     WordPress,                     CSS,                     CSS 3,                     Landing Page,                     Web Development,                     JavaScript,                     Elementor,                     WordPress Development            ","link":"https://www.upwork.com/jobs/WordPress-Expert-Convert-Figma-Design-WordPress-Pixel-Perfect_%7E01a7946513fee67b89?source=rss","processedDate":"2024-03-18T20:19:32.272Z","postedDate":"<b>Posted On</b>: March 07, 2024 22:54 UTC","id":"01a7946513fee67b89"},{"skillset":["WordPress","Web Design","CSS","HTML"],"title":"WordPress - Travel Blog Website Setup - Upwork","description":"I&#039;m travelling around the world with my family and I want to set up a travel blog to inform others.\nI&#039;d prefer a template and you can install any dummy content and layout so I can just add my photos and text.\nSuch as:\nhttps://preview.themeforest.net/item/backpack-traveler-modern-travel-blog/full_screen_preview/22673908?_ga=2.121715787.1515558466.1709748767-2105756867.1698915004&amp;amp;_gac=1.91455976.1708939389.CjwKCAiAivGuBhBEEiwAWiFmYfgVM6f425rga_r5h16Jn8rtRuvweONWEYHk03Fu6V_W_wjy6zgnPRoCOKwQAvD_BwE\nBut needs to be up to date theme with support available for 3-6 ,months.\nI need it to have travel guides for each country then various cities such as Morocco - Fes/Casablanca/Marraketch etc.\nAlso needs general travel cateogy with post wth travel tips for driving, packing etc.\nEach country will also need a rating at the top for internet speed, safety, food, communicatoin and I will rate them all out of 10.\nSite will be based on photos and videos with text also. needs to be well laid out with easy to find clicks for similar posts under the same country or heading such as:\nhttps://www.journalofnomads.com/23-travel-tips-for-morocco/\nI will need to add social and email also.<b>Skills</b>:        WordPress,                     Web Design,                     CSS,                     HTML            ","link":"https://www.upwork.com/jobs/WordPress-Travel-Blog-Website-Setup_%7E0128ff44e49009cb1a?source=rss","processedDate":"2024-03-18T20:19:32.272Z","postedDate":"<b>Posted On</b>: March 07, 2024 16:10 UTC","id":"0128ff44e49009cb1a"},{"skillset":["Cloud Architecture","Cloud Engineering","Cloud Migration","Amazon Web Services","App Development","Platform-as-a-Service Framework"],"title":"AWS Cloud Compute, Migration, Modern Dat APLtform, App Dev help NOW - Upwork","description":"Just need help w/ AWS cloud questions. ASAP\n- Experience with operational parameters and troubleshooting for four of the following technical domains: Compute/ Storage/ Networking/ CDN/ Databases/ DevOps/ Big Data and Analytics/ Security/ Applications Development in a distributed systems environment<b>Skills</b>:        Cloud Architecture,                     Cloud Engineering,                     Cloud Migration,                     Amazon Web Services,                     App Development,                     Platform-as-a-Service Framework            ","link":"https://www.upwork.com/jobs/AWS-Cloud-Compute-Migration-Modern-Dat-APLtform-App-Dev-help-NOW_%7E0198aaa383a4a8b2f0?source=rss","processedDate":"2024-03-18T20:19:32.272Z","postedDate":"<b>Posted On</b>: March 07, 2024 15:21 UTC","id":"0198aaa383a4a8b2f0"},{"skillset":["REST API","Android","API","Generative AI"],"title":"An AI-based app that turns a prompt into API requests - Upwork","description":"We are a Fintech with a set of REST APIs for building and backtesting financial portfolios.\nWe want to develop a new interface based on generative AI prompts. \nThis new interface would be a mobile app. That app would take instructions from the user and, based on that, will use the APIs to create an investment portfolio. \nYou can find an explanation of the project here: https://docs.google.com/document/d/1wHiXCR6nCLgEVdsKguBSoqQcdGaX7hQkCbU0XcJTDsM/edit?usp=sharing\nIf a new REST API is part of the solution, we strongly prefer to have it built using Python&#039;s FastAPI.\nPlease provide examples of similar projects you have developed in the past. Agencies are welcome.\nPlease write &amp;quot;Financial Indexes&amp;quot; at the beginning of your cover letter. Otherwise, you won&#039;t be considered for the project.<b>Skills</b>:        REST API,                     Android,                     API,                     Generative AI            ","link":"https://www.upwork.com/jobs/based-app-that-turns-prompt-into-API-requests_%7E01b951caada6078c2c?source=rss","processedDate":"2024-03-18T20:19:32.272Z","postedDate":"<b>Posted On</b>: March 07, 2024 14:09 UTC","id":"01b951caada6078c2c"}]